<html>
<head>
<title>ToonTalk - Os adultos perguntam: O que é ToonTalk?</title>
<link rel="stylesheet" type="text/css" href="ToonTalk.css">
</head>

<body link="#0000ff" vlink="#800080" bgcolor="#ffffff">

<div align="center">
<a name="topo"></a>
<table width=468 cellspacing=0 cellpadding=0 border=0><tr><td>

<p>
<table cellspacing=0 cellpadding=0 border=0><tr><td>
<div align=center>
<A class=menu href="toontalk.html" onmouseover="window.status=' Início'; return true">in&iacute;cio</a><span class=bola> &#0149;</span>
<A class=menu href="search.html" onmouseover="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<A class=menu href="buy.html" onmouseover="window.status=' Compra'; return true">compra</a><span class=bola> &#0149;</span>
<A class=menu href="doc.html" onmouseover="window.status=' Manual'; return true">manual</a><span class=bola> &#0149;</span>
<A class=menu href="whatsnew.html" onmouseover="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<A class=menu href="faq.html" onmouseover="window.status=' Dúvidas'; return true">d&uacute;vidas</a><span class=bola> &#0149;</span>
<A class=menu href="support.html" onmouseover="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<A class=menu href="free.html" onmouseover="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<A class=menu href="press.html" onmouseover="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<A class=menu href="address.html" onmouseover="window.status=' Contato'; return true">contato</a>
<hr size=1></div>
    </td></tr>
</table>

<h2>Os adultos perguntam: &quot;O que &eacute; ToonTalk?&quot;</h2>

<p>O ToonTalk &eacute; uma esp&eacute;cie completamente nova de software &ndash; simultaneamente <A href="computer.html">uma linguagem atual de programa&ccedil;&atilde;o e um videogame.</a>

<p>A programa&ccedil;&atilde;o de computadores pode ser uma atividade <b>criativa, habilitadora e recompensadora.</b> Os programas podem ser 
            constru&iacute;dos para uma incr&iacute;vel variedade de 
            objetivos-jogos, m&uacute;sica, matem&aacute;tica, anima&ccedil;&atilde;o, simula&ccedil;&atilde;o, ci&ecirc;ncia, linguagem, rob&oacute;ticas, educa&ccedil;&atilde;o. O processo de elabora&ccedil;&atilde;o de programas exige um rico conjunto de habilidades de <A
 href="think.html" >solu&ccedil;&atilde;o de problemas</a> <b>que envolve a an&aacute;lise e o projeto</b>. E 
            a programa&ccedil;&atilde;o de computadores &eacute; uma mat&eacute;ria digna de ser aprendida por seus pr&oacute;prios m&eacute;ritos.

<p>Mas a programa&ccedil;&atilde;o pode ser 
            dif&iacute;cil de aprender e dif&iacute;cil de realizar. Os programadores usualmente t&ecirc;m de aprender uma linguagem de programa&ccedil;&atilde;o textual formal cheia de dif&iacute;ceis conceitos abstratos tais como vari&aacute;veis, procedimentos, fluxo de controle, estruturas de dados, modularidade e recurs&atilde;o. Algumas crian&ccedil;as aprendem linguagens como<A href="logo.html"> Logo</a> ou Basic, especialmente quando s&atilde;o ensinadas por um professor talentoso e dedicado, mas a maioria as consideram frustrantes e aborrecidas. 

<p>Ele <b>n&atilde;o 
            &eacute; apenas f&aacute;cil de aprender, mas divertido tamb&eacute;m</b>. Ele se assemelha grandemente aos videogames 
            h&aacute; agr&aacute;ficos e anima&ccedil;&otilde;es atraentes, um mundo virtual para explorar, personagens animados para interagir e dos quais receber ajuda.  As crian&ccedil;as podem aprender o ToonTalk atrav&eacute;s do jogo tutorial, vendo &quot;exemplos&quot; e &quot;tours&quot;, ou explorando-o, com ou sem a ajuda de um treinador e guia marciano animado.

<p>Mas o ToonTalk n&atilde;o &eacute; apenas um videogame para ensinar programa&ccedil;&atilde;o &ndash; o pr&oacute;prio ato de construir, rodar e consertar as falhas de programas &eacute; como jogar um jogo de aventura. No ToonTalk, <b>n&atilde;o &eacute; apenas divertido jogar</b> 
            com a cria&ccedil;&atilde;o resultante, &eacute; divertido cri&aacute;-la. 
<p>
<hr size=1>

  <p><i>&quot;A natureza 
            mutante do computador &eacute; tal que ele pode agir como uma 
            m&aacute;quina ou como uma linguagem a ser moldada e explorada. Ele &eacute; um meio que pode simular dinamicamente os detalhes de qualquer outro meio, incluindo meios que n&atilde;o existam fisicamente. Ele n&atilde;o &eacute; uma ferramenta, embora ele possa agir como muitas. Ele &eacute; o primeiro &quot;metameio&quot;, e como tal possui graus de liberdade para a representa&ccedil;&atilde;o e express&atilde;o jamais encontrados antes e por enquanto pouco estudados. Ainda mais importante, ele &eacute; divertido, e portanto, por sua qualidade intr&iacute;nseca, vale a pena utiliz&aacute;-lo. </i>
  <p><i>... Os computadores 
            s&atilde;o para a computa&ccedil;&atilde;o o que os instrumentos 
            s&atilde;o para a m&uacute;sica. O software &eacute; o resultado, cuja interpreta&ccedil;&atilde;o amplifica nosso alcance e eleva nosso esp&iacute;rito. Leonardo da Vinci chamou a m&uacute;sica de a `forma&ccedil;&atilde;o do invis&iacute;vel', e sua frase &eacute; ainda mais adequada como uma descri&ccedil;&atilde;o do software.&quot;</i> 
  <blockquote>
    <p>- Alan Kay, &quot;Computer Software&quot;, <i>Scientific American</i>, 
                setembro de 1984</p>   
  </blockquote>

<p>
<hr size=1><div align=center>
<A class=menu href="toontalk.html" onmouseover="window.status=' Início'; return true">in&iacute;cio</a><span class=bola> &#0149;</span>
<A class=menu href="search.html" onmouseover="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<A class=menu href="buy.html" onmouseover="window.status=' Compra'; return true">compra</a><span class=bola> &#0149;</span>
<A class=menu href="doc.html" onmouseover="window.status=' Manual'; return true">manual</a><span class=bola> &#0149;</span>
<A class=menu href="whatsnew.html" onmouseover="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<A class=menu href="faq.html" onmouseover="window.status=' Dúvidas'; return true">d&uacute;vidas</a><span class=bola> &#0149;</span>
<A class=menu href="support.html" onmouseover="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<A class=menu href="free.html" onmouseover="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<A class=menu href="press.html" onmouseover="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<A class=menu href="address.html" onmouseover="window.status=' Contato'; return true">contato</a></div></td>

</tr></table>
</div>
</body></html>

<!--  FuturArte Editora Ltda.                                     Divertire  -->