<html>
<head>
<title>A hist&oacute;ria do lan&ccedil;amento das vers&otilde;es beta do ToonTalk</title>
<link rel="stylesheet" type="text/css" href="ToonTalk.css">
</head>

<body link="#0000ff" vlink="#800080" bgcolor="#ffffff">

<div align="center">
<a name="topo"></a>
<table width=468 cellspacing=0 cellpadding=0 border=0><tr><td>

<p>
<table cellspacing=0 cellpadding=0 border=0><tr><td>
<div align=center>
<A class=menu href="toontalk.html" onmouseover="window.status=' Início'; return true">in&iacute;cio</a><span class=bola> &#0149;</span>
<A class=menu href="search.html" onmouseover="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<A class=menu href="buy.html" onmouseover="window.status=' Compra'; return true">compra</a><span class=bola> &#0149;</span>
<A class=menu href="doc.html" onmouseover="window.status=' Manual'; return true">manual</a><span class=bola> &#0149;</span>
<A class=menu href="whatsnew.html" onmouseover="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<A class=menu href="faq.html" onmouseover="window.status=' Dúvidas'; return true">d&uacute;vidas</a><span class=bola> &#0149;</span>
<A class=menu href="support.html" onmouseover="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<A class=menu href="free.html" onmouseover="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<A class=menu href="press.html" onmouseover="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<A class=menu href="address.html" onmouseover="window.status=' Contato'; return true">contato</a>
<hr size=1></div>
    </td></tr>
</table>

<h2>A hist&oacute;ria do lan&ccedil;amento das vers&otilde;es beta <br> do ToonTalk</h2>

<p>O Beta 14 <A href="bugs.html#Beta14">principalmente corrige problemas</a>. Ela suporta um novo formato colocando os 
            objetos do ToonTalk no clipboard do Windows. Este novo formato deve ser seguro para envio por e-mail. O Beta 14 pode tamb&eacute;m ler o formato antigo, mas o Beta 13 n&atilde;o pode ler objetos do ToonTalk salvos no Beta 14 ou posterior. Beta 14 tamb&eacute;m altera o sentido do controle remoto de visibilidade para imagens. O ajuste &quot;See Some&quot; (&quot;Veja Alguns&quot;) agora torna o fundo (negro se for uma imagem importada pelo usu&aacute;rio) transparente. E o ajuste &quot;See Nothing&quot; (&quot;N&atilde;o veja nada&quot;)  n&atilde;o torna mais as imagens que foram adicionadas &agrave; imagem invis&iacute;vel invis&iacute;veis tamb&eacute;m. O Beta 14A <A href="bugs.html#Beta14A">corrige diversos problemas</a>. O Beta 14B corrige <A href="bugs.html#Beta14B">diversos problemas</a>.

<p>O Beta 13 fornece a voc&ecirc; a capacidade de <A
 href="robot.html#ReTraining" >treinar novamente os rob&ocirc;s</a>. E mais alguns <A href="bugs.html#Beta13">problemas foram corrigidos e pequenos aperfei&ccedil;oamentos acrescentados</a>. O Beta 13A corrige <A href="bugs.html#Beta13A">mais alguns problemas</a>.

<p>O Beta 12 adiciona novas 
            caracter&iacute;sticas para usu&aacute;rios muito avan&ccedil;ados. Os rob&ocirc;s agora podem ser <A href="robot.html#MetaProgramming">treinados para manipular equipes de outros rob&ocirc;s.</a> Os bal&otilde;es de pensamento podem ser editados e as equipes, reorganizadas. Voc&ecirc; agora pode arranjar para que qualquer comportamento ocorra quando<A href="picture.html#BirdOnTheBack"> duas imagens colidem</a>. Muitos 
            problemas foram corrigidos e caracter&iacute;sticas secund&aacute;rias foram adicionadas. <A href="bugs.html#Beta12">Clique aqui</a>
para detalhes.

<p>O Beta 11 tem duas novas 
            caracter&iacute;sticas. O ToonTalk  agora suporta joysticks com tecnologia &quot;force feedback&quot;. Voc&ecirc; pode sentir os efeitos da for&ccedil;a quando usa o ToonTalk, mas voc&ecirc; tamb&eacute;m encontrar&aacute; <A href="force.html">uma agenda sobre os controles 
            remotos para utilizar os efeitos de for&ccedil;a</A> em seus 
            pr&oacute;prios programas. H&aacute; agora um meio de carregar <A href="extend.html">extens&otilde;es no ToonTalk</a>. A &uacute;nica 
            extens&atilde;o atualmente definida permite que voc&ecirc; leia e escreva arquivos e portas de comunica&ccedil;&atilde;o no interior do ToonTalk. Como <A href="bugs.html#Beta11">v&aacute;rios problemas</a> foram 
            corrigidos tamb&eacute;m. O Beta 11A apenas corrige <A href="bugs.html#Beta11A">diversos problemas</a>.

<p>O Beta 10 atualizou e aperfei&ccedil;oou os exemplos. E  <A
 href="bugs.html#Beta10" >muitos problemas foram corrigidos.</a>O Beta 10A <A href="bugs.html#Beta10A">corrige ainda mais problemas.</a> (Agradecimentos especiais para Shelly C. Wallace, por relatar muitos deles.)

<p>O Beta 9 permite que voc&ecirc; decore as 
            casas (o telhado e a parede da frente), quartos (a parede) e as 
            cidades. Toda a decora&ccedil;&atilde;o pode ter rob&ocirc;s por tr&aacute;s e assim pode ser dado qualquer comportamento que voc&ecirc; deseje. Voc&ecirc; pode agora salvar as cidades. Um aparato autom&aacute;tico de localiza&ccedil;&atilde;o de defeitos foi adicionado. Voc&ecirc; agora pode se mover pelo ch&atilde;o. Voc&ecirc; agora pode ver o que h&aacute; no ch&atilde;o enquanto permanece em um quarto.
Novas op&ccedil;&otilde;es de di&aacute;logo foram adicionadas para tornar mais f&aacute;cil a configura&ccedil;&atilde;o do ToonTalk. E, claro, v&aacute;rios <A href="bugs.html#Beta9">problemas</a>foram corrigidos. Beta 9A corrigiu <A href="bugs.html#Beta9A">mais alguns problemas</a>. E o Beta 9B corrigiu <A
 href="bugs.html#Beta9B" >mais problemas</a>.

<p>O Beta 8 possui suporte para combinar 
            &quot;comportamentos&quot;. A id&eacute;ia &eacute; que voc&ecirc; 
            pode definir comportamentos (como persegui&ccedil;&atilde;o, saltos e explos&otilde;es) como antes atrav&eacute;s da coloca&ccedil;&atilde;o de rob&ocirc;s por tr&aacute;s de uma imagem. Agora voc&ecirc; pode combinar comportamentos colocando diversas imagens m&oacute;veis atr&aacute;s de outra imagem. Verifique estes <A
 href="programs.html#Behaviors" >exemplos de 
            combina&ccedil;&atilde;o de comportamentos.</a> O Beta 8 
            tamb&eacute;m tem muitas imagens &quot;sint&eacute;ticas&quot; na agenda de <i>Imagens</i> agora. Em 
            acr&eacute;scimo ao ret&acirc;ngulo que havia estado no ToonTalk por anos, h&aacute; agora ovais, ret&acirc;ngulos arredondados, linhas e muito mais.

<p><A href="bugs.html#Beta8A">O Beta 8A corrige principalmente problemas</a> no Beta 8.

<p>O Beta 8B acrescenta 9 novos desafios, um miniaplicativo de Java muito mais robusto, e <A href="bugs.html#Beta8B">corrige alguns problemas. </a>Ela tamb&eacute;m 
            utiliza um programa novo e muito mais flex&iacute;vel de instala&ccedil;&atilde;o, cuja maior parte das vantagens s&oacute; est&atilde;o dispon&iacute;veis na vers&atilde;o em CD-Rom. A remo&ccedil;&atilde;o do ToonTalk de seu computador agora &eacute; suportada.

<p>O Beta 8C agora suporta joysticks &ndash; mas apenas a vers&atilde;o de 32 bits do ToonTalk. Voc&ecirc; pode utilizar <A href="joystick.html">um joystick para controlar o programador</a> como 
            tamb&eacute;m utilizar os <A href="joysense.html">sensores do joystick</a> para 
            construir jogos que utilizem o joystick. A forma de utiliza&ccedil;&atilde;o dos bot&otilde;es do mouse foi alterada. O bot&atilde;o direito do mouse, agora por padr&atilde;o, liga e desliga coisas (como a barra de espa&ccedil;o), vira as p&aacute;ginas na agenda e muda os grupos de imagens, n&uacute;meros e textos. A forma como os <A href="sound.html">efeitos sonoros </a>s&atilde;o feitos e utilizados tamb&eacute;m foi alterada. E <A href="bugs.html#Beta8C">alguns problemas </a>foram corrigidos.

<p>Iniciando-se com a vers&atilde;o 6B h&aacute; agora um <A href="langs.html">suporte multiling&ucirc;&iacute;stico</a>e a capacidade de gerar <A href="java.html">miniaplicativos em Java</a>.

<p>O ToonTalk tem agora um jogo de desafio come&ccedil;ando com a vers&atilde;o 4C. Voc&ecirc; pode ainda <A href="make_pzl.html">fazer seus pr&oacute;prios desafios</a>! 

<p>
<hr size=1>
<p><a name="Beta11"></a>O 
            ToonTalk est&aacute; em uma vers&atilde;o de teste beta e est&aacute; se alterando todo o tempo. <A href="bugs.html"> Problemas </a>s&atilde;o corrigidos. <A href="programs.html">Aperfei&ccedil;oamentos</a> 
            s&atilde;o feitos a todo momento no ToonTalk. Existem muitas <A href="ideas.html">id&eacute;ias</a> obre como aperfei&ccedil;oar o ToonTalk. 

<p>Seria formid&aacute;vel se voc&ecirc; pudesse ajudar atrav&eacute;s <A
 href="mailto:KenKahn@ToonTalk.com" >do relato de problemas,</a><A href="contrib.html"> contribui&ccedil;&atilde;o com aperfei&ccedil;oamentos</a>e <A href="ideas.html">trazendo id&eacute;ias.</a> 

<p>Se voc&ecirc; j&aacute; tem o ToonTalk e deseja a &uacute;ltima vers&atilde;o, ent&atilde;o  <a href="http://www.ToonTalk.com/English/patches.html">clique aqui</a>. 

<p>Se voc&ecirc; deseja saber como obter a 
            narra&ccedil;&atilde;o para o &quot;Tour Introdut&oacute;rio&quot; e o exemplo &quot;Pingue- Pongue&quot;, ent&atilde;o <A href="narrate.html">clique aqui</a>.

<p>
<hr size=1><div align=center>
<A class=menu href="toontalk.html" onmouseover="window.status=' Início'; return true">in&iacute;cio</a><span class=bola> &#0149;</span>
<A class=menu href="search.html" onmouseover="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<A class=menu href="buy.html" onmouseover="window.status=' Compra'; return true">compra</a><span class=bola> &#0149;</span>
<A class=menu href="doc.html" onmouseover="window.status=' Manual'; return true">manual</a><span class=bola> &#0149;</span>
<A class=menu href="whatsnew.html" onmouseover="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<A class=menu href="faq.html" onmouseover="window.status=' Dúvidas'; return true">d&uacute;vidas</a><span class=bola> &#0149;</span>
<A class=menu href="support.html" onmouseover="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<A class=menu href="free.html" onmouseover="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<A class=menu href="press.html" onmouseover="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<A class=menu href="address.html" onmouseover="window.status=' Contato'; return true">contato</a></div></td>

</tr></table>
</div>
</body></html>

<!--  FuturArte Editora Ltda.                                     Divertire  -->