<html>
<head>
<title>ToonTalk - Caixas</title>
<link rel="stylesheet" type="text/css" href="ToonTalk.css">
</head>

<body link="#0000ff" vlink="#800080" bgcolor="#ffffff">

<div align="center">
<a name="topo"></a>
<table width=468 cellspacing=0 cellpadding=0 border=0><tr><td>

<p>
<table cellspacing=0 cellpadding=0 border=0><tr><td>
<div align=center>
<A class=menu href="toontalk.html" onmouseover="window.status=' Início'; return true">in&iacute;cio</a><span class=bola> &#0149;</span>
<A class=menu href="search.html" onmouseover="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<A class=menu href="buy.html" onmouseover="window.status=' Compra'; return true">compra</a><span class=bola> &#0149;</span>
<A class=menu href="doc.html" onmouseover="window.status=' Manual'; return true">manual</a><span class=bola> &#0149;</span>
<A class=menu href="whatsnew.html" onmouseover="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<A class=menu href="faq.html" onmouseover="window.status=' Dúvidas'; return true">d&uacute;vidas</a><span class=bola> &#0149;</span>
<A class=menu href="support.html" onmouseover="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<A class=menu href="free.html" onmouseover="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<A class=menu href="press.html" onmouseover="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<A class=menu href="address.html" onmouseover="window.status=' Contato'; return true">contato</a>
<hr size=1></div>
    </td></tr>
</table>

<h2>Caixas</h2>

<p>
<IMG alt="A picture of a box" height =93 src="../box.gif" width=264 >

<p>As caixas s&atilde;o perfeitas para armazenar coisas. Voc&ecirc; pode colocar qualquer coisa nas caixas, exceto <A href="tooly.html">Porta-Treco</a>, <A href="dusty.html">Asper</a>, <A href="pumpy.html">Soprana</a>e as <A href="wand.html">varinhas m&aacute;gicas</a>.

<p>Voc&ecirc; pode juntar duas caixas colocando 
            uma caixa na borda da outra. <U>Elas</U> precisam se sobrepor um 
            pouco. Enquanto voc&ecirc; est&aacute; segurando uma caixa, voc&ecirc; pode digitar um n&uacute;mero de 0 a 9 e a caixa se transformar&aacute; para ter o n&uacute;mero de aberturas que voc&ecirc; digitou. Se o novo tamanho &eacute; menor, ent&atilde;o a parte extra da caixa &agrave; direita ser&aacute; jogada fora. Voc&ecirc; pode dividir uma caixa atrav&eacute;s da coloca&ccedil;&atilde;o de um <A href="number.html">n&uacute;mero</a>. Por exemplo, se uma caixa com 5 aberturas &eacute; colocada em um 3, ela se dividir&aacute; em uma caixa com 3 aberturas e outra com 2.

<p>Voc&ecirc; pode acrescentar etiquetas a uma caixa, apontando para a parte da caixa sob uma abertura e digitando. Este &eacute; um bom modo de lembrar-se do que h&aacute; na caixa.(Os rob&ocirc;s ignoram as etiquetas quando decidem se trabalham em uma caixa.)

<p><b>Dica.</b> Voc&ecirc; pode treinar um <A href="robot.html">rob&ocirc;</a> para encontrar ou alterar qualquer elemento de uma caixa, apenas indo at&eacute; a abertura e retirando coisas ou colocando-as de volta.

<p><b>Dica 
            Avan&ccedil;ada.</b> Se voc&ecirc; n&atilde;o sabe em que abertura 
            deseja que o rob&ocirc; trabalhe enquanto o est&aacute; treinando, 
            mas voc&ecirc; tem o n&uacute;mero da abertura quando o rob&ocirc; 
            est&aacute; trabalhando, aqui vai o que voc&ecirc; pode fazer.
Quando estiver treinando um rob&ocirc;, d&ecirc;-lhe uma caixa com o n&uacute;mero e a caixa em que voc&ecirc; deseja que ele trabalhe (e ele n&atilde;o precisar&aacute; de nada mais). Treine o rob&ocirc; para tirar o n&uacute;mero e coloc&aacute;-lo e ent&atilde;o para tirar a caixa e coloc&aacute;-la no n&uacute;mero. Agora a abertura em que o rob&ocirc; deve trabalhar &eacute; a primeira abertura da parte da caixa que est&aacute; &agrave; direita. Fa&ccedil;a o rob&ocirc; realizar o que voc&ecirc; deseja com aquela abertura, e ent&atilde;o coloque as duas partes da caixa juntas novamente e a devolva para onde voc&ecirc; a encontrou. Os cientistas da computa&ccedil;&atilde;o chamam isso de &quot;indexa&ccedil;&atilde;o de banco de dados&quot;.

<p><b>Caixas sem aberturas.</b> Se digitar 0 enquanto estiver segurando uma caixa, 
            voc&ecirc; descobrir&aacute; que est&aacute; segurando uma caixa sem abertura. N&atilde;o h&aacute; muito coisa que voc&ecirc; possa fazer com isso. Voc&ecirc; pode junt&aacute;-la a outras caixas e elas ir&atilde;o embora. Os cientistas de computa&ccedil;&atilde;o gostam de coisas como estas. 

<p><b>Caixas vazias. </b><A href="dusty.html">Asper</a> pode ajud&aacute;-lo a fazer uma caixa em branco. Estas s&atilde;o &uacute;teis no <A href="bubble.html">bal&atilde;o de pensamento</a> dos rob&ocirc;s, quando voc&ecirc; quer que o rob&ocirc; se assegure que tem uma caixa, mas voc&ecirc; n&atilde;o se importa com o n&uacute;mero de aberturas que tem a caixa.

<p><a name="ExplodingTeams"></a><b>Dica Avan&ccedil;ada.</b> 
            Voc&ecirc; tamb&eacute;m pode usar caixas vazias para 
            &quot;explodir&quot; um grupo de texto. Se voc&ecirc; coloca um 
            grupo de texto como &quot;cat&quot; em uma caixa vazia, a caixa se transformar&aacute; em uma com tr&ecirc;s aberturas. A primeira abertura conter&aacute;, precisamente, a letra &quot;c&quot;, a segunda a letra &quot;a&quot;, e a terceira a letra &quot;t&quot;. Voc&ecirc; tamb&eacute;m pode explodir uma equipe de rob&ocirc;s desse modo. A equipe ser&aacute; dividida e cada rob&ocirc; terminar&aacute; em uma abertura da caixa.

<p>
<hr size=1><div align=center>
<A class=menu href="toontalk.html" onmouseover="window.status=' Início'; return true">in&iacute;cio</a><span class=bola> &#0149;</span>
<A class=menu href="search.html" onmouseover="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<A class=menu href="buy.html" onmouseover="window.status=' Compra'; return true">compra</a><span class=bola> &#0149;</span>
<A class=menu href="doc.html" onmouseover="window.status=' Manual'; return true">manual</a><span class=bola> &#0149;</span>
<A class=menu href="whatsnew.html" onmouseover="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<A class=menu href="faq.html" onmouseover="window.status=' Dúvidas'; return true">d&uacute;vidas</a><span class=bola> &#0149;</span>
<A class=menu href="support.html" onmouseover="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<A class=menu href="free.html" onmouseover="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<A class=menu href="press.html" onmouseover="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<A class=menu href="address.html" onmouseover="window.status=' Contato'; return true">contato</a></div></td>

</tr></table>
</div>
</body></html>

<!--  FuturArte Editora Ltda.                                     Divertire  -->