<html>
<head>
<title>ToonTalk - Uma mensagem (satírica) de Eric Scharff</title>
<link rel="stylesheet" type="text/css" href="ToonTalk.css">
</head>

<body link="#0000ff" vlink="#800080" bgcolor="#ffffff">

<div align="center">
<a name="topo"></a>
<table width=468 cellspacing=0 cellpadding=0 border=0><tr><td>

<p>
<table cellspacing=0 cellpadding=0 border=0><tr><td>
<div align=center>
<A class=menu href="toontalk.html" onmouseover="window.status=' Início'; return true">in&iacute;cio</a><span class=bola> &#0149;</span>
<A class=menu href="search.html" onmouseover="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<A class=menu href="buy.html" onmouseover="window.status=' Compra'; return true">compra</a><span class=bola> 
                        &#0149;</span>
<A class=menu href="doc.html" onmouseover="window.status=' Manual'; return true">manual</a><span class=bola> 
                        &#0149;</span>
<A class=menu href="whatsnew.html" onmouseover="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<A class=menu href="faq.html" onmouseover="window.status=' Dúvidas'; return true">d&uacute;vidas</a><span class=bola> &#0149;</span>
<A class=menu href="support.html" onmouseover="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<A class=menu href="free.html" onmouseover="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<A class=menu href="press.html" onmouseover="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<A class=menu href="address.html" onmouseover="window.status=' Contato'; return true">contato</a>
<hr size=1></div>
    </td></tr>
</table>

<h2>Uma mensagem (sat&iacute;rica) de Eric Scharff</h2>

<p>A seguir vai uma mensagem (sat&iacute;rica) de Eric Scharff, um estudante do curso de Wayne Citrin sobre Programa&ccedil;&atilde;o Visual na
Universidade do Colorado, enviada &agrave; classe sobre como poexemplos melhorar o ambiente do ToonTalk:

<p><b>Tema:</b> Aumentando o ToonTalk

<p>O ToonTalk fornece um mundo 
            &quot;arcade&quot; para os fundamentos da computa&ccedil;&atilde;o, mas talvez ele pudesse se beneficiar com alguns pequenos acr&eacute;scimos que fa&ccedil;am a programa&ccedil;&atilde;o mais simples. Aqui vai uma tentativa de fazer tal extens&atilde;o.

<p>O ToonTalk nos apresentou personagens 
            memor&aacute;veis tais como M&aacute;rcio, o marciano, Porta-Treco, a caixa de ferramentas, Asper, o aspirador de p&oacute;, e Soprana, a bomba de bicicleta. Embora estas ferramentas proporcionem um mundo de programa&ccedil;&atilde;o completo e divertido, alguns acr&eacute;scimos &agrave; fam&iacute;lia do ToonTalk podem facilitar a tarefa de produzir jogos nesse mundo p&oacute;s-Pong.

<p>Nosso primeiro novo personagem &eacute; 
            Dumpy, o caminh&atilde;o de lixo. Dumpy faz a coleta de lixo na cidade de ToonTalk. A tarefa de Dumpy &eacute; remover a sujeira deixada pelos trabalhadores descuidados da constru&ccedil;&atilde;o e rob&ocirc;s que n&atilde;o utilizam bombas. Quando os rob&ocirc;s em uma casa param de desempenhar uma tarefa, Dumpy chega em sua propriedade. Logo, uma bola de destrui&ccedil;&atilde;o chega &agrave; cena, exemplolindo o refugo criado pelo morador ocioso. Dumpy limpa as ru&iacute;nas e devolve os rob&ocirc;s para voc&ecirc;, pois o Prefeito de ToonTalk n&atilde;o permite rob&ocirc;s sem-teto.

<p>Algumas linguagens visuais permitem que 
            voc&ecirc; veja seus programas em m&uacute;ltiplos n&iacute;veis de 
            abstra&ccedil;&atilde;o. De forma a conseguir mais vis&otilde;es da a&ccedil;&atilde;o, n&oacute;s poexemplos chamar os servi&ccedil;os de Blurry, o telesc&oacute;pio. Se voc&ecirc; subir ao telhado com Blurry, poderemos espiar as computa&ccedil;&otilde;es nas outras casas. Voc&ecirc; ainda pode aproximar ou afastar o &quot;zoom&quot; para ver o progresso de nossa vizinhan&ccedil;a de computa&ccedil;&otilde;es sist&oacute;licas. Entretanto, Blurry t&ecirc;m bons modos e n&atilde;o permitir&aacute; que voc&ecirc; olhe dentro das casas de rob&ocirc;s que pediram por privacidade.

<p>Slowly, a lesma, permite que os jogadores do 
            ToonTalk fa&ccedil;am edi&ccedil;&otilde;es e localizem 
            &quot;bugs&quot;. Ao contr&aacute;rio de muitos americanos, Slowly sabe como programar e utilizar um videocassete. Pode-se dar rob&ocirc;s e dados para Slowly, que finalmente voltar&aacute; com uma televis&atilde;o e um controle remoto. O usu&aacute;rio pode ent&atilde;o utilizar o controle remoto para assistir, voltar, avan&ccedil;ar ou parar um grupo de rob&ocirc;s. Voc&ecirc; pode tamb&eacute;m inserir novos passos ou deletar incorretos atrav&eacute;s da atualiza&ccedil;&atilde;o do local correto da grava&ccedil;&atilde;o. Um pombo especial trar&aacute; o controle remoto de volta para voc&ecirc; se voc&ecirc; se perder dentro da poltrona do ToonTalk.

<p>Slowly fornece algo da funcionalidade do 
            controle de excu&ccedil;&atilde;o, mas ele tamb&eacute;m pode fazer 
            inspe&ccedil;&atilde;o e detetar pontos de travamento. Portanto, 
            terminaremos o grupo de personagens com Nosy, o nariz. Nosy, o chefe de todos os rob&ocirc;s e equipes de constru&ccedil;&atilde;o, &eacute; o programa simb&oacute;lico que encontra os &quot;bugs&quot;. Se voc&ecirc; enviar Nosy com suas equipes, ele pode farejar estados de vari&aacute;veis espec&iacute;ficas, a&ccedil;&otilde;es de rob&ocirc;s ou outras condi&ccedil;&otilde;es. Se essas condi&ccedil;&otilde;es s&atilde;o satisfeitas, Nosy ir&aacute; espirrar, assustando os rob&ocirc;s e parando a execu&ccedil;&atilde;o. Voc&ecirc; pode ent&atilde;o voar sobre a &aacute;rea e ver ao que Nosy era al&eacute;rgico. Nosy tamb&eacute;m pode servir como um capataz , dizendo a voc&ecirc; quanto tempo os rob&ocirc;s levam para executar suas tarefas e reclamando com eles para que trabalhem mais.

<p>Infelizmente, muitas criaturas quiseram 
            entrar no mundo do ToonTalk, mas foram consideradas inadequadas por v&aacute;rias raz&otilde;es. Personagens como Pushy, a interface da pilha, Dicey, o gerador de n&uacute;meros rand&ocirc;micos, e Formally, a coruja (o dispositivo de verifica&ccedil;&atilde;o da captura de ovos), podem ser acr&eacute;scimos &uacute;teis para vers&otilde;es posteriores do ToonTalk, mas no momento devemos caminhar antes de correr. Depois de implementarmos algum jogo atual (como, digamos, o Pole Position), n&oacute;s poexemplos pensar em nossos futuros objetivos para introduzir novas vidas na Metr&oacute;polis do ToonTalk. Quem sabe? Logo precisaremos de policiais?

<p>---

<p>Rindo marotamente,

<p>-Eric


<p>
<hr size=1><div align=center>
<A class=menu href="toontalk.html" onmouseover="window.status=' Início'; return true">in&iacute;cio</a><span class=bola> &#0149;</span>
<A class=menu href="search.html" onmouseover="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<A class=menu href="buy.html" onmouseover="window.status=' Compra'; return true">compra</a><span class=bola> &#0149;</span>
<A class=menu href="doc.html" onmouseover="window.status=' Manual'; return true">manual</a><span class=bola> &#0149;</span>
<A class=menu href="whatsnew.html" onmouseover="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<A class=menu href="faq.html" onmouseover="window.status=' Dúvidas'; return true">d&uacute;vidas</a><span class=bola> &#0149;</span>
<A class=menu href="support.html" onmouseover="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<A class=menu href="free.html" onmouseover="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<A class=menu href="press.html" onmouseover="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<A class=menu href="address.html" onmouseover="window.status=' Contato'; return true">contato</a></div></td>

</tr></table>
</div>
</body></html>

<!--  FuturArte Editora Ltda.                                     Divertire  -->