<html>
<head>
<title>ToonTalk - Comandos de teclado do ToonTalk</title>
<link rel="stylesheet" type="text/css" href="ToonTalk.css">
</head>

<body link="#0000ff" vlink="#800080" bgcolor="#ffffff">

<div align="center">
<a name="topo"></a>
<table width=468 cellspacing=0 cellpadding=0 border=0><tr><td>

<p>
<table cellspacing=0 cellpadding=0 border=0><tr><td>
<div align=center>
<A class=menu href="toontalk.html" onmouseover="window.status=' Início'; return true">in&iacute;cio</a><span class=bola> &#0149;</span>
<A class=menu href="search.html" onmouseover="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<A class=menu href="buy.html" onmouseover="window.status=' Compra'; return true">compra</a><span class=bola> &#0149;</span>
<A class=menu href="doc.html" onmouseover="window.status=' Manual'; return true">manual</a><span class=bola> &#0149;</span>
<A class=menu href="whatsnew.html" onmouseover="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<A class=menu href="faq.html" onmouseover="window.status=' Dúvidas'; return true">d&uacute;vidas</a><span class=bola> &#0149;</span>
<A class=menu href="support.html" onmouseover="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<A class=menu href="free.html" onmouseover="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<A class=menu href="press.html" onmouseover="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<A class=menu href="address.html" onmouseover="window.status=' Contato'; return true">contato</a>
<hr size=1></div>
    </td></tr>
</table>

<h2>Comandos do Teclado de ToonTalk</h2>


<p><b><i>Apenas para usu&aacute;rios avan&ccedil;ados:</i></b> 

<p>Voc&ecirc; n&atilde;o precisa aprender os comandos de teclado que se seguem. Voc&ecirc; pode fazer quase tudo apenas com o seu mouse. Muitos desses comandos de teclado apenas lhe fornecem meios mais r&aacute;pidos de fazer as coisas. 

<p>Se voc&ecirc; tem um  <A href="joystick.html" onmouseover="window.status=' '; return true">joystick</a> que tem mais de dois 
            bot&otilde;es e est&aacute; conectado ao seu computador, voc&ecirc; pode utilizar esses bot&otilde;es extras em vez dos comandos de teclado abaixo.

<p><b>Durante os t&iacute;tulos da abertura:</b> 

<p>Aperte qualquer bot&atilde;o para ir para a pr&oacute;xima tela. &quot; Esc&quot; ir&aacute; saltar as telas remanescentes. 

<p><b>Durante um exemplo:</b> 

<p>Se voc&ecirc; apertar qualquer bot&atilde;o, o ToonTalk far&aacute; uma pausa e exibir&aacute; as op&ccedil;&otilde;es de sair, assumir o controle ou voltar o exemplo. 

<p><b>Voando, caminhando ou no ch&atilde;o.</b> 

<p>Aperte as setas direcionais para se mover em qualquer das 8 dire&ccedil;&otilde;es (em alguns teclados, apenas 4 teclas direcionais est&atilde;o nomeadas. As teclas chamadas <i>Home</i>, <i>Page Up</i>, <i>Page
Down</i> e <i>End</i> devem funcionar para mover-se em diagonal. Voc&ecirc; pode mant&ecirc;-las pressionadas para continuar se movendo naquela dire&ccedil;&atilde;o. Voc&ecirc; pode ainda pressionar duas teclas ao mesmo tempo para combinar duas dire&ccedil;&otilde;es). 

<p>Aperte a tecla &quot;pause&quot; para parar o ToonTalk e exibir a op&ccedil;&atilde;o de sair, voltar mais tarde ou voltar ao ToonTalk. 

<p>Aperte F7 para acelerar o que quer que esteja acontecendo. 

<p>Aperte F8 para desligar a for&ccedil;a de todos os <A
 href="robot.html" onmouseover  ="window.status=' '; return true" >rob&ocirc;s</a>e <A href="picture.html" onmouseover="window.status=' '; return true">imagens em movimento </a>na cidade toda. Aperte F8 de novo para lig&aacute;-los. 

<p>Aperte F11 para ter um instant&acirc;neo da tela. Voc&ecirc; encontrar&aacute; a imagem no diret&oacute;rio do ToonTalk  nomeado frm1234.bmp, onde 1234 &eacute; o n&uacute;mero do quadro de que voc&ecirc; tirou o instant&acirc;neo. 

<p>Aperte F12 para tirar um instant&acirc;neo da tela e salv&aacute;-lo no clipboard do Windows. 

<p>Pagedown para fazer <A href="marty.html" onmouseover="window.status=' '; return true">M&aacute;rcio</a> dizer a pr&oacute;xima coisa. 

<p>Pageup para fazer M&aacute;rcio repetir a &uacute;ltima coisa. 

<p><a name="Helicopter"><b>Voando e aterrissando:</b></a> 

<p>Aperte s ou S para voar mais alto (Subir).Segurar o bot&atilde;o direito do mouse tamb&eacute;m deve funcionar. 

<p>Aperte x ou X para voar mais baixo (baixar). Segurar o bot&atilde;o esquerdo do mouse tamb&eacute;m deve funcionar.

<p><b>Caminhando fora:</b> 

<p>Aperte F1, h, ou H para levar o helic&oacute;ptero para onde voc&ecirc; est&aacute;. 

<p><a name="InRoom"><b>Caminhando numa sala:</b></a> 

<p>Aperte qualquer bot&atilde;o para se sentar. 

<p><a name="OnFloor"><b>No ch&atilde;o ou numa mente de rob&ocirc;:</b></a>


<p>Aperte <i>Escape</i> (normalmente marcado <i>Esc</i>) para sair. 

<p>Aperte F1 para chamar <A href="marty.html" onmouseover="window.status=' '; return true">M&aacute;rcio</a> ou, se ele j&aacute; estiver por perto, para mand&aacute;-lo embora.

<p><i>E se sua m&atilde;o est&aacute; vazia.</i> 

<p>Aperte e ou E para erguer-se.

<p>Aperte p ou P para pegar um item que est&aacute; sob seu dedo.

<p>Aperte g ou G para pegar e girar. 

<p>Aperte F9 para ocultar sua m&atilde;o se ela est&aacute; vis&iacute;vel, ou exibi-la se estiver invis&iacute;vel. Veja  <A href="sensor.html#HandVisible" onmouseover="window.status=' '; return true">tamb&eacute;m o controlador para a visibilidade de sua m&atilde;o.</a>

<p><i>E se voc&ecirc; 
            n&atilde;o estiver segurando nada al&eacute;m de um grupo de texto.</i>

<p>Nota: A raz&atilde;o pela qual os seguintes comandos n&atilde;o funcionam em grupos de texto &eacute; que voc&ecirc; precisa ser capaz de digitar qualquer texto. Voc&ecirc; precisa utilizar os bot&otilde;es do mouse para girar ou colocar os grupos de texto.

<p>Aperte g ou G para gir&aacute;-lo. (se poss&iacute;vel). 

<p>Aperte l ou L para larg&aacute;-lo.

<p><i>E se voc&ecirc; estiver segurando uma ferramenta:</i>

<p>Aperte a barra de espa&ccedil;o para ativar e desativar a ferramenta (<A
 href="wand.html" onmouseover  ="window.status=' '; return true" >a varinha m&aacute;gica </a>se 
            &quot;desativa automaticamente&quot; ap&oacute;s cada utiliza&ccedil;&atilde;o).

<p><i><a name="Dusty" OnMouseOver="window.status=' '; return true">E 
            se voc&ecirc; estiver segurando </a><A
 href="dusty.html" onmouseover  ="window.status=' '; return true" >Asper</a>:</i> 

<p>Aperte a ou A para alterar Asper, de forma que o ligar&aacute; e ele aspirar&aacute; as coisas (Aspirar &eacute; o &quot;default&quot;). 

<p>Aperte i ou I para alter&aacute;-lo, de forma que o ligar&aacute; e ele apagar&aacute; coisas (Limpar).

<p>Aperte d ou D para alter&aacute;-lo, de forma que o ligar&aacute; e ele devolver&aacute; coisas (Devolver).

<p><a name="OLE_LINK2">Aperte F2 para chamar Asper. Ele come&ccedil;ar&aacute; a funcionar na sua m&atilde;o. Apertar F2 novamente ir&aacute; aceler&aacute;-lo.

<p><i><a name="Pumpy">E se voc&ecirc; est&aacute; segurando</a><A
 href="pumpy.html" onmouseover  ="window.status=' '; return true" >Soprana</a></i>:

<p>Aperte m ou M para alterar Soprana, de forma que a ligar&aacute; e ela tornar&aacute; as coisas maiores (Default).

<p>Aperte v ou V para alter&aacute;-la, de forma que a ligar&aacute; e ela tornar&aacute; as coisas mais altas. 

<p>Aperte r ou R para alter&aacute;-la, de forma que a ligar&aacute; e ela tornar&aacute; as coisas mais largas. 

<p>Aperte n ou N para alter&aacute;-la, de forma que a ligar&aacute; e ela tornar&aacute; as coisas menores. 

<p>Aperte t ou T para alter&aacute;-la, de forma que a ligar&aacute; e ela tornar&aacute; as coisas mais estreitas. 

<p>Aperte u ou U para alter&aacute;-la, de forma que a ligar&aacute; e ela tornar&aacute; as coisas mais curtas. 

<p>Aperte b ou B para alter&aacute;-la, para que ela deixe as coisas em um &quot;bom&quot; tamanho. 

<p>Aperte F3 para cham&aacute;-la e ela saltar&aacute; na sua m&atilde;o. Apertar F3 novamente ir&aacute; aceler&aacute;-la. 

<p><i><a name="MagicWand">E se voc&ecirc; estiver segurando a </a><A
 href="wand.html" onmouseover  ="window.status=' '; return true" >Varinha M&aacute;gica</a>:</i> 

<p>Aperte o ou O para fazer uma c&oacute;pia do original do item sob a extremidade da varinha. 

<p>Aperte c ou C para fazer uma c&oacute;pia de cada item. 

<p>Aperte z ou Z para fazer uma c&oacute;pia da pr&oacute;pria varinha. 

<p>Aperte F5 para fazer a varinha voar para a sua m&atilde;o. Apertar F5 novamente ir&aacute; aceler&aacute;-la.

<p><i>E se voc&ecirc; estiver segurando uma bomba.</i> 

<p>Aperte qualquer tecla para explodir a bomba.

<p><i><a name="Notebook">E se voc&ecirc; estiver segurando ou apontando para uma  </a><A href="notebook.html" onmouseover="window.status=' '; return true">agenda:</a></i> 

<p>Aperte - ou &quot;a barra de espa&ccedil;o&quot; para voltar para a p&aacute;gina anterior (&uacute;ltima p&aacute;gina, se estiver na primeira.) 

<p>Aperte + ou a barra de espa&ccedil;o para ir para a pr&oacute;xima p&aacute;gina. 

<p>Entre com d&iacute;gitos (0 a 9) para inserir um n&uacute;mero de p&aacute;gina. 

<p>Aperte F4 para fazer que a &uacute;ltima agenda que voc&ecirc; usou voe para voc&ecirc;. Apertar F4 novamente ir&aacute; aceler&aacute;-la.

<p><i>E se voc&ecirc; estiver segurando um <A href="number.html" onmouseover="window.status=' '; return true">n&uacute;mero</a> ou apontando para um n&uacute;mero:</i> 

<p>Entre com d&iacute;gitos (0 a 9) para inserir um n&uacute;mero. 

<p>Aperte <i>Backspace</i> 
            para remover o &uacute;ltimo d&iacute;gito.

<p>Aperte +, -, /,*, x,%,^. &amp;, ou = para inserir uma opera&ccedil;&atilde;o num&eacute;rica.

<p>Aperte g ou G para girar um n&uacute;mero (funciona apenas se voc&ecirc; estiver segurando um n&uacute;mero). 

<p><i>E se voc&ecirc; estiver segurando ou apontando para um  <A
 href="text.html" onmouseover  ="window.status=' '; return true" >grupo de texto</a>:</i> 

<p>Apenas digite para adicionar ao texto. 

<p>Aperte a barra de espa&ccedil;o para remover a &uacute;ltima letra. 

<p><i><a name="Picture">E se voc&ecirc; estiver segurando ou apontando para uma 
</a><A href="picture.html" onmouseover="window.status=' '; return true">imagem ou clipe de anima&ccedil;&atilde;o.</a>:</i> 

<p>Digite + ou Backspace para mudar para o pr&oacute;ximo ciclo ou cor ou elemento. 

<p>Digite - ou  <i>Backspace</i> para voltar.

<p>Segure o bot&atilde;o <i>control</i>, mova o mouse e ent&atilde;o clique com o bot&atilde;o esquerdo do mouse para rodar uma imagem. Ela come&ccedil;ar&aacute; com a mesma velocidade que sua m&atilde;o tinha quando soltou a imagem. 

<p><i>E se voc&ecirc; estiver segurando ou apontando para um <A
 href="sound.html" onmouseover  ="window.status=' '; return true" >som</a>:</i>

<p>Qualquer tecla do teclado emitir&aacute; o som.

<p>
<hr size=1><div align=center>
<A class=menu href="toontalk.html" onmouseover="window.status=' Início'; return true">in&iacute;cio</a><span class=bola> &#0149;</span>
<A class=menu href="search.html" onmouseover="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<A class=menu href="buy.html" onmouseover="window.status=' Compra'; return true">compra</a><span class=bola> &#0149;</span>
<A class=menu href="doc.html" onmouseover="window.status=' Manual'; return true">manual</a><span class=bola> &#0149;</span>
<A class=menu href="whatsnew.html" onmouseover="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<A class=menu href="faq.html" onmouseover="window.status=' Dúvidas'; return true">d&uacute;vidas</a><span class=bola> &#0149;</span>
<A class=menu href="support.html" onmouseover="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<A class=menu href="free.html" onmouseover="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<A class=menu href="press.html" onmouseover="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<A class=menu href="address.html" onmouseover="window.status=' Contato'; return true">contato</a></div></td>

</tr></table>
</div>
</body></html>

<!--  FuturArte Editora Ltda.                                     Divertire  -->