<html>
<head>
<title>ToonTalk - O Logo é uma tecnologia obsoleta? - Parte 4</title>
<link rel="stylesheet" type="text/css" href="ToonTalk.css">
</head>

<body link="#0000ff" vlink="#800080" bgcolor="#ffffff">

<div align="center">
<a name="topo"></a>
<table width=468 cellspacing=0 cellpadding=0 border=0><tr><td>

<p>
<table  cellspacing=0 cellpadding=0 border=0><tr><td>
<div align=center>
<A class=menu href="toontalk.html" onmouseover="window.status=' Início'; return true">in&iacute;cio</a><span class=bola> &#0149;</span>
<A class=menu href="search.html" onmouseover="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<A class=menu href="buy.html" onmouseover="window.status=' Compra'; return true">compra</a><span class=bola> &#0149;</span>
<A class=menu href="doc.html" onmouseover="window.status=' Manual'; return true">manual</a><span class=bola> &#0149;</span>
<A class=menu href="whatsnew.html" onmouseover="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<A class=menu href="faq.html" onmouseover="window.status=' Dúvidas'; return true">d&uacute;vidas</a><span class=bola> &#0149;</span>
<A class=menu href="support.html" onmouseover="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<A class=menu href="free.html" onmouseover="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<A class=menu href="press.html" onmouseover="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<A class=menu href="address.html" onmouseover="window.status=' Contato'; return true">contato</a>
<hr size=1></div>
    </td></tr>
</table>

<table width=100% cellpadding=5 cellspacing=0>
<tr bgcolor="#fedea0">
	<th><A class=menu href="logo.html">PARTE 1</a></th>
	<th><A class=menu href="logo2.html">PARTE 2</a></th>
	<th><A class=menu href="logo3.html">PARTE 3</a></th>
	<th bgcolor="#cc9966"><b>PARTE 4</b></SPAN></th>	
	<th><A class=menu href="logo5.html">PARTE 5</a></th>
</tr>
</table>

<h1><hr size=1>
            O Logo &eacute; uma tecnologia obsoleta?<hr size=1></h1>

<p class=olho>
Esta &eacute; uma discuss&atilde;o que foi mantida na <A
 href="news:comp.lang.logo" >comp.lang.logo</a> (e na correspondente 
lista de discuss&atilde;o por e-mail de 16 de novembro a 2 de 
dezembro, em 1998. A discuss&atilde;o foi intitulada <a
 href="http://el.www.media.mit.edu/logo-foundation/" 
            target=new_window>&quot;O Logo &eacute; uma
tecnologia obsoleta?&quot;</a>

<p class=autor>
De Ken Kahn:

<p>
Brian Harvey escreveu: <br>&quot;Eu penso que a melhor solu&ccedil;&atilde;o para este problema &eacute; um sistema
h&iacute;brido, no qual as coisas que s&atilde;o facilmente expressas
graficamente possam s&ecirc;-lo, mas tamb&eacute;m que tudo possa ser
expresso textualmente.&quot;

<p>Eu creio que este &eacute; um grande 
            t&oacute;pico de pesquisa. Mas eu me
preocupo com os compromissos que seriam necess&aacute;rios para fazer
que isto funcione corretamente para uma linguagem de programa&ccedil;&atilde;o
de uso geral.
E tamb&eacute;m tenho d&uacute;vidas se os h&iacute;bridos
acrescentam alguma esp&eacute;cie de complexidade cognitiva. Por outro
lado, &eacute; sempre uma boa coisa ser capaz de ver ou compreender
alguma coisa de diversos modos. 

<p>&quot;Talvez o ToonTalk o seja, 
            tamb&eacute;m, desde que voc&ecirc; diz que ele
produz c&oacute;digos Java. Se o c&oacute;digo Java n&atilde;o &eacute; convoluto tamb&eacute;m (eu
ainda n&atilde;o tive chance de jogar com ele &ndash; eu tentarei faz&ecirc;-lo em
breve!) e se voc&ecirc; pode usar o c&oacute;digo Java para criar novas
habilidades no GUI, eu ficarei satisfeito, ent&atilde;o.&quot;

<p>O c&oacute;digo Java &eacute; 
            leg&iacute;vel, mas n&atilde;o o tipo de c&oacute;digo que algu&eacute;m
poderia escrever do nada. Tornar poss&iacute;vel alterar o c&oacute;digo Java e
t&ecirc;-lo refletido no ToonTalk &eacute; um problema muito dif&iacute;cil. 

<p>&quot;Btw, dizer que a concorr&ecirc;ncia 
            &eacute; `natural&acute; para as pessoas levanta
muitas quest&otilde;es para mim. Realmente, eu creio que se voc&ecirc; est&aacute;
simulando um mundo de atores independentes, parece natural
program&aacute;-los separadamente. Mas meus alunos de Ci&ecirc;ncia da
Computa&ccedil;&atilde;o certamente n&atilde;o consideram natural os problemas de
sincroniza&ccedil;&atilde;o que surgem se aqueles atores querem compartilhar
estados!&quot;

<p>Eu concordo que o compartilhamento de 
            estados &eacute; &quot;direto&quot; mais do
que atrav&eacute;s da passagem de mensagens. &Eacute; por isso que eu estou
reclamando acerca das vari&aacute;veis globais como os &uacute;nicos meios de
comunica&ccedil;&atilde;o no MicroWorlds. Eu escreverei um ensaio maior, em
breve, sobre esta quest&atilde;o e o enviarei para c&aacute;.

<p>
Sauda&ccedil;&otilde;es,<br>
- Ken Kahn 

<p><hr size=1>

<p class=autor>Ken Kahn escreveu:

<p class=reply>&quot;O c&oacute;digo Java 
            &eacute; leg&iacute;vel, mas n&atilde;o o tipo de c&oacute;digo que algu&eacute;m
poderia escrever do nada. Tornar poss&iacute;vel alterar o c&oacute;digo Java e
t&ecirc;-lo refletido no ToonTalk &eacute; um problema muito dif&iacute;cil.&quot;

<p class=reply>
Eu n&atilde;o estou solicitando isso. O que eu pe&ccedil;o &eacute; que seja capaz de
escrever, em Java, um novo instrumento, ou um novo item de menu,
ou qualquer coisa assim, e integr&aacute;-lo no mundo do TT.


<p><hr size=1>

<p class=autor>Brian Harvey escreveu:

<p>&quot;Eu suponho que o texto receba golpes 
            estes dias. N&oacute;s
costum&aacute;vamos n&atilde;o ter nada al&eacute;m de texto, e todos reagiram de
forma exagerada. O texto ainda &eacute; um meio realmente expressivo!
Mesmo para emo&ccedil;&otilde;es, deixemos os programas de computadores
sozinhos.&quot; 

<p>Eu concordo inteiramente. N&oacute;s temos um lado esquerdo do c&eacute;rebro
que aprecia texto e um lado direito que aprecia figuras. Enquanto
tantos argumentos competitivos tentam provar que seu lado favorito &eacute;
&quot;melhor&quot;, eu simplesmente replicaria, n&atilde;o h&aacute; nada como utilizar os
DOIS! Realmente, eu geralmente agrupo pessoas em 4 categorias:
Lado direito dominante, lado esquerdo dominante, ambos, e, claro,
nenhum deles!

<p>Bob

<p>&quot;Para obter NOVAS respostas, voc&ecirc; deve formular NOVAS quest&otilde;es!&quot; - Bob Gorman.

<p><br>
<hr size=1>

<p class=autor>
Bob Gorman escreveu:

<P>&quot;N&oacute;s temos um lado esquerdo do c&eacute;rebro que aprecia texto e um
lado direito que aprecia figuras.&quot;

<p>
Eu aprecio texto (poesia, romances) que cria imagens em minha
mente. Por exemplo, eu gosto de ler Victor Hugo. 

<p>
Com o Logo eu posso usar o texto para criar imagens que n&atilde;o s&atilde;o
exatamente como eu pensava que fossem.

<p>
Eu posso me surpreender a mim mesmo. Eu gosto disso.

<p>
Dale --- $ <A href="mailto:dale-reed@worldnet.att.net">dale-reed@worldnet.att.net</a>&nbsp;
Seattle, Washington U.S.A. $ 

<p><hr size=1>

<p class=autor>
De Ken Kahn:

<p>&quot;N&oacute;s temos um lado esquerdo do c&eacute;rebro que aprecia texto e um
lado direito que aprecia figuras. Enquanto tantos argumentos
competitivos tentam provar que seu lado favorito &eacute; `melhor&acute;, eu
simplesmente replicaria, n&atilde;o h&aacute; nada como utilizar os DOIS!&quot;

<p>Algumas pessoas s&atilde;o chamadas 
            &quot;pensadores visuais&quot; porque elas parecem ser boas para 
            resolver problemas visuais e elas relatam a
utiliza&ccedil;&atilde;o de imagens visuais quando pensam. Para essas pessoas,
as linguagens de programa&ccedil;&atilde;o textual s&atilde;o dif&iacute;ceis.

Os pensadores visuais provavelmente prefeririam linguagens de programa&ccedil;&atilde;o visual, e seriam mais eficientes utilizando-as, do que as linguagens
textuais.

Outras pessoas parecem preferir textos e s&iacute;mbolos. Talvez o
ToonTalk n&atilde;o seja apropriado para elas. Uma linguagem h&iacute;brida
visual-textual poderia satisfazer ambos os tipos de pensadores, mas
talvez n&atilde;o. Necessitam-se de compromissos para fazer um bom
h&iacute;brido.

E os h&iacute;bridos tendem a ser mais complexos e muito mais
dif&iacute;ceis de projetar. Eu desconfio que as crian&ccedil;as, particularmente as
mais jovens, s&atilde;o mais visuais e menos textuais/simb&oacute;licas em seu
pensamento.

Eu sei que estas categorias s&atilde;o grosseiras e muito
simplistas, mas eu penso que existem modos poderosos de pensar
acerca destas quest&otilde;es. Algu&eacute;m conhece algo acerca da pesquisa
psicol&oacute;gica nestas quest&otilde;es?

<p>
Sauda&ccedil;&otilde;es, &nbsp;&nbsp;&nbsp;<br>
Ken Kahn 
<p><hr size=1>

<p class=autor>De Brian Harvey:

<p class=reply>
&quot;Ken Kahn&quot; &lt;<A href="mailto:KenKahn@ToonTalk.com">KenKahn@ToonTalk.com</a>&gt; escreveu: <br>&quot;Necessitam-se de compromissos para fazer um bom h&iacute;brido.&quot; 

<p class=reply>
N&atilde;o, n&atilde;o! 
            Compromissos fazem um mau h&iacute;brido. S&atilde;o necess&aacute;rias
s&iacute;nteses para um adequado. (Eu aprendi isso nas aulas de
Marxismo.) Os compromissos seriam como aqueles antigos
sistemas &quot;macro&quot; para o Mac que gravavam cliques de mouse em
coordenadas pixel.

<p class=reply>
Assim, por exemplo, tome aquele 
            aspecto de troca de dois valores
que voc&ecirc; fez no ToonTalk na outra noite. O c&oacute;digo Java
correspondente se pareceria com Pixels, ou ele se assemelharia
com o modo que voc&ecirc; programou uma mudan&ccedil;a diretamente em
Java? (Bem, eu suponho que n&atilde;o seja o caso, exatamente, mas eu
fixei uma mudan&ccedil;a [a, b] na qual a mudan&ccedil;a &eacute; o procedimento que
voc&ecirc; forneceu que descobre uma parte vaga interessante na tela.)

<p><hr size=1>

<p class=autor>
De Ken Kahn:

<p class=reply>Brian Harvey escreveu:<br><br>

<p class=reply>
N&atilde;o, n&atilde;o! 
            Compromissos fazem um mau h&iacute;brido. S&atilde;o necess&aacute;rias
s&iacute;nteses para um adequado. (Eu aprendi isso nas aulas de
Marxismo.) Os compromissos seriam como aqueles antigos
sistemas &quot;macro&quot; para o Mac que gravavam cliques de mouse em
coordenadas pixel.

<p class=reply>
Assim, por exemplo, tome aquele 
            aspecto de troca de dois valores
que voc&ecirc; fez no ToonTalk na outra noite. O c&oacute;digo Java
correspondente se pareceria com Pixels, ou ele se assemelharia
com o modo que voc&ecirc; programou uma mudan&ccedil;a diretamente em
Java? (Bem, eu suponho que n&atilde;o seja o caso, exatamente, mas eu
fixei uma mudan&ccedil;a [a, b] na qual a mudan&ccedil;a &eacute; o procedimento que
voc&ecirc; forneceu que descobre uma parte vaga interessante na tela.)

<p class=reply>Alguma coisa entre isso. Aqui 
            est&aacute; o programa Java intocado gerado
automaticamente treinando um rob&ocirc; para trocar dois n&uacute;meros se
eles t&ecirc;m problemas. Um grande projeto (algum estudante graduado
est&aacute; participando?) &eacute; construir uma ferramenta que transforme o
seguinte c&oacute;digo Java em algo mais normal. Meu palpite &eacute; que um
bom avaliador parcial poderia faz&ecirc;-lo.

<p class=reply>
Sauda&ccedil;&otilde;es,<br>
- Ken Kahn (<a href="http://www.ToonTalk.com/">www.ToonTalk.com</a>)<br><br>


Import ap.ToonTalk.*;<br>

Class Robot_P extends TTRobot {<br>

Robot_P(TTNotebook n) {<br>

Notebook =

  n;<br>

}<br>

public TTObjects gets (TTObject given) throws TTException {<br>

if (! Wants.matches (given)) return null;<br>

// If given a box that matches the box in his thought bubble (called &quot;wants&quot;),<br>

// this robot will do the following.<br>

TTObject hand;<br>

TTObject temp1;<br>

// pick up what's in the first hole inside his box<br>

hand = given.pickUp (0);<br>

//drop it<br>

temp1 = hand;<br>

// pick up what's in the third hole inside his box<br>

hand= given.pickUp(2);<br>

//drop it on the first hole inside his box<br>

given.holeGets(0,hand);<br>

//pick up the last thing he made or found<br>

hand= temp 1;<br>

// drop it on the third hole inside his box<br>

given.holeGets(2, hand);<br>

return this;//This robot has finished and will see if the box still matches his thoughts and try again.<br>

}<br>

}<br>

public class Applet_P extends TTApplet {<br>

public static void main (String args[]) {<br>

new TTFrame().begin (new Applet_P());<br>

}<br>

public void initialize() {<br>

TTNotebook notebook = TT.NOTEBOOK;<br>

Box = new TTBox (3);<br>

Box.setHole(0, new TTInteger (2, &quot;+&quot;));<br>

Box.setHole(1, new TTScale(&quot;&gt; &quot;));<br>

Box.setHole (2, new TTInteger(1, &quot;+&quot;));<br>

//We just made a box with 3 holes. The first hole contains the number 2. The <br>

// second hole contains a scale tipped to the left. The third hole contains <br>

// the number 1.<br>

Robot= new Robot_P (notebook);<br>

TTBox wants1 = new TTBox(3);<br>

// This robot will only accept a box with 3 holes. Rthe first hole contains<br>

// any number. The second hole contains a scale tipped to the left. The third<br>

// hole contains any number.<br>

Wants1.setHole (O, TT.BLANK_NUMBER);<br>

Wants1.setHole(1, new TTScale( &quot;&gt; &quot;));<br>

Wants 1.setHole(2, TT.BLANK_NUMBER);<br>

Robot.setWants (wants1);<br>

Team = new TTTeam(box, robot);<br>

SetStarting Team(team);<br>

Display This(box);<br>

}<br>
}<br>


<p><hr size=1>

<p class=autor>
De Brian Harvey:

<p class=reply>
Ken Kahn escreveu:<br><br>&quot;hand =

  given.pickUp (0);<br>
temp1 = hand;<br>
hand= given.pickUp(2);<br>
given.holeGets(0,hand);<br>
hand= temp 1;<br>
given.holeGets(2,hand);&quot;<br>

Formid&aacute;vel! Eu estou impressionado. Funcionaria sem &quot;hand&quot;?
Quero dizer, se n&oacute;s alterarmos o c&oacute;digo Java para<br><br>

Temp1= given.pickUp(0);<br>
Given.holeGets (0, givenpick.up(2));<br>
Given.holeGets(2, temp1);<br><br>

<p class=reply>
A anima&ccedil;&atilde;o 
            ocorreria de alguma forma interessante? (Eu penso que
poderia ser inclu&iacute;da apenas ocorrendo, completamente, em um
&quot;flash&quot; &ndash; at&eacute; que n&atilde;o explodisse ou deixasse confete na tela, ou algo
assim.) 

<p class=reply>
Se este tipo de coisa funcionar, deixar&aacute; a porta aberta para o tipo de
programabilidade de modo-texto que eu (seguindo Eisenberg) desejo.

<p class=reply>[Muito ruim &eacute; o Java com 
            toda aquela coisa de &quot;bl&aacute; bl&aacute; bl&aacute;&quot; p&uacute;blico ... :-)

<p class=reply>Se apenas fosse Logo, isso seria perfeito.]

<p><hr size=1>

<p class=autor>De Ken Kahn:

<p class=reply>
Brian Harvey escreveu<br>&quot;Formid&aacute;vel! Eu estou impressionado. Funcionaria sem &quot;hand&quot;?
Quero dizer, se n&oacute;s alterarmos o c&oacute;digo Java para<br><br>

Temp1= given.pickUp(0);<br>
Given.holeGets (0, givenpick.up(2));<br>
Given.holeGets(2, temp1);<br>

<p class=reply>
A anima&ccedil;&atilde;o 
            ocorreria de alguma forma interessante? (Eu penso que
poderia ser inclu&iacute;da apenas ocorrendo, completamente, em um
&quot;flash&quot; &ndash; at&eacute; que n&atilde;o explodisse ou deixasse confete na tela, ou algo
assim.)&quot;

<p class=reply>Aquilo deve funcionar. E um pequeno &quot;otimizador peephole&quot; poderia
provavelmente ger&aacute;-lo automaticamente.

<p class=reply>
Mas eu devo esclarecer que o 
            aplicativo Java n&atilde;o exibe os gr&aacute;ficos do ambiente de programa&ccedil;&atilde;o do ToonTalk. Neste caso, voc&ecirc; n&atilde;o v&ecirc;
a passagem que est&aacute; rodando como um aplicativo Java. Se, no outro
lado, voc&ecirc; constr&oacute;i uma aplica&ccedil;&atilde;o gr&aacute;fica no interior do ToonTalk
(por exemplo, o exemplo do jogo de pingue-pongue), ent&atilde;o aqueles
gr&aacute;ficos ser&atilde;o transferidos para Java.

<p class=reply>
Sauda&ccedil;&otilde;es,<br>
- Ken Kahn (<a href="http://www.ToonTalk.com/">www.ToonTalk.com</a>)

<p><hr size=1>

<p class=autor>
Ken Kahn escreveu:

<p>&quot;Eu concordo, o texto &eacute; bom. Mas 
            como eu escrevi em outra parte
desta discuss&atilde;o com rela&ccedil;&atilde;o a se alguns paradigmas de
programa&ccedil;&atilde;o s&atilde;o superiores a outros &ndash; h&aacute; uma necessidade de
prioridades aqui. Se um professor est&aacute; ensinando apenas uma
linguagem em um curso, ela deveria ser visual ou textual?&quot;

<p>Parte da chave desta quest&atilde;o &eacute; a defini&ccedil;&atilde;o de &quot;superior&quot;, e esta
depende de suas prioridades.

<p>
Minhas prioridades: 1. Dar aos estudantes oportunidades ricas e
variadas para expressar seus pensamentos verbal,
visual, auditiva e cinestesicamente. 2. Dar aos
estudantes oportunidades para refletir sobre como eles pensam.

<p>
Como as linguagens de 
            programa&ccedil;&atilde;o est&atilde;o entre as coisas que oferecem
possibilidades nestas duas &aacute;reas, eu estou interessado em
explorar meios pelos quais elas possam ser inclu&iacute;das no aprendizado
dos estudantes. Se eu tivesse de formular uma
quest&atilde;o como a que voc&ecirc; fez acima, eu perguntaria, se um professor
vai ensinar apenas uma linguagem, qual atingir&aacute; melhor os objetivos
dos estudantes? &quot; Eu apreciei a resposta de Brian Harvey:

<p>&quot;Eu penso que a melhor 
            solu&ccedil;&atilde;o para este problema &eacute; um sistema
h&iacute;brido, no qual as coisas que s&atilde;o facilmente expressas
graficamente possam s&ecirc;-lo, mas tamb&eacute;m que tudo possa ser
expresso textualmente.&quot;

<p>Tom Woods


<hr size=1>
<A class=menu href="toontalk.html">in&iacute;cio</a> <span class=bola> &#0149;</span>
<A class=menu href="search.html">busca</a> <span class=bola> &#0149;</span>
<A class=menu href="buy.html">adquira</a> <span class=bola> &#0149;</span>
<A class=menu href="doc.html">manual</a> <span class=bola> &#0149;</span>
<A class=menu href="whatsnew.html">novidades</a> <span class=bola> &#0149;</span>
<A class=menu href="faq.html">d&uacute;vidas</a> <span class=bola> &#0149;</span>
<A class=menu href="support.html">suporte</a> <span class=bola> &#0149;</span>
<A class=menu href="free.html">download</a> <span class=bola> &#0149;</span>
<A class=menu href="press.html">imprensa</a> <span class=bola> &#0149;</span>
<A class=menu href="address.html">contato</a> 
    

</td></tr></table>
</div>
</body></html>

<!--  FuturArte Editora Ltda.                                     Divertire  -->