<html>
<head>
<title>ToonTalk - Usando imagens e clipes animados</title>
<link rel="stylesheet" type="text/css" href="ToonTalk.css">
</head>

<body link="#0000ff" vlink="#800080" bgcolor="#ffffff">

<div align="center">
<a name="topo"></a>
<table width=468 cellspacing=0 cellpadding=0 border=0><tr><td>

<p>
<table  cellspacing=0 cellpadding=0 border=0><tr><td>
<div align=center>
<A class=menu href="toontalk.html" onmouseover="window.status=' Início'; return true">in&iacute;cio</a><span class=bola> &#0149;</span>
<A class=menu href="search.html" onmouseover="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<A class=menu href="buy.html" onmouseover="window.status=' Compra'; return true">compra</a><span class=bola> &#0149;</span>
<A class=menu href="doc.html" onmouseover="window.status=' Manual'; return true">manual</a><span class=bola> &#0149;</span>
<A class=menu href="whatsnew.html" onmouseover="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<A class=menu href="faq.html" onmouseover="window.status=' Dúvidas'; return true">d&uacute;vidas</a><span class=bola> &#0149;</span>
<A class=menu href="support.html" onmouseover="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<A class=menu href="free.html" onmouseover="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<A class=menu href="press.html" onmouseover="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<A class=menu href="address.html" onmouseover="window.status=' Contato'; return true">contato</a>
<hr size=1></div>
    </td></tr>
</table>

<h2>Usando imagens e clipes animados</h2>

<p>
A <A href="notebook.html" onmouseover="window.status=' '; return true">agenda</a> na p&aacute;gina 2 de sua 
            agenda principal cont&eacute;m uma cole&ccedil;&atilde;o de imagens 
            e anima&ccedil;&otilde;es. Voc&ecirc; pode apenas pegar uma, e, se for uma anima&ccedil;&atilde;o, ela come&ccedil;ar&aacute; a rodar. Algumas t&ecirc;m mais de um ciclo de anima&ccedil;&atilde;o que pode ser exibido.Voc&ecirc; pode utilizar os  <A href="keyboard.html#Pictures" onmouseover="window.status=' '; return true">comandos de teclado.</a>


<p>Se voc&ecirc; colocar uma imagem (ou anima&ccedil;&atilde;o) em outra, ent&atilde;o <A href="bammer.html" onmouseover="window.status=' '; return true">Bambam</a> as amassar&aacute; juntas.
Elas permanecer&atilde;o juntas a menos que voc&ecirc; utilize <A href="dusty.html" onmouseover="window.status=' '; return true">Asper</a> para separ&aacute;-las.

<p>Voc&ecirc; pode girar as imagens 
            pressionando &quot;f &quot; enquanto as segura. Voc&ecirc; ver&aacute; uma grande &aacute;rea cinza atr&aacute;s e uma agenda cheia de <A href="remote.html" onmouseover="window.status=' '; return true">controles remotos e sensores</a> que 
            aparecer&atilde;o. Com esses controles remotos voc&ecirc; pode 
            alterar onde est&aacute; a imagem, qu&atilde;o r&aacute;pido ela se move, qu&atilde;o grande &eacute; e como se parece. Voc&ecirc; pode tamb&eacute;m encontrar sensores que exibem quando a imagem est&aacute; se colidindo com algo mais.
Voc&ecirc; pode treinar <A href="robot.html" onmouseover="window.status=' '; return true">rob&ocirc;s</a> para 
            trabalhar com esses controles remotos e sensores e ent&atilde;o 
            coloc&aacute;-los atr&aacute;s da imagem. Ent&atilde;o, voc&ecirc; pode dar a esses rob&ocirc;s as caixas que eles desejam. Quando voc&ecirc; girar a imagem, os rob&ocirc;s come&ccedil;ar&atilde;o a trabalhar e dar &agrave;s imagens qualquer esp&eacute;cie imagin&aacute;vel de comportamento. Elas poder&atilde;o saltar, explodir ao contato, dan&ccedil;ar um pouco, ou qualquer outra coisa. O exemplo &quot;Pingue-Pongue&quot; mostra dois garotos utilizando estas coisas para construir um jogo de pingue-pongue.

<p><b>Dica.</b> Voc&ecirc; 
            pode girar uma imagem e coloc&aacute;-la atr&aacute;s de outra imagem. Isto &eacute; muito mais r&aacute;pido do que mover um grupo de rob&ocirc;s e caixas de uma imagem para a pr&oacute;xima. &Eacute; um grande modo de &quot;embalar&quot; um comportamento e ent&atilde;o dar esse comportamento a v&aacute;rios objetos diferentes.

<p><b>Dica.</b> Muitos jogos s&atilde;o feitos utilizando o que os cientistas chamam <i>sprites</i> &ndash; pequenos ciclos de 
            anima&ccedil;&atilde;o que podem se mover e se comportar de um modo espec&iacute;fico. Isto &eacute; o que s&atilde;o as imagens do ToonTalk com os rob&ocirc;s por tr&aacute;s.

<p><b>Imagens em branco.</b> Voc&ecirc; pode utilizar Asper para tornar uma imagem em branco. Isto &eacute; &uacute;til no interior das <A href="bubble.html" onmouseover="window.status=' '; return true">mentes</a> quando 
            voc&ecirc; quer que o rob&ocirc; trabalhe em qualquer imagem.

<p><b>Dica.</b> Voc&ecirc; pode <A href="sensor.html#PictureFile" onmouseover="window.status=' '; return true"> trazer suas pr&oacute;prias imagens para o ToonTalk </a> utilizando um dos sensores.

<p><b>Dica 
            Avan&ccedil;ada.</b> Voc&ecirc; pode fazer com que os n&uacute;meros 
            e os textos ajam como imagens se voc&ecirc; fez uma imagem em branco e colocou um n&uacute;mero ou grupo de texto em cima. Voc&ecirc; tamb&eacute;m pode colocar rob&ocirc;s atr&aacute;s. O exemplo &quot;pingue-pongue&quot; mostra os garotos fazendo um marcador de pontos colocando um rob&ocirc; atr&aacute;s da imagem de um n&uacute;mero. 

<p><a name="PicturesCollide"></a><b>Dica Avan&ccedil;ada.</b> 
            Voc&ecirc; pode colocar um pombo atr&aacute;s de uma imagem. Isto pode ser realmente &uacute;til quando voc&ecirc; utiliza  o sensor que exibe <A href="remote.html#WhichPicture" onmouseover="window.status=' '; return true">com o que  a imagem est&aacute; colidindo</a>. Se o ninho de um pombo 
            atr&aacute;s de uma imagem est&aacute; em uma caixa que uma equipe 
            de rob&ocirc;s est&aacute; esperando, ent&atilde;o isto 
            permitir&aacute; qualquer esp&eacute;cie de intera&ccedil;&atilde;o entre objetos que colidem.
Por exemplo, rob&ocirc;s atr&aacute;s de um coelho poderiam estar esperando por uma imagem de uma planta para aparecer no detetor de colis&atilde;o. Os rob&ocirc;s podem ent&atilde;o esvaziar uma imagem (uma c&oacute;pia da planta com a qual o coelho est&aacute; colidindo), expeli-la, gir&aacute;-la, apanhar o pombo e dar a ele a caixa para perguntar o gosto dela. A caixa &eacute; levada para um ninho atr&aacute;s da planta, onde um rob&ocirc; est&aacute; esperando para responder tais quest&otilde;es.

<p>
<hr size=1><div align=center>
<A class=menu href="toontalk.html" onmouseover="window.status=' Início'; return true">in&iacute;cio</a><span class=bola> &#0149;</span>
<A class=menu href="search.html" onmouseover="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<A class=menu href="buy.html" onmouseover="window.status=' Compra'; return true">compra</a><span class=bola> &#0149;</span>
<A class=menu href="doc.html" onmouseover="window.status=' Manual'; return true">manual</a><span class=bola> &#0149;</span>
<A class=menu href="whatsnew.html" onmouseover="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<A class=menu href="faq.html" onmouseover="window.status=' Dúvidas'; return true">d&uacute;vidas</a><span class=bola> &#0149;</span>
<A class=menu href="support.html" onmouseover="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<A class=menu href="free.html" onmouseover="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<A class=menu href="press.html" onmouseover="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<A class=menu href="address.html" onmouseover="window.status=' Contato'; return true">contato</a></div></td>

</tr></table>
</div>
</body></html>

<!--  FuturArte Editora Ltda.                                     Divertire  -->