<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>Att hantera onormala avbrott i ToonTalk</title>		<meta name="generator" content="Adobe GoLive 4">		<meta name="Version" content="8.0.4308">		<meta name="Date" content="7/8/97">		<meta name="Template" content="C:\Program Files\Microsoft Office\Office\HTML.DOT">	</head>	<body text="black" link="blue" vlink="purple" bgcolor="white">		<center>			<font size="4" face="Comic Sans MS"><b>Om ToonTalk pl&ouml;tsligt kraschar</b></font></center>		<p><font face="Comic Sans MS">Om ToonTalk pl&ouml;tsligt kraschar finns det flera t&auml;nkbara orsaker. B&ouml;rja med att kolla om du kan g&ouml;ra samma sak igen f&ouml;r att f&aring; det att krascha. </font></p>		<ul>			<li><font face="Comic Sans MS">ToonTalk har inte installerats p&aring; r&auml;tt s&auml;tt. Detta &auml;r inte s&auml;rskilt troligt om ToonTalk fungerat bra tidigare. Att installera om g&aring;r naturligtvis bra.</font>			<li><font face="Comic Sans MS">ToonTalk har f&ouml;r lite minne eller h&aring;rddiskutrymme. Kontrollera att din maskin har tillr&auml;ckligt med minne och h&aring;rddiskutrymme. Vissa maskiner kr&auml;ver 10 till 20 MB ledigt utrymmer p&aring; h&aring;rddisken.</font>			<li><font face="Comic Sans MS">Kanske har de filer som kopplats till en speciell anv&auml;ndare blivit f&ouml;rst&ouml;rda. Kolla om ToonTalk fungerar n&auml;r du loggar in som under ett annat namn.</font>			<li><font face="Comic Sans MS">Du har kanske flera versioner av ToonTalk. Klicka p&aring; &quot;Set Options&quot; n&auml;r du startat ToonTalk och om du f&aring;r fr&aring;gan vilken version du vill k&ouml;ra kan du prova att byta version f&ouml;r att se om det hj&auml;lper.</font>			<li><font face="Comic Sans MS">ToonTalk kan k&ouml;ras antingen i fullsk&auml;rmsl&auml;ge eller i ett f&ouml;nster. Pr&ouml;va om problemet best&aring;r i b&aring;da l&auml;gena. Klicka p&aring; &quot;Set Options&quot; n&auml;r du startat ToonTalk f&ouml;r att st&auml;lla in detta.</font>			<li><font face="Comic Sans MS">32 bitars versionen av ToonTalk anv&auml;nder sig av <a href="download.htm">Microsofts DirectX speltill&auml;gg f&ouml;r Windows</a>. Om du k&ouml;r 32 bitars versionen m&aring;ste du f&ouml;rs&auml;kra dig om att ha den senaste versionen av DirectX och dess drivrutiner. Mera information kan du f&aring; h&auml;r <a href="http://www.microsoft.com/directx">www.microsoft.com/directx</a>.</font>			<li><font face="Comic Sans MS">P&aring; vissa datorer och ToonTalk-inst&auml;llningar kan sk&auml;rmen bli svart, b&ouml;rja &quot;sn&ouml;a&quot; eller flimra. F&ouml;r att l&ouml;sa det problemet kan du via Kontrollpanelen &auml;ndra Windows att anv&auml;nda 256 f&auml;rger. G&ouml;r det i Kontrollpanelen.</font>			<li><font face="Comic Sans MS">ToonTalk kan anv&auml;nda v&auml;ldigt stora tal eller br&aring;ktal. I s&auml;llsynta fall kan s&aring;dana tal f&aring; ToonTalk att stanna upp i flera skunder eller minuter.</font>			<li><font face="Comic Sans MS">Om du anv&auml;nder dig av <a href="ttravel.htm">tidsresande</a> och din stad &auml;r fylld med saker, d&aring; kan ToonTalk kanske stanna d&aring; och d&aring; i n&aring;gra sekunder.</font>			<li><font face="Comic Sans MS" size="3">Du kan hitta information om problem och deras orsaker i din loggfil (\My Documents\ToonTalk\Users\&lt;user name&gt;.txt - d&auml;r &quot;user name&quot; ers&auml;tts med det namn du anv&auml;nde n&auml;r du startade ToonTalk).</font>			<li><font face="Comic Sans MS" size="3">Ser du ett stort vitt f&ouml;nster och det verkar som att ingenting fungerar, d&aring; kan du trycka p&aring; 'Enter'. Troligen &auml;r det en dialogruta som ligger bakom och v&auml;ntar p&aring; ett svar.</font>		</ul>		<p><font face="Comic Sans MS">Kom ih&aring;g att ToonTalk visar ett felmeddelande n&auml;sta g&aring;ng det k&ouml;rs, om datorn st&auml;ngdes av medan ToonTalk var ig&aring;ng. Du b&ouml;r alltid avsluta ToonTalk genom att trycka p&aring; &quot;Pause&quot;.</font></p>		<p><font face="Comic Sans MS">Rapportera g&auml;rna om problem som inte upph&ouml;r genom att <a href="report.htm">klicka h&auml;r</a>.</font></p>		<p><font face="Comic Sans MS">Om du har uppkoppling till Internet kan du <a href="http://www.toontalk.com/English/abnormal.htm">klicka h&auml;r</a> f&ouml;r att f&aring; uppdaterad information om probleml&ouml;sning.</font></p>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>