<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=x-mac-roman">		<title>Att k&ouml;ra ToonTalk med peksk&auml;rm, penna, eller platta</title>		<meta name="GENERATOR" content="Microsoft FrontPage 5.0">	</head>	<body bgcolor="white">		<center>			<font size="6" face="Comic Sans MS"><b>Att k&ouml;ra ToonTalk med peksk&auml;rm, penna, eller platta </b></font></center>		<p><font face="Comic Sans MS">Du kan k&ouml;ra ToonTalk s&aring; att indata fr&aring;n musen behandlas som l&auml;gen p&aring; sk&auml;rmen. Det l&auml;get kallas absolut musl&auml;ge. Det normala l&auml;get f&ouml;r ToonTalk &auml;r att bara notera f&ouml;r&auml;ndringar i musens position. Det l&auml;get kallas relativt musl&auml;ge. </font></p>		<p><font face="Comic Sans MS">I absolut musl&auml;ge klickar du dit du vill flyga, g&aring; eller flytta din hand. Om du &auml;r p&aring; golvet och klickar p&aring; ett f&ouml;rem&aring;l s&aring; flyttas din hand dit och du tar upp f&ouml;rem&aring;let. Sen kan du klicka igen dit du vill flytta f&ouml;rem&aring;let. Ett klick till, och du sl&auml;pper det. F&ouml;r att anv&auml;nda ett verktyg som <a href="dusty.htm">Dammis</a> p&aring; det s&auml;ttet, klicka f&ouml;r att plocka upp honom, klicka igen f&ouml;r att flytta honom dit du vill ha honom, klicka en tangent f&ouml;r att s&auml;tta ig&aring;ng honom och en annan tangent f&ouml;r att st&auml;nga av honom. </font></p>		<p><font face="Comic Sans MS">I absolut musl&auml;ge kan du ocks&aring; dra runt saker genom att h&aring;lla ner musknappen.</font></p>		<p><font face="Comic Sans MS">N&auml;r den figur du &auml;r g&aring;r omkring inne i ett rum och du klickar n&auml;ra botten p&aring; sk&auml;rmen s&aring; kommer din figur s&auml;tta sig ner. N&auml;r din figur sitter ner och du ser v&auml;ggen framf&ouml;r dig, d&aring; kan du klicka p&aring; v&auml;ggen f&ouml;r att st&auml;lla dig upp.</font></p>		<p><font face="Comic Sans MS">F&ouml;r att v&auml;xla till absolut musl&auml;ge &auml;r det bara att s&auml;tta omkopplaren <a href="ttini.htm#AbsoluteMouseMode">AbsoluteMouseMode</a> till 1. Om du anv&auml;nder detta l&auml;ge med en riktig mus till skillnad fr&aring;n en penna eller en peksk&auml;rm beh&ouml;ver du antagligen ocks&aring; s&auml;tta <a href="/C:/toontalk%20stuff/htdocs/Swedish/ttini.htm#ShowMouseCursor">ShowMouseCursor</a> till 1. S&auml;tter du dem till 0 &aring;terg&aring;r du till relativt musl&auml;ge, som &auml;r det normala l&auml;get.</font></p>		<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font>	</body></html>