<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Hammarmusen</title>
		<meta name="GENERATOR" content="Internet Assistant for Microsoft Word 2.0z">
	</head>

	<body bgcolor="white" text="black">
		<center>
			<font face="Comic Sans MS"><img src="../bammer.gif" alt="A picture of Bammer the Mouse smashing two numbers"></font></center>
		<center>
			<p><font face="Comic Sans MS" size="4"><b>Hammarmusen sl&aring;r ihop saker med sin hammare.</b></font></p>
		</center>
		<p><font face="Comic Sans MS">N&auml;r Hammarmusen ser ett <a href="number.htm">sifferkort</a> p&aring; en annan siffra kommer han att sl&aring; ihop dom och l&auml;mna resultatet efter sig. F&ouml;r det mesta &auml;r det summan av talen men du kan f&aring; honom att g&ouml;ra <a href="number.htm">andra matteber&auml;kningar</a>. Hammarmusen kommer ocks&aring; att sl&aring; ihop <a href="text.htm">textkort</a> f&ouml;r att g&ouml;ra dom till ett. Om han ser en <a href="picture.htm">bild</a> sl&auml;ppas p&aring; en annan bild sl&aring;r han ihop dom ocks&aring;. Bara <a href="dusty.htm">Dammis</a> kan dra ur en bild som blivit ihopslagen med en annan. Ibland klarar han till och med av att s&auml;ra p&aring; tv&aring; olika saker. T ex en siffra p&aring; ett textkort eller en text p&aring; en bild.</font></p>
		<p><font face="Comic Sans MS">Om en <a href="bird.htm">f&aring;gel</a> l&auml;gger n&aring;got i sitt bo, n&auml;r det redan ligger n&aring;got i det, g&ouml;r Hammarmusen ingenting.</font></p>
		<p><font face="Comic Sans MS">Tips: Anta att du vill sl&auml;ppa n&aring;got p&aring; n&aring;got annat utan att Hammarmusen sl&aring;r ihop det. tryck p&aring; tangenten F11 i st&auml;llet f&ouml;r att klicka med musknappen. D&aring; ligger det kvar och flyter ovanp&aring;.</font></p>
		<p><font face="Comic Sans MS">Tips: Har Hammarmusen slagit ihop n&aring;got som du vill ha is&auml;r igen, tryck p&aring; F11 s&aring; &aring;ngrar han sig. F11 g&auml;ller bara Hammarmusen och &auml;ndrar inget annat.</font></p>
		<center>
			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>
	</body>

</html>
