<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Template" content="C:\Program Files\Microsoft Office\Office\HTML.DOT">
<meta name="GENERATOR" content="Microsoft FrontPage 5.0">
<title>ToonTalk F&aring;glar och deras bon</title>
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080">

<p align="center"><font size="6" face="Comic Sans MS"><b>F&aring;glar och f&aring;gelbon </b></font><OBJECT id=AgentControl codeBase=#VERSION=2,0,0,0 classid=clsid:D45FD31B-5C6E-11D1-9EC1-00C04FD7081F VIEWASTEXT></OBJECT>

<SCRIPT language=javascript src="../agent.js"></SCRIPT>
<SCRIPT language=javascript src="strings.js"></SCRIPT>
<SCRIPT language=JavaScript event="Click(CharacterID, Button, Shift, X, Y)" for=AgentControl> 

<!-- 

reactToAgentClicked(CharacterID, Button, Shift, X, Y); 

--> </SCRIPT><SCRIPT language=JavaScript event=IdleStart(CharacterID) for=AgentControl> 

<!-- 

idleAgent(CharacterID); 

--> 

</SCRIPT>
<INPUT onclick=agentStart() type=image alt="Peedy can read this page for you." src="../reading.gif" name=Image1 width="58" height="51"></p>

<p align="center"><font size="2" face="Comic Sans MS">
<img src="../bird.gif" alt="A Picture of a bird" width="118" height="158"></font></p>

<p><font size="4" face="Comic Sans MS">Inuti <a href="tooly.htm">Verktygsl&aring;dan</a> finns en j&auml;ttestor h&ouml;g med f&aring;gelbon. Om du tar ut ett ser du att det ligger ett &auml;gg i det.  L&auml;gger du ner boet p&aring; golvet kommer det kl&auml;ckas en f&aring;gel ur &auml;gget. F&aring;glar gillar att ta emot allt de f&aring;r och sen l&auml;gga det i det bo som de kl&auml;cktes i. &Auml;ven om hennes bo blivit flyttat till n&aring;gon annan plats i staden kommer f&aring;geln att hitta sitt bo. det &auml;r bara en grej - f&aring;glar gillar bara saker som &auml;r fyrkantiga. F&aring;glar tar <a href="newnum.htm">sifferkort</a> och <a href="text.htm">textkort</a>, <a href="picture.htm">bilder</a>, och <a href="box.htm">l&aring;dor</a> - inget annat. Som tur &auml;r kan en massa andra saker l&auml;ggas i l&aring;dor. F&aring;geln tar till och med en l&aring;da med andra f&aring;glars bon eller en l&aring;da med andra f&aring;glar i. Ligger det redan n&aring;got i boet n&auml;r f&aring;geln kommer och ska l&auml;gga n&aring;got mer i boet, d&aring; l&auml;ggar hon den nya saken underst i h&ouml;gen. </font></p>

<p><font size="4" face="Comic Sans MS">N&auml;r en f&aring;gel lagt n&aring;got i sitt bo &aring;terv&auml;nder hon dit hon var tidigare.</font></p>

<p><font size="4" face="Comic Sans MS">Du kan anv&auml;nda Pumpas f&ouml;r att g&ouml;ra en f&aring;gel j&auml;ttestor och sen sl&auml;ppa en bild p&aring; f&aring;gelns T-shirt. Om bilden helt och h&aring;llet f&aring;r plats p&aring; f&aring;gelns T-shirt s&aring; kommer den fastna d&auml;r. Du kan ocks&aring; skriva en etikett p&aring; ett f&aring;gelbo medan du  h&aring;ller i boet. </font><font color="#FF0000" face="Comic Sans MS"><b><a href="../bird_t_shirt.dmo"><font color="#FF0000" size="4">Visa mig!</font></a></b></font></p>

<p><font face="Comic Sans MS" size="3"><b><i>Avancerade anv&auml;ndare:</i></b> </font></p>

<p><font face="Comic Sans MS"><b>F&aring;gelkopior.</b> Om du anv&auml;nder din <a href="../%20Old%20Swedish%20TT/wand.htm">Trollstav</a> f&ouml;r att kopiera en f&aring;gel d&aring; tror b&aring;da f&aring;glarna att ett och samma bo &auml;r deras. Men det &auml;r inte n&aring;got problem faktiskt. Dom delar g&auml;rna p&aring; boet.</font><font face="Comic Sans MS" size="3"> Programmerare kallar det h&auml;r many-to-one communication. </font></p>

<p><font face="Comic Sans MS"><b>Kopior av f&aring;gelbon.</b> Om du anv&auml;nder staven f&ouml;r att kopiera ett bo och sen ger f&aring;geln som kl&auml;cktes i det boet n&aring;gonting, d&aring; f&aring;r f&aring;geln bekymmer. Hon tror att b&aring;da bona &auml;r hennes och vill ta med sig det hon f&aring;tt till b&auml;gge bona. Det klarar hon av genom att kopiera b&aring;de sig sj&auml;lv och det hon h&aring;ller i. P&aring; det viset f&aring;r varje bo en kopia. De nya kopiorna av f&aring;geln flyger iv&auml;g n&auml;r dom lagt ifr&aring;n sig det dom haft med sig.</font><font face="Comic Sans MS" size="3"> det Det h&auml;r kallar  <i>one-to-many communication</i> eller <i>multi-casting</i>. Kopierar du f&aring;glar ocks&aring; f&aring;r du flera <i>many-to-many communication</i>. </font><font color="#FF0000" face="Comic Sans MS"><b><a href="../nest_copies.dmo"><font color="#FF0000" size="4">Visa mig hur det funkar!</font></a></b></font></p>

<p><font face="Comic Sans MS" size="3"><b>Kopior av f&aring;glar <i>och </i>f&aring;gelbon.</b> Kopierar du n&aring;got som inneh&aring;ller b&aring;de en f&aring;gel och dess bo, d&aring; f&aring;r kopian b&aring;de en f&aring;gel och ett bo. den nya f&aring;glen vet att det nya boet &auml;r hennes och den gamla f&aring;geln bryr sig inte om det nya boet.</font></p>

<p><font face="Comic Sans MS" size="3"><strong>Att sl&aring; ihop f&aring;gelbon. </strong>Ett f&aring;gelbo kan sl&auml;ppas p&aring; ett annat f&aring;gelbo. nest can be dropped on another nest. Hammarmusen kommer sl&aring; ihop dem och f&aring;glarna som tillh&ouml;r de sammanslagna bona kommer b&aring;de flyga till det sammanslagna boet. . </font><font color="#FF0000" face="Comic Sans MS"><b><a href="../combining_nests.dmo"><font color="#FF0000" size="4">Visa mig hur det funkar!</font></a><font size="4"> </font></b></font></p>
		<p><font face="Comic Sans MS" size="3">
Beginning with Beta 48 or version 3.152 (or product version 3), this has been 
made to consistently follow these rules if nest A is dropped on nest B: (1) 
anything that would have been delivered to nest A shows up on nest B instead and 
(2) copies of whatever is delivered to nest B are delivered to any copies made 
of the result of smashing nests A and B together. Note that the birds of nest A 
will not deliver to copies of nest B that were made before being smashed 
together nor to copies made subsequently to earlier copies of nest B. Diagrams 
illustrating this can be found <a href="birdnest.htm">here</a>.</font></p>
		<p><font face="Comic Sans MS"><b>L&aring;ngdistansf&aring;glar.</b> <a href="../English/ldbird.htm">F&aring;glar kan flyga &ouml;ver ett n&auml;tverk</a> till f&aring;gelbon som finns i andra datorer.</font></p>

<p><font face="Comic Sans MS"><b>Creating a new nest when loaded.</b> If a bird 
is saved while its nest is in Dusty or has been destroyed then when loaded the 
bird will create a new nest.</font></p>

<p><font face="Comic Sans MS"><b>Creating a new egg when a nest is loaded. </b>
If a nest is saved without any of its birds then when loaded a fresh egg will be 
in the nest and a new bird will hatch.</font></p>

<p><font face="Comic Sans MS" size="3"><b>Advanced tip.</b> If a <a href="robot.htm">robot</a>
is expecting something in a box and there's a nest there instead, the robot will wait
around hoping that the bird will cover her nest with what he's looking for. Computer
scientists call this process synchronization. This is a great way to get robots in
different houses to work together and exchange messages. Click for
<a href="programs.htm#Primes">an example of a bunch of robots who work together 
to figure out prime numbers.</a> </font>
<font face="Comic Sans MS" color="#ff0000"><b><a href="../robots_wait.dmo">
<font color="#ff0000" size="4">SHOW ME</font></a></b></font></p>
		<p id="DontRead" align="center"><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></p>
	</body>
</html>