<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>ToonTalk L&aring;dor</title>		<meta name="GENERATOR" content="Internet Assistant for Microsoft Word 2.0z">	</head>	<body bgcolor="white" text="black">		<center>			<font size="4" face="Comic Sans MS"><b>L&aring;dor</b></font></center>		<center>			<p><font face="Comic Sans MS"><img src="../box.gif" alt="A picture of a box"></font></p>		</center>		<p><font face="Comic Sans MS">L&aring;dor &auml;r bra att f&ouml;rvara saker i. du kan l&auml;ggat <a href="number.htm">sifferkort</a> och <a href="text.htm">textkort</a> i dom, liksom <a href="bird.htm">f&aring;glar och f&aring;gelbon</a>, <a href="scale.htm">v&aring;gar</a>, <a href="picture.htm">bilder</a>, och till och med andra l&aring;dor. ToonTalk kommer senare att kunna l&auml;gga mera i l&aring;dor, som <a href="robot.htm">robotar</a>, <a href="truck.htm">lastbilar</a>, <a href="bomb.htm">bomber</a>, och <a href="notebook.htm">anteckningsb&ouml;cker</a>.</font></p>		<p><font face="Comic Sans MS">Du kan koppla ihop tv&aring; l&aring;dor genom att sl&auml;ppa en l&aring;da p&aring; kanten av en annan l&aring;da. Dom m&aring;ste t&auml;cka varandra lite grann n&auml;r man sl&auml;pper. Medan du h&aring;ller i en l&aring;da kan du trycka 0 till 9. P&aring; s&aring; vis kommer l&aring;dan att f&aring; s&aring; m&aring;nga fack som du skriver. Om den nya storleken &auml;r mindre, d&aring; kommer den extra delen av l&aring;dan till h&ouml;ger ramla av. Du kan dela upp en l&aring;da genom att sl&auml;ppa den p&aring; en <a href="number.htm">siffra</a>. Anta att att en l&aring;da med 5 fack sl&auml;pps p&aring; en 3:a. D&aring; delas den i tv&aring; l&aring;dor, en med 3 fack och en med 2 fack.</font></p>		<p><font face="Comic Sans MS"><b>Tips. </b>Du kan l&auml;ra upp en <a href="robot.htm">robot</a> f&ouml;r att hitta eller &auml;ndra vilken del av en l&aring;da som helst bara genom att g&aring; till ett fack och ta ut saker eller l&auml;gga tillbaka dom.</font></p>		<p><font face="Comic Sans MS"><b>Avancerat tips.</b> Om du inte vet vilket fack du ska arbeta med medan du tr&auml;nar honom men du kommer att ha fackets nummer n&auml;r roboten arbetar, d&aring; kan du g&ouml;ra s&aring; h&auml;r. N&auml;r du tr&auml;nar en robot ge honom en l&aring;da med siffran och l&aring;dan du vill att han ska arbeta med (och vad han nu kan beh&ouml;va mera). L&auml;r roboten att ta ur siffran och l&auml;gga ner den och sen ta ut l&aring;dan och sl&auml;ppa den p&aring; siffran. Nu &auml;r facket som roboten ska arbeta med det f&ouml;rsta facket av den del av l&aring;dan som &auml;r till h&ouml;ger. L&aring;t roboten g&ouml;ra det du vill med det facket och l&auml;gg sedan ihop l&aring;dans tv&aring; delar och l&auml;gg tillbaka den d&auml;r du hittade den.</font></p>		<p><font face="Comic Sans MS"><b>L&aring;dor utan fack.</b> Om du trycker 0 medan du h&aring;ller i en l&aring;da kommer du att m&auml;rka att du h&aring;ller i en l&aring;da utan fack. Det &auml;r inte s&auml;rskilt mycket du kan g&ouml;ra med s&aring;dana l&aring;dor. Du kan koppla ihop dom med andra l&aring;dor och d&aring; f&ouml;rsvinner dom. Det &auml;r s&aring;nt som dataforskare tycker &auml;r roligt.</font></p>		<p><font face="Comic Sans MS"><b>Rensade l&aring;dor.</b> <a href="dusty.htm">Dammis</a> kan hj&auml;lpa dig att g&ouml;ra en rensad l&aring;da. St&auml;ll in Dammis p&aring; &lt;R&gt; f&ouml;r rensa. Rensade l&aring;dor kommer v&auml;l till pass i en robots <a href="bubble.htm">tankebubbla</a> n&auml;r du vill vara s&auml;ker p&aring; att en robot har en l&aring;da men du inte bryr dig om hur m&aring;nga fack l&aring;dan har. Du kan ocks&aring; anv&auml;nda dom f&ouml;r att &quot;spr&auml;nga&quot; ett textkort. Om du sl&auml;pper ett textkort som &quot;cat&quot; p&aring; en rensad l&aring;da kommer l&aring;dan f&ouml;rvandlas till en med 3 fack. Det f&ouml;rsta kommer att inneh&aring;lla bara &quot;c&quot;, det andra facket &quot;a&quot;, och det tredje facket &quot;t&quot;.</font></p>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>