<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>ToonTalk robotens tankebubbla</title>		<meta name="GENERATOR" content="Internet Assistant for Microsoft Word 2.0z">	</head>	<body bgcolor="white" text="black">		<center>			<font size="4" face="Comic Sans MS"><b>Robotens tankebubbla</b></font></center>		<center>			<p><font face="Comic Sans MS"><img there will be a picture here. src="../bubble.gif" alt="A picture of a thought bubble"></font></p>		</center>		<p><font face="Comic Sans MS">N&auml;r du tr&auml;nat en <a href="robot.htm">robot</a> har hans tankebubbla en kopia av den <a href="box.htm">l&aring;da</a> han tr&auml;nades att arbeta med. N&auml;r roboten f&aring;r en l&aring;da, ser han efter om den &auml;r samma som l&aring;dan i hans tankebubbla. Om n&aring;got i l&aring;dan i hans tankebubbla &auml;r olika det som finns i den l&aring;da han f&aring;r, kommer han inte ta emot den. Om han &auml;r med i ett arbetslag, kommer han l&aring;ta roboten bakom honom kolla den. Finns det ingen robot bakom honom kommer han helt enkelt sluta arbeta. Han har inga problem att arbeta med en l&aring;da som har mera saker &auml;n den som finns i hans tankebubbla. Om det ligger n&aring;got i l&aring;dan i hans tanke och det p&aring; samma plats i l&aring;dan han f&aring;r ligger ett f&aring;gelbo eller det &auml;r tomt d&auml;r, d&aring; v&auml;ntar han bara. Han b&ouml;rjar igen om f&aring;geln l&auml;gger n&aring;got i sitt bo i l&aring;dan eller om du g&ouml;r det.</font></p>		<p><font face="Comic Sans MS"><b>Tips. </b>Robotar kan vara kinkiga. Du kan anv&auml;nda <a href="dusty.htm">Dammis</a> att ta bort saker fr&aring;n deras tankebubblor s&aring; att de tar emot flera slags l&aring;dor. Tar du bort f&ouml;r mycket kanske de f&ouml;rs&ouml;ker arbeta med l&aring;dor, som de egentligen inte vet vad de ska g&ouml;ra med.</font></p>		<p><font face="Comic Sans MS"><b>Avancerat Tips.</b>Om du anv&auml;nder Dammis f&ouml;r att ta bort bara det som ligger ovanp&aring; ett <a href="number.htm#BlankNumber">sifferkort</a> i hans tankebubbla, d&aring; kommer roboten &auml;nd&aring; v&auml;nta tills det finns ett sifferkort p&aring; samma plats i l&aring;dan som han f&aring;r, men han kommer inte bry sig om vilken siffra som finns p&aring; kortet. Detsamma g&auml;ller <a href="text.htm#BlankText">rensade textkort</a> och l&aring;dor.<br>		</font></p>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>