<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>Exportera och importera i ToonTalk</title>	</head>	<body bgcolor="white">		<center>			<font size="5" face="Comic Sans MS"><b>Hur man tar in och tar ut saker i ToonTalk</b></font></center>		<div align="left">			<p><font face="Comic Sans MS">Ett enkelt s&auml;tt att ta in saker eller ta ut saker i ToonTalk &auml;r att anv&auml;nda Urklipp i Windows.</font></p>			<p><font face="Comic Sans MS">Det g&ouml;r man enklast genom control+C (h&aring;ll ner tangenten med namnet <b>ctrl</b> och sen trycka p&aring; tangenten <b>C</b>) f&ouml;r att kopiera vad du h&aring;ller i till Urklipp. Om du tar <b>ctrl+c</b> och &auml;r p&aring; golvet utan att h&aring;lla i n&aring;got d&aring; kopierar du allt p&aring; golvet till Urklipp. Om du st&aring;r upp i ett hus s&aring; kopieras hela huset om du har version 2 eller senare.</font></p>			<p><font face="Comic Sans MS">N&auml;r vl n&aring;got hamnat i Urklipp kan du klistra in det i vilket textprogram eller mejlprogram som helst. I st f&ouml;r ctrl+c kan <b>klistra in</b> med <b>ctrl+V</b>. Du kan ocks&aring; klistra in det du kopierat i ett ToonTalk p&aring; en annan dator eller i ditt eget ToonTalk. Klistrar du in det du kopierat som text, var noga med att spara det som text och in som Word eller n&aring;got annat.</font></p>			<p><font face="Comic Sans MS">Om du sparar den text du klistrat in i t ex Wordpad som text och sen &auml;ndrar till&auml;gget &lt;<b>.txt</b>&gt; till &lt;<b>.tt</b>&gt; kommer det in i ditt ToonTalk om det ligger i pausl&auml;ge. Om du dubbelklickar p&aring; filen med &lt;<b>.tt</b>&gt; och ToonTalk inte k&ouml;rs alls s&aring; kommer ToonTalk startas och det du kopierat dyka upp n&auml;r du s&auml;tter dig p&aring; golvet.</font></p>			<p><font face="Comic Sans MS">Du kan ocks&aring; anv&auml;nda <a href="sensor.htm#Clipboard">sensorn f&ouml;r urklipp</a> (Till och fr&aring;n andra program) f&ouml;r att ta saker in i och ut ur ToonTalk men de flesta tycker att <b>ctrl+c</b> och <b>ctrl+V</b> &auml;r enklare.</font></p>		</div>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>