<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>Inst&auml;llningar p&aring; ToonTalks kommandorad</title>		<meta name="Generator" content="Microsoft Word 97">		<meta name="Template" content="C:\PROGRAM FILES\MICROSOFT OFFICE\OFFICE\html.dot">	</head>	<body text="black" link="blue" vlink="purple" bgcolor="white">		<center>			<font size="4" face="Comic Sans MS"><b>Inst&auml;llningar p&aring; ToonTalks kommandorad</b></font></center>		<p><font face="Comic Sans MS">N&auml;r du startar upp ToonTalk fr&aring;gar det efter ditt namn. Du kan ange ditt namn p&aring; kommandoraden ist&auml;llet. N&auml;stan alla inst&auml;llningar som beskrivs nedan kan &auml;ven &auml;ndras i <a href="options.htm">anteckningsboken f&ouml;r inst&auml;llningar</a> som finns p&aring; sidan 10 i <a href="notebook.htm">anteckningsboken som bor i verktygsl&aring;dan</a>.</font></p>		<p><font face="Comic Sans MS" size="4"><i><b>Endast f&ouml;r avancerade anv&auml;ndare:</b></i></font></p>		<p><font face="Comic Sans MS">Alternativt kan du st&auml;lla in ToonTalk genom att &ouml;ppna genv&auml;gen som heter &quot;ToonTalk&quot; (Alt-Enter n&auml;r ikonen &auml;r vald.) Efter delen som heter StartTT.exe kan du l&auml;gga till n&aring;gon av f&ouml;ljande inst&auml;llningar. De skiljs &aring;t med med mellanslag. slutar genv&auml;gen med &quot; ska inst&auml;llningen placeras efter citattecknet, t ex</font></p>		<p><font face="Comic Sans MS">&quot;C:\Program Files\Animated Programs\ToonTalk\StartTT.exe&quot; -c 5 -houses 2</font></p>		<p><font face="Comic Sans MS"><b>Inst&auml;llningar</b>:</font></p>		<p><a name="UserName"></a><font face="Comic Sans MS"><b>-n &lt;namn&gt;<br>		</b>Namnet kan vara vilken l&auml;ngd som helst och kan inte inneh&aring;lla mellanslag eller specialtecken. De 8 f&ouml;rsta bokst&auml;verna i namnet kommer att anv&auml;ndas som filnamn f&ouml;r det sparade arbetet. Det f&ouml;rinst&auml;llda namnet &auml;r &quot;No Name&quot;. </font></p>		<p><font face="Comic Sans MS"><b>-h &lt;huvud&gt;<br>		</b>Huvudet kan vara 0 (skallig), 1 (l&aring;ngt h&aring;r), eller 2 (keps). Det f&ouml;rinst&auml;llda &auml;r 2.</font></p>		<p><font face="Comic Sans MS">-s &lt;ljud&gt; vLjudet kan vara 0 f&ouml;r att st&auml;nga av ljudet. Om systemet krashar flera g&aring;nger beror det kanske p&aring; d&aring;liga f&ouml;rbindelser mellan ljuddrivrutinerna och ToonTalk. Testa om 0 l&ouml;ser problemet och rapportera det g&auml;rna.</font></p>		<p><font face="Comic Sans MS"><b>-f &lt;sk&auml;rmstorlek&gt;<br>		</b>Sk&auml;rmstorleken kan vara 0 (320x240 litet f&ouml;nster), 1 (fullsk&auml;rm med Windows grafik avslagen), eller 2 (640x480, Windows normal). 1 verkar se lite b&auml;ttre ut och &auml;r snabbare p&aring; vissa datorer men h&auml;nger sig ofta om det st&ouml;ter p&aring; ett fel i programmet. Ibland n&auml;r det h&auml;nder m&aring;ste man starta om datorn. 1 fungerar &auml;ven oberoende av uppl&ouml;sning och f&auml;rgdjup. </font><a name="OutputLog"></a></p>		<p><font face="Comic Sans MS"><b>-o &lt;namn som inspelning ska f&aring;&gt;<br>		</b>Allt som g&ouml;rs spelas in i filen och kan spelas upp med -i. Det &auml;r ett j&auml;ttebra s&auml;tt att hitta fel i programmet. Filen f&aring;r till&auml;gget .DMO.</font></p>		<p><font face="Comic Sans MS" size="3"><strong><a name="InputLog"></a></strong></font><font face="Comic Sans MS"><b>-i &lt;namn p&aring; inspelning man vill spela upp&gt;<br>		</b>G&ouml;r allt som utf&ouml;rdes n&auml;r -o anv&auml;ndes. -i uppf&ouml;r sig likadant men saktas ned till den ursprungliga inspelningshastigheten om det k&ouml;rs p&aring; en snabbare dator.</font></p>		<p><font face="Comic Sans MS"><b>-c &lt;stadens storlek&gt;<br>		</b>Stadens f&ouml;rinst&auml;llda storlek &auml;r 10</font><font face="Comic Sans MS" size="3">&#215;</font><font face="Comic Sans MS">10 kvarter (varje kvarter inneh&aring;ller 4 hus). Den st&ouml;rsta storleken en stad kan ha &auml;r 255x255. Om talet &auml;r negativt kommer staden att f&aring; husen slumpvist utplacerade.<a name="HousesToABlock"></a></font></p>		<p><font face="Comic Sans MS" size="3"><strong>-city &lt;filnamn&gt;<br>		</strong>Talar om vilken sparad stad du vill vara i n&auml;r ToonTalk startar.</font><a name="MouseButtons"></a></p>		<p><font face="Comic Sans MS"><b>-b &lt;0, 1, 2 eller 3&gt;.<br>		</b>Beskriver antalet musknappar som finns tillg&auml;ngliga. Det f&ouml;rinst&auml;llda v&auml;rdet &auml;r 1. Se <a href="mouse.htm">Musknappar</a></font><font face="Comic Sans MS"> f&ouml;r detaljer.</font></p>		<p><font face="Comic Sans MS"><b>-r &lt;hastighet f&ouml;r uppl&auml;sning&gt;<br>		</b>Hastigheten f&ouml;r uppl&auml;sning kontrollerar hur l&auml;nge text stannar i en pratbubbla. 100 procent &auml;r det f&ouml;rinst&auml;llda v&auml;rdet. St&ouml;rre siffror f&aring;r texten att stanna kortare tid.</font></p>		<p><font face="Comic Sans MS"><b>-l &lt;bokstavsstorlek i pratbubblor&gt;<br>		</b>100 procent &auml;r f&ouml;rinst&auml;llt.<a name="FontChange"></a></font></p>		<p><font face="Comic Sans MS" size="3"><strong>-font_variable &lt;typsnittets namn&gt;<br>		</strong>Typsnitt med variabel bredd som anv&auml;nds i Martys pratbubblor bl a. Om typsnittets namn har ett mellanslag som i New Modern ska du skriva in det som new_modern. Arial &auml;r grundinst&auml;llningen. </font></p>		<dl>			<dt><font face="Comic Sans MS" size="3"><strong>-font_fixed &lt;typsnittets namn&gt;<br>			</strong>Typsnitt med fast bredd som anv&auml;nds p&aring; textkort och sifferkort bl a. Courier New &auml;r grundinst&auml;llningen.</font>		</dl>		<p><font face="Comic Sans MS"><b>-m &lt;minne som tilldelas cache&gt;<br>		</b>Det f&ouml;rinst&auml;llda &auml;r 100 (det anv&auml;nder 25% av det lediga minnet). St&ouml;rre siffror b&ouml;r snabba upp systemet n&aring;got men l&auml;mna mindre minne &aring;t andra &auml;ndam&aring;l.</font></p>		<p><font face="Comic Sans MS"><b>-u &lt;bevara anv&auml;ndarprofil&gt;<br>		</b>1 betyder att i *.usr h&aring;lla reda p&aring; vilka operationer anv&auml;ndaren har utf&ouml;rt och utforma hj&auml;lp d&auml;refter. 0 st&auml;nger av det. 1 &auml;r f&ouml;rinst&auml;llt.</font></p>		<p><font face="Comic Sans MS"><b>-a &lt;hur mycket Marty pratar&gt;<br>		</b>Kan vara mellan 0 till 5. 0 s&aring; s&auml;ger Marsm&auml;nniskan allt m&ouml;jligt. 5 s&aring; s&auml;ger han inte n&aring;gonting alls. 2 &auml;r f&ouml;rinst&auml;llt.<a name="TemporaryUser"></a></font></p>		<p><font face="Comic Sans MS"><b>-t &lt;tempor&auml;r anv&auml;ndare&gt;<br>		</b>1 betyder att ToonTalk inte ska generera eller l&auml;sa anv&auml;ndarfiler f&ouml;r anteckningsb&ouml;cker. 0 &auml;r det f&ouml;rinst&auml;llda v&auml;rdet.</font></p>		<p><font face="Comic Sans MS"><b>-q &lt;ToonTalks hastighet&gt;<br>		</b>100 &auml;r f&ouml;rinst&auml;llt. H&ouml;gre siffror snabbar upp alla animationer.</font></p>		<p><font face="Comic Sans MS"><b>-y &lt;minimum f&ouml;rdr&ouml;jning f&ouml;r bildrutor i millisekunder&gt;<br>		</b>0 &auml;r f&ouml;rinst&auml;llt. 50, tex, resulterar i 20 bildrutor per sekund &auml;ven p&aring; mycket snabba datorer.</font></p>		<p><font face="Comic Sans MS"><b>-bird &lt;se f&aring;glar n&auml;r det &aring;terv&auml;nder utomhus&gt;<br>		</b>Om 0 tar f&aring;glar inte n&aring;gon tid p&aring; sig att &aring;terv&auml;nda efter att de l&auml;mnat n&aring;gonting i sitt bo n&auml;r programmeraren ser p&aring; utomhus. 1 &auml;r f&ouml;rinst&auml;llt.</font></p>		<p><font face="Comic Sans MS"><b>-puzzle &lt;filnamn&gt;<br>		</b>G&ouml;r s&aring; att ToonTalk startar det <a href="make_pzl.htm">uppdrag</a></font><font face="Comic Sans MS"> som namngetts.</font></p>		<p><font face="Comic Sans MS"><b>-next_puzzle<br>		</b>1 G&ouml;r s&aring; att ToonTalk startar med n&auml;sta uppdrag &aring;t anv&auml;ndaren. F&ouml;rsta uppdraget om inget uppdrag blivit avklarat av anv&auml;ndaren.</font></p>		<p><font face="Comic Sans MS"><b>-autodemo &lt;0, 1 eller 2&gt;<br>		</b>0 &auml;r f&ouml;rinst&auml;llt och sl&aring;r av den automatiska demon. 1 betyder att ToonTalk repeterar introduktionen efter 30 sekunder. Om n&aring;gon k&ouml;r &quot;g&ouml;ra uppdrag&quot; eller &quot;leka fritt&quot; v&auml;ntar den i 2 minuter ist&auml;llet. Det kontrolleras av raden i <a href="ttini.htm">toontalk.ini</a> i din windowskatalog som inneh&aring;ller texten: &quot;AutoDemoMaxIdle=120&quot;. 2 skiljer sig p&aring; s&aring; s&auml;tt att ToonTalk spelar upp alla demos en efter en.</font></p>		<p><font face="Comic Sans MS"><b>-subtitles &lt;speed&gt;<br>		</b>Om en demo visas och text finns s&aring; visas den med en hastighet som &auml;r f&ouml;rinst&auml;llt till 100. Om hastigheten &auml;r 0 s&aring; visas inte n&aring;gon text. Textens spr&aring;k kan &auml;ndras med &quot;SubtitlesSuffix=ust&quot; i delen &quot;Executables&quot; i ToonTalk.ini. UST st&aring;r f&ouml;r amerikansk-engelsk text. SET st&aring;r f&ouml;r svensk.<a name="TextToSpeech"></a></font></p>		<p><font face="Comic Sans MS"><b>-speak &lt;0, 1&gt;<br>		</b>1 s&auml;tter ig&aring;ng text-till-prat om du k&ouml;r 32 bitars versionen. 0 st&auml;nger av det. 1 &auml;r f&ouml;rinst&auml;llt i 32 bitars versionen och 0 i 16 bitars versionen.</font></p>		<p><font face="Comic Sans MS"><b>-balloon &lt;0,1&gt;<br>		</b>1 s&auml;tter ig&aring;ng marsm&auml;nniskans pratbubblor. Det f&ouml;rinst&auml;llda &auml;r 1.<a name="MouseSensitivity"></a></font></p>		<p><font face="Comic Sans MS"><b>-mouse_sensitivity &lt;sensitivity&gt;<br>		</b>100 is normal. A number larger than 100 will make small moves of the mouse mean big movements in ToonTalk. A number smaller than 100 will make the mouse less sensitive.<br>		</font></p>		<p><font face="Comic Sans MS"><b>-unicode_code_page &lt;number&gt;<br>		</b>Converts text to Unicode which can display text in all of the world's languages. For example, -unicode_code_page 932 enables the Japanese code page so that you can cut and paste Japanese text. You'll also need to use -font_variable to change to a Unicode font. If the default language is Japanese, this is automatically set.<br>		</font></p>		<p><font face="Comic Sans MS"><b>-mouse_sensitivity<br>		</b>100 &auml;r normalt. Ett tal st&ouml;rre &auml;n 100 kommer att f&aring; sm&aring; musr&ouml;relser att bli stora r&ouml;relser i ToonTalk. Ett tal mindre &auml;n 100 kommer att f&aring; stora musr&ouml;relser att bli sm&aring; r&ouml;relser p&aring; sk&auml;rmen.</font></p>		<p><font face="Comic Sans MS"><b>-language &lt;spr&aring;k&gt;<br>		</b>Tar &ouml;ver grundinst&auml;llningen. Du kan v&auml;lja vilket installerat spr&aring;k som helst med namnet (t ex &quot;English&quot; eller &quot;Swedish&quot;) eller med de tv&aring; bokst&auml;verna f&ouml;r landskodent ex &quot;UK&quot;, &quot;US&quot; eller &quot;SE&quot;). Tar &ouml;ver grundinst&auml;llningen bara n&auml;r Marty talar. Pratbubblan beh&aring;ller grundinst&auml;llningen.</font></p>		<p><font face="Comic Sans MS"><strong>-<a name="SpokenLanguage"></a>spoken_language &lt;</strong><b>spr&aring;k</b><strong>&gt;<br>		</strong>Tar &ouml;ver grundinst&auml;llningen enbart n&auml;r Marty talar. Pratbubblan beh&aring;ller grundinst&auml;llningen.</font></p>		<p><font face="Comic Sans MS"><b><a name="AvenuesAsNumbers"></a>-avenues_as_numbers &lt;0,1&gt;<br>		</b>Med v&auml;rdet 1, kommer avenyerna synas som siffror i st f&ouml;r som ord (ordningstal).</font></p>		<p><font face="Comic Sans MS"><b><a name="AdjustableSizes"></a>-adjustable_sizes &lt;0,1&gt;<br>		</b>Med v&auml;rdet 0 kommer Verktygsl&aring;dan och det som ligger i den ha samma storlek oberoende av sk&auml;rmuppl&ouml;sningen. V&auml;rdet 1 g&ouml;r dom mindre och skarpare i h&ouml;gre uppl&ouml;sningar. </font></p>		<p><font face="Comic Sans MS"><b>-closed_caption &lt;0,1&gt;<br>		</b>Med v&auml;rdet 1 h&ouml;r du Marty tala och ser dessutom undertexterna. Grundinst&auml;llningen &auml;r 0.</font></p>		<p><font face="Comic Sans MS"><b>-subtitle_marty &lt;0,1&gt;<br>		</b>Med v&auml;rdet 1 ser du undertexterna i st f&ouml;r pratbubblorna. Grundinst&auml;llningen &auml;r 0.</font></p>		<p><font face="Comic Sans MS"><b>-create_narration &lt;0,1&gt;<br>		</b>Med v&auml;rdet 1 <a href="make_dmo.htm">skapas en ber&auml;ttarfil</a> (narration file) I mappen Demos. Grundinst&auml;llningen &auml;r 0.</font></p>		<p><font face="Comic Sans MS"><b>-print_narration_start_times &lt;0,1&gt;<br>		</b>Med v&auml;rdet 1 skapas en lista p&aring; starttider f&ouml;r varje ber&auml;ttarfilsegment (narration segment) i din loggfil. Anv&auml;nds f&ouml;r att <a href="make_dmo.htm">skapa undertexter i dina demofilmer.</a> Grundinst&auml;llningen &auml;r 0.</font></p>		<p><font face="Comic Sans MS"><b><a name="IntegerPositions"></a>-integer_positions &lt;0,1&gt;<br>		</b>Med v&auml;rdet 0 kommer <a href="remote.htm#XSensor">sensorerna f&ouml;r x och y l&auml;ge</a> visa exakta v&auml;rden. sensors will display their exact values. Med v&auml;rdet 1 visas v&auml;rdet som heltal. Grundinst&auml;llningen &auml;r 1.</font></p>		<p><font face="Comic Sans MS"><b><a name="HTMLDialogs"></a>-set_option(&lt;category&gt;,&lt;element&gt;,&lt;value&gt;)<br>		</b>Anv&auml;nds f&ouml;r att st&auml;lla in ToonTalks HTML dialoger. Om &ouml;verf&ouml;rt till Start ToonTalk kommer toontalk.ini uppdateras med de tre argumenten.<br>		</font></p>		<p><font face="Comic Sans MS"><b><a name="NextDialog"></a>-next_dialog &lt;HTML filnamn&gt;<br>		</b>Anv&auml;nds f&ouml;r att st&auml;lla in ToonTalks <a href="dialogs.htm">HTML dialoger</a>. Om &ouml;verf&ouml;rt till Start ToonTalk kommer detta bli den n&auml;sta eller f&ouml;rsta dialog som visas.<br>		</font></p>		<p><font face="Comic Sans MS"><b>-previous_dialog<br>		</b>Anv&auml;nds f&ouml;r att st&auml;lla in ToonTalks <a href="dialogs.htm">HTML dialoger</a>. Om &ouml;verf&ouml;rt till Start ToonTalk kommer den tidigare dialogen visas. Fungerar som en &quot;Tillbaka&quot;-knapp i en webbl&auml;sare.</font></p>		<p><font face="Comic Sans MS"><b>-backup_settings<br>		</b>Anv&auml;nds f&ouml;r att st&auml;lla in ToonTalks <a href="dialogs.htm">HTML dialoger</a>. Om &ouml;verf&ouml;rt till Start ToonTalk kommer det aktuella tillst&aring;ndet f&ouml;r toontalk.ini att sparas. </font></p>		<p><font face="Comic Sans MS"><b>-cancel_settings<br>		</b>Anv&auml;nds f&ouml;r att st&auml;lla in ToonTalks <a href="dialogs.htm">HTML dialoger</a>. Om &ouml;verf&ouml;rt till Start ToonTalk kommer toontalk.ini f&aring; tillbaka till inst&auml;llningarna som de var n&auml;r <b>backup_settings</b> bearbetades. Man kommer tillbaka till starttt.htm dialogen.<br>		</font></p>		<p><font face="Comic Sans MS"><b>-accept_settings<br>		</b>Anv&auml;nds f&ouml;r att st&auml;lla in ToonTalks <a href="dialogs.htm">HTML dialoger</a>. Om &ouml;verf&ouml;rt till Start ToonTalk kommer inst&auml;llningarna som de var n&auml;r <b>backup_settings</b> bearbetades att raderas. Man kommer tillbaka till starttt.htm dialogen.</font></p>		<p><font face="Comic Sans MS"><b><a name="ScreenWidth"></a>-screen_width &lt;sk&auml;rmbredd&gt;<br>		</b>St&auml;ller in sk&auml;rmbredden (och h&ouml;jden som &auml;r 3/4 av bredden) i ToonTalks f&ouml;nster eller uppl&ouml;sningen om fullsk&auml;rmsl&auml;ge &auml;r inst&auml;llt. B&auml;st &auml;r att anv&auml;nda &quot;<b>V&auml;lja alternativ</b>&quot; f&ouml;r at st&auml;lla in detta men denna inst&auml;llning till&aring;ter vilken sk&auml;rmbredd som helst. Ett exempel, -sk&auml;rmbredd 2048 kommer k&ouml;ra ToonTalk i en uppl&ouml;sning av 2048x1536. Vanliga sk&auml;rmuppl&ouml;sningar &auml;r enklare att st&auml;lla in via &quot;<b>V&auml;lja alternativ</b>&quot; n&auml;rToonTalk har startats.<br>		</font></p>		<p><font face="Comic Sans MS"><b><a name="DefaultUser"></a>-default_user &lt;anv&auml;ndarnamn&gt;<br>		</b>Kommandorad som ger ett alternativ till toontalk.ini <a href="ttini.htm#DefaultUser">DefaultUser</a> customization. <a href="../defuser.htm">Klicka h&auml;r</a> f&ouml;r mera information.</font></p>		<p><font face="Comic Sans MS"><span lang="en-gb"><b><a name="SecondsBetweenLogs"></a>-seconds_between_logs &lt;antal&gt;</b></span><b><br>		</b><span lang="en-gb">Om antalet &auml;r st&ouml;rre &auml;n 0 d&aring; kommer <a href="ttravel.htm">tidsresan</a> aktiveras och antalet anger hur l&auml;nge varje tidsresesegment varar. the number specifies how long each time travel segment lasts. Kan ocks&aring; <a href="ttini.htm#SecondsBetweenLogs">st&auml;llas in f&ouml;r alla anv&auml;ndare i toontalk.ini</a>. </span></font></p>		<dl>			<dt><font face="Comic Sans MS"><span lang="en-gb"><b><a name="TimeTravelEnabled"></a></b></span></font><font face="Comic Sans MS"><span lang="en-gb"><b>-time_travel_enabled &lt;0,1&gt;</b></span></font>			<dt><font face="Comic Sans MS"><span lang="en-gb">St&auml;ller grundinst&auml;llningen f&ouml;r den markering i dialogen p&aring; sk&auml;rmen som fr&aring;gar efter anv&auml;ndarens namn.</span></font>			<dt>			<dt><font face="Comic Sans MS"><span lang="en-gb"><b><a name="MustBeNewUser"></a></b></span></font><font face="Comic Sans MS"><span lang="en-gb"><b>-must_be_new_user &lt;0,1&gt;</b></span></font>			<dt><font face="Comic Sans MS"><span lang="en-gb">Om den st&auml;lls till 1 kommer ToonTalk garantera att anv&auml;ndarnamnet &auml;r nytt. Om namnet &auml;r upptaget av en annan anv&auml;ndare kommer en siffra l&auml;ggas till f&ouml;r att g&ouml;ra namnet unikt. Anv&auml;ndbart fr&auml;mst i samband med inst&auml;llningen f&ouml;r <a href="../defuser.htm">den anv&auml;ndare som &auml;r den grundl&auml;ggande om inget annat anges.</a> </span></font>			<dt>			<dt><font face="Comic Sans MS"><b><a name="LocalIniFile"></a>-local_ini_file<span lang="en-gb"> </span>&lt;ini filnamn<span lang="en-gb">&gt;</span></b></font>			<dt><font face="Comic Sans MS"><span lang="en-gb">Om denna anv&auml;nds kommer</span> ToonTalk anv&auml;nda toontalk.ini-inst&auml;llningarna i den namngivna i st&auml;llet f&ouml;r de vanliga. Om ingen s&ouml;kv&auml;g anges kommer det antas vara relativt ToonTalks installationsmapp. </font>			<dt>			<dt><font face="Comic Sans MS" size="3"><b>-<a name="ExitAtEndOfDemo"></a>exit_at_end_of_demo &lt;0, 1&gt;</b></font>			<dt><font face="Comic Sans MS">St&auml;llt till 0 i slutet av en demofilm eller tidsresa s&aring; kommer anv&auml;ndaren ta &ouml;ver kontrollen. Grundinst&auml;llningen &auml;r 1. Se ocks&aring;</font><font face="Comic Sans MS" size="3"> toontalk.ini Switch <a href="ttini.htm#ExitWhenDemoEnds">ExitWhenDemoEnds</a>.</font>			<dt>			<dt><a name="KeepRunningDemoDespiteProblems"></a><font face="Comic Sans MS"><b>-keep_running_demo_despite_problems</b></font><font face="Comic Sans MS" size="3"><b> &lt;0, 1&gt;</b></font>			<dt><font face="Comic Sans MS">St&auml;llt till 1 n&auml;r ToonTalk uppt&auml;cker ett problem i ett segment av en demofilm eller tidsresa som spelas s&aring; kommer ToonTalk forts&auml;tta utan att bry sig om problemet. M&aring;nga konstigheter med omspelningar av demofilmer saknar symptom och kan l&auml;mnas utan &aring;tg&auml;rd. Andra kan f&aring; demofilmen att uppf&ouml;ra sig konstigt. Se ocks&aring; <a href="ttini.htm#KeepRunningDemoDespiteProblems">ToonTalk.ini equivalent</a>.</font>		</dl>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>