<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>&Auml;ndra ToonTalks nya HTML dialogf&ouml;nster</title>		<meta name="GENERATOR" content="Microsoft FrontPage 3.0">	</head>	<body bgcolor="white">		<center>			<font size="6" face="Comic Sans MS"><b>Customizing ToonTalk's New HTML Dialogs</b></font></center>		<p><font face="Comic Sans MS">Fr&aring;n och med version 2.52 eller beta 35 visar ToonTalk alla dialoger som baserade p&aring; HTML-filer som anv&auml;ndarna kan komma &aring;t och &auml;ndras. De dialoger som du kan &auml;ndra finns i denna lista:</font></p>		<ul>			<li><font face="Comic Sans MS"><strong>starttt.htm</strong> Detta &auml;r den viktigaste dialogen. It is the one you see when you start up ToonTalk. It has buttons for launching ToonTalk in Free Play or Play Game modes. Den kan k&ouml;ra alla inbyggda demofilmer. Man kan &auml;ndra inst&auml;llningar och   hj&auml;lp. Genom att &auml;nda denna fil kan du best&auml;mma vilka demofilmer och uppdrag som  &auml;r tillg&auml;ngliga, g&ouml;mma vissa m&ouml;jligheter i ToonTalk och l&auml;gga till nya m&ouml;jligheter som att komma till en speciell stad som byggts i f&ouml;rv&auml;g upp p&aring; ett speciellt s&auml;tt. F&ouml;r att kunna g&ouml;ra dessa &auml;ndringar beh&ouml;ver du kunna koda i HTML och kanske g&ouml;ra &auml;ndringar i de JavaScript som anv&auml;nds p&aring; dessa sidor. </font>			<li><font face="Comic Sans MS"><strong>askname.htm</strong> Den h&auml;r dialogen ber anv&auml;ndaren skriva in sitt namn och v&auml;lja utseende.</font>			<li><font face="Comic Sans MS"><strong>genpause.htm</strong> Den h&auml;r dialogen visas n&auml;r anv&auml;ndaren g&ouml;r en paus eller avslutar ToonTalk.</font>			<li><font face="Comic Sans MS"><strong>nosave.htm</strong> Den h&auml;r dialogen skiljer sig fr&aring;n genpause.htm eftersom den saknar m&ouml;jligheten att spara staden.</font>			<li><font face="Comic Sans MS"><strong>dempause.htm</strong> Den h&auml;r dialogen visas n&auml;r en demofilm blivit stoppad.  (G&auml;ller enbart demofilmer som gjorts i beta 35 eller version 2.52 eller senare.)</font>			<li><font face="Comic Sans MS"><strong>messbox.htm</strong> Den h&auml;r dialogen &auml;r den generella dialogen f&ouml;r att ansl&aring; meddelanden och f&ouml;r att st&auml;lla enkla Ja/Nej-fr&aring;gor eller fr&aring;gor som ska bekr&auml;ftas med OK,. </font>			<li><font face="Comic Sans MS"><strong>clickme2.htm</strong> Den h&auml;r dialogen k&ouml;rs n&auml;r CD-ROM s&auml;tts in i CD-enheten om ToonTalk har installerats. <b>clickme.htm</b>ligger p&aring; CD-ROM och k&ouml;rs om ToonTalk inte har installerats.</font>		</ul>		<p><font face="Comic Sans MS">JavaScript anv&auml;nds i alla HTML dialogsidorna. Informationen kommer till sidan via <em>window.dialogArguments</em>. detta &auml;r en rad med semikolon (';') som skiljer olika v&auml;rden &aring;t. F&ouml;r att f&aring; retur p&aring; informationen till ToonTalk beh&ouml;ver de skicka en rad tillbaka som v&auml;rdet i <em>window.returnValue</em> och sen beh&ouml;ver du avsluta med <em>window.close()</em>. Den rad du skickar tillbaka till ToonTalk m&aring;ste vara en korrekt  <a href="command.htm#HTMLDialogs">kommandorad</a>.</font></p>		<p><font face="Comic Sans MS">L&auml;gg m&auml;rke till att om du skapar en speciell dialogsida och ger den namnet vadsomhelst.html.tt eller vadsomhelst.htm.tt ( d&auml;r &quot;vadsomhelst&quot; kan var vilket anv&auml;ndbartnamn som helst) d&aring; kommer Start ToonTalk starta med den sidan om man dubbelklickar p&aring; filen.</font></p>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>