<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>Att installera ToonTalk-till&auml;gg</title>		<meta name="Generator" content="Microsoft Word 97">		<meta name="Version" content="8.0.4308">		<meta name="Date" content="7/8/97">		<meta name="Template" content="C:\Program Files\Microsoft Office\Office\HTML.DOT">	</head>	<body text="black" link="blue" vlink="purple" bgcolor="white">		<center>			<font size="5" face="Comic Sans MS"><b>Att installera ToonTalk-till&auml;gg</b></font></center>		<center>			<p><font face="Comic Sans MS"><i>Enbart f&ouml;r avancerade anv&auml;ndare:</i></font></p>		</center>		<p><a href="extend.htm"><font face="Comic Sans MS">ToonTalk-till&auml;gg</font></a><font face="Comic Sans MS"> installeras inte som standard. En anledning till detta &auml;r att de g&ouml;r det m&ouml;jligt f&ouml;r robotar att &auml;ndra p&aring; saker utanf&ouml;r ToonTalks s&auml;kra v&auml;rld. <a href="extend.htm#FileExtension">Arkiv-till&auml;gget</a> t ex, till&aring;ter ToonTalks robotar att l&auml;sa och skriva (eller radera) vilken fil som helst i din dator. Det h&auml;r &auml;r en styrka som kan anv&auml;ndas b&aring;de till gott och till ont. Om du installerar detta till&auml;gg, var d&aring; s&auml;ker p&aring; att du kan lita p&aring; de m&auml;nniskor som ger dig ToonTalk-program att k&ouml;ra p&aring; din dator.</font></p>		<p><font face="Comic Sans MS">.&Auml;ven om DLL-filen finns tillg&auml;nglig laddas den in automatiskt enbart om <a href="ttini.htm#AskBeforeForeignBirdsLoadDLL" name="AskBeforeForeignBirdsLoadDLL"><b>AskBeforeForeignBirdsLoadDLL</b></a> &auml;r satt till 0.</font></p>		<p><font face="Comic Sans MS">Ett till&auml;gg installeras om DLL-filen b&ouml;rjar med &quot;TT&quot; f&ouml;ljt av namnet p&aring; till&auml;gget i ToonTalk-katalogen. Till exempel till&auml;ggsfilen &auml;r &quot;TTFile.dll&quot;. F&ouml;r att installera till&auml;gget kopiera helt enkelt TTFile.dll fr&aring;n ToonTalk\Extend till ToonTalk.</font></p>		<p><font face="Comic Sans MS">Om du g&ouml;r installationen fr&aring;n en CDROM, v&auml;lj d&aring; &quot;Anpassad installation&quot;. Du ska ta bort alla kryss utom de som st&aring;r vid beteckningar p&aring; de till&auml;gg du vill ha.</font></p>		<p><font face="Comic Sans MS">If you are installing from a CDROM, then choose the &quot;Custom Installation&quot; option. Select &quot;Program Files&quot; and click on the &quot;change&quot; button. You should then remove check marks from every component except the ones that are labeled with the extensions you desire. Alternatively copy the appropriate files from the \toontalk\extend subdirectory.</font></p>		<p><font face="Comic Sans MS">Om du g&ouml;r installationen fr&aring;n Internet, ladda d&aring; ner <a href="ftp://ftp.toontalk.com/ftp/Beta11/ttfile.dll">ttfile.dll</a> och k&ouml;r den f&ouml;r att installera Arkiv-till&auml;gget.</font></p>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>