<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Template" content="C:\Program Files\Microsoft Office\Office\HTML.DOT">
<meta name="GENERATOR" content="Microsoft FrontPage 5.0">
<title>Vanliga fr&aring;gor om ToonTalk</title>
</head>

<body link="#0000FF" vlink="#800080">

<p align="center"><font size="5" face="Comic Sans MS"><b>Vanliga fr&aring;gor om ToonTalk </b></font><OBJECT id=AgentControl codeBase=#VERSION=2,0,0,0 classid=clsid:D45FD31B-5C6E-11D1-9EC1-00C04FD7081F VIEWASTEXT></OBJECT>

<SCRIPT language=javascript src="../agent.js"></SCRIPT>
<SCRIPT language=javascript src="strings.js"></SCRIPT>
<SCRIPT language=JavaScript event="Click(CharacterID, Button, Shift, X, Y)" for=AgentControl> 

<!-- 

reactToAgentClicked(CharacterID, Button, Shift, X, Y); 

--> </SCRIPT><SCRIPT language=JavaScript event=IdleStart(CharacterID) for=AgentControl> 

<!-- 

idleAgent(CharacterID); 

--> 

</SCRIPT>
<INPUT onclick=agentStart() type=image alt="Peedy can read this page for you." src="../reading.gif" name=Image1 width="58" height="51"><br>
			<font face="Comic Sans MS" size="3">Vissa komplicerade fr&aring;gor har l&auml;mnats i engelsk version.</font> </p>
<font face="Comic Sans MS" size="4">

<p></font><font face="Comic Sans MS" size="3"><a href="#question1">Fr&aring;ga #1</a>: Jag tror inte ToonTalk fungerar som det ska. Vad kan jag g&ouml;ra?</font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question2">Fr&aring;ga #2</a>: Kan jag f&aring; en f&ouml;rklaring p&aring; hur man g&ouml;r en DO LOOP (f&aring; n&aring;got att upprepas) med ToonTalk?</font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question3">Fr&aring;ga #3</a>: Jag vill kunna anv&auml;nda ToonTalk men jag &auml;r synskadad. N&aring;gra f&ouml;rslag?</font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question4">Fr&aring;ga #4</a>: Vad &auml;r det f&ouml;r skillnad mellan att radera en siffra och att ta bort siffran helt fr&aring;n l&aring;dan i robotens  tankenbubbla?</font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question5">Fr&aring;ga #5</a>: Hur kan jag f&aring; en v&aring;g att tippa &ouml;ver &aring;t ena sidan i en robots tankebubbla och ocks&aring; ta bort korten p&aring; b&aring;da sidorna om v&aring;gen s&aring; att mitt program kommer fungera med b&aring;de siffrot och text? </font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question6">Fr&aring;ga #6</a>: Hur hoppar jag direkt till det uppdrag jag vill jobba med?</font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question7">Fr&aring;ga #7</a>: Jag vill &auml;ndra p&aring; storleken p&aring; Verktygsl&aring;dan och de andra verktygen och likas&aring; var dom ligger p&aring; golvet. Hur g&ouml;r jag det?</font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question8">Fr&aring;ga #8</a>: Hur f&aring;r jag hj&auml;lp medan jag &auml;r inne i ToonTalk?</font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question9">Fr&aring;ga #9</a>: Jag har en robot men jag vad inte vad han g&ouml;r? Hur kan jag f&aring; reda p&aring; det?</font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question10">Fr&aring;ga #10</a>: Jag vill g&ouml;ra en massa &auml;ndringar i l&aring;dan i robotens tankebubbla men den &auml;r  f&ouml;r liten att jobba med. Vad kan jag g&ouml;ra &aring;t det?</font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question11">Fr&aring;ga #11</a>: ToonTalk fr&aring;gar alltid vad jag heter n&auml;r det startar. Och programmet kommer ih&aring;g mig. Hur kommer det sig?</font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question12">Fr&aring;ga #12</a>: Jag vill att alla i klassen ska starta med en anteckningsbok och en stad som skiljer sig fr&aring;n den som kommer med ToonTalk. G&aring;r det?</font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question13">Fr&aring;ga #13</a>: Ibland tar jag bort n&aring;got fr&aring;n en anteckningsbok eller Verktygsl&aring;dan av misstag. M&aring;ste jag anv&auml;nda Dammis f&ouml;r att bli av med det?</font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question14">Fr&aring;ga #14</a>: Kan jag l&auml;ra en robot att sl&aring; ihop bilder?</font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question15">Fr&aring;ga #15</a>: Kan man ge namn till f&aring;glar? Det &auml;r sv&aring;rt att annars h&aring;lla reda p&aring; dom.</font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question16">Fr&aring;ga #16</a>: Jag vill att en robot ska b&ouml;rja jobba om n&aring;got INTE h&auml;nder.</font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question17">Fr&aring;ga #17</a>: Jag l&auml;ser att jag ska kunna &quot;l&auml;gga upp&quot; en robot. fast jag vet inte riktigt vad det inneb&auml;r och hur det ska g&aring; till.</font></p>

<p><font face="Comic Sans MS" size="3"><a href="faq.htm#question18">Fr&aring;ga #18</a>: Det verkar som att ibland, n&auml;r en robot jobbat klart, s&aring; kommer Dammis och suger upp s&aring;nt som ligger p&aring; golvet fast&auml;n roboten inte f&aring;tt l&auml;ra sig att g&ouml;ra det. Finns det en f&ouml;rklaring till att det &auml;r s&aring;?</font></p>
		<p><font face="Comic Sans MS"><i>Nedanst&aring;ende fr&aring;gor med svar &auml;r p&aring; engelska:</i></font></p>
		<p><font face="Comic Sans MS" size="3"><a href="#question19">Fr&aring;ga #19</a>: Frank fr&aring;gar. &quot;N&auml;r jag l&auml;mnar ToonTalk f&ouml;r att redigera en bild s&aring; h&auml;nder det att bilden &ouml;ppnas i min webbl&auml;sare fast&auml;n jag st&auml;llt in s&aring; att Microsoft Paint ska vara programmet som &ouml;ppnar .png-filer. Kan man ordna detta p&aring; ett smartare s&auml;tt?&quot;</font></p>
		<font face="Comic Sans MS" size="3"><a href="#question20">Fr&aring;ga #20</a>: I'm using the Touching who? sensor</font><font face="Comic Sans MS" size="3"> so my robots can respond to collisions between pictures but when a picture is touching more than one thing only one is shown. How can I get it to react to all the things it is touching?</font>
		<p><font face="Comic Sans MS" size="3"><a href="#question21">Fr&aring;ga #21</a>: Miki in
London asks, </font><font face="Comic Sans MS"><font size="4">&quot;</font><font size="3">If
you have a robot that takes the inputs x and y, can you train it to work on a condition
like 'x+y&gt;1'?&quot;</font></font></p>
		<p><font face="Comic Sans MS" size="3"><a href="#question22">Fr&aring;ga #22</a>:  </font>

<font face="Comic Sans MS" size="3">There are so many ways of saving things in 
ToonTalk. Which one should I use when?</font></p>

<p><font face="Comic Sans MS"><a href="#question23">Fr&aring;ga #23:</a> Miki asks, &quot;How
long is a piece of string? (Or rather; is there any way to get a robot to measure the
length of a text string?)&quot;</font></p>

<p><font face="Comic Sans MS"><a href="#question24">Fr&aring;ga #24:</a> Jackie writes,
&quot;Give a stack of numbers on a nest to a robot to train the robot - in the thought
bubble, the robot<br>
manipulates the stack of numbers as though it were the top number only - no stack, no
nest. If the robot takes off the top number, there's nothing underneath. This means that
you can't train the robot to manipulate any number on a stack other than the top number.
Happily, the trained robot treats a stack on a nest given to him as a stack, and removes
one number at a time, (so the demo puzzles work fine) but if you wanted to, say, train a
robot to do something different with alternating numbers on a stack on a nest, that would
not be possible.&quot;</font></p>

<p><font face="Comic Sans MS"><a href="#question25">Fr&aring;ga #25</a>: Is there a Mac or
Linux version of ToonTalk?</font></p>

<p><font face="Comic Sans MS"><a href="#question26">Fr&aring;ga #26</a>: What is the best way
to get good screen shots from ToonTalk?</font></p>

<p><font face="Comic Sans MS"><a href="#question27">Fr&aring;ga #27:</a> Why can't I hear
Marty after installing ToonTalk on Windows XP? Why doesn't ToonTalk 2 running under
Windows XP or 2000 remember what I've done in previous sessions? How do I run with 256
colors in Windows XP?</font></p>

<p><font face="Comic Sans MS"><a href="#question28">Fr&aring;ga #28:</a> Ryan asks how can I
make the animation of the explosion (found in the Pictures notebook) start over again?</font></p>

<p><font face="Comic Sans MS"><a href="#question29">Fr&aring;ga #29</a>: I noticed 
that Marty is able to say numbers even when they have hundreds or thousands of 
digits. How can I see what he is saying?</font></p>

<p><font face="Comic Sans MS"><a href="#question30">Fr&aring;ga #30</a>: Sometimes 
when I pick up a text pad and type control-c then the text ends up on the 
clipboard. Other times there is an XML encoding with my text inside. What is 
going on?</font></p>

<p><font face="Comic Sans MS"><a href="#question31">Fr&aring;ga #31</a>: I have a 
team of robots on the back of a picture that have finished working but if they 
set off a bomb they blow up the picture, how can I stop them?</font></p>

<p><font face="Comic Sans MS"><a href="#question32">Fr&aring;ga #32</a>: I keep 
forgetting which function key does what. Can you help?</font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p><small><a name="question1"></a></small><font face="Comic Sans MS" size="3"><i>Question #1: </i>Jag tror inte ToonTalk fungerar som det ska. Vad kan jag g&ouml;ra?</font></p>

<p><font face="Comic Sans MS" size="3"><i>Svar: </i><a href="trouble.htm">Klicka h&auml;r</a> f&ouml;r hj&auml;lp.</font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p><small><a name="question2"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga #2:</i> Fadia Markar i Schweiz fr&aring;gar &quot;Kan jag f&aring; en f&ouml;rklaring p&aring; hur man g&ouml;r en DO LOOP (f&aring; n&aring;got att upprepas) med ToonTalk?&quot;</font></p>

<p><font face="Comic Sans MS"><i>Svaret ges bara p&aring; engelska eftersom fr&aring;gan &auml;r ganska avancerad.</i></font></p>
		<p><font face="Comic Sans MS" size="3"><i>Answer:</i> The DO or FOR loops of ordinary
programs usually consist of 4 parts: an index variable (let's call ours &quot;i&quot;), an
increment that describes how much should be added to &quot;i&quot; (or subtracted
from &quot;i&quot; if the increment is negative), a stop condition (for example, &quot;i &lt; 
100&quot;), and a body that get run repeatedly until the stop condition is true. </font></p>
		<p><font face="Comic Sans MS" size="3">In ToonTalk, first I'd create a box with 4 holes:<br>
[i | &lt; | stop | increment]<br>
where i, stop, and increment are numbers and &quot;&lt;&quot; is a scale.&nbsp; I'd give
the box to a robot and train him to copy &quot;increment&quot; and drop it on
&quot;i&quot;.&nbsp; I'd then train him to do whatever I wanted in the &quot;body&quot; of
the loop.&nbsp; When finished training the robot I would use Dusty the Vacuum to erase
&quot;i&quot; (the number in the first hole of the box in the robot's thought bubble). </font></p>

<p><font face="Comic Sans MS" size="3">To do something after the loop terminates I would
train another robot and drop this robot on the first one so it would end up behind it in
line.&nbsp;This means the first robot will get a chance to work if the box matches. </font></p>

<p><font face="Comic Sans MS" size="3">See, for example, the <i>factorial</i> example in
the <i>Examples</i> notebook.</font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p><small><a name="question3"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga #3:</i> Jag vill kunna anv&auml;nda ToonTalk men jag &auml;r synskadad. N&aring;gra f&ouml;rslag? </font></p>

<p><font face="Comic Sans MS" size="3"><i>Svar:</i> <a href="visualim.htm">Klicka h&auml;r</a> f&ouml;r tips om hur du kan anpassa ToonTalk s&aring; att det underl&auml;ttar.</font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p><small><a name="question4"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga #4: </i>Vad &auml;r det f&ouml;r skillnad mellan att radera en siffra och att ta bort siffran helt fr&aring;n l&aring;dan i robotens  tankenbubbla?</font></p>

<p><font face="Comic Sans MS" size="3"><i>Svar: </i>Huvudrregeln f&ouml;r  robotens tankebubbla &auml;r att den ska inneh&aring;lla en l&aring;da som roboten vill jobba med. Om l&aring;dan inneh&aring;ller mera detaljer &auml;r han blivit l&auml;rd s&aring; &auml;r det  OK. S&aring; om man rensar en siffra s&aring; inneb&auml;r det att roboten nu n&ouml;jer sig med vilken siffra som helst p&aring; det sifferkort som rensats. Om man d&auml;remot tar bort hela sifferkortet fr&aring;n det facket i l&aring;dan s&aring; kommer han jobba med det som l&auml;ggs d&auml;r i st&auml;llet f&ouml;r sifferkortet (&auml;ven testkort eller en annan l&aring;da).</font></p>
		<p><font face="Comic Sans MS" size="3">Nedanst&aring;ende beh&aring;lls p&aring; engelska:<br>
				Erasing a number is a way of expressing what computer programmers call a type test. A good ToonTalk programming style is to erase as little as possible to make the robot work in all the situations you want him to.</font></p>
		<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p><small><a name="question5"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga #5:</i> Hur kan jag f&aring; en v&aring;g att tippa &ouml;ver &aring;t ena sidan i en robots tankebubbla och ocks&aring; ta bort korten p&aring; b&aring;da sidorna om v&aring;gen s&aring; att mitt program kommer fungera med b&aring;de siffrot och text?</font></p>

<p><font face="Comic Sans MS" size="3"><i>Svar: </i>Du kan ta upp och h&aring;lla i v&aring;gen och trycka p&aring; '+' elle '-' tills den lutar som du vill. V&aring;gen stannar i det l&auml;get tills du trycker p&aring; tangenten f&ouml;r mellanslag d&aring; den aktiveras.</font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p><small><a name="question6"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga #6:</i> Hur hoppar jag direkt till det uppdrag jag vill jobba med?</font></p>

<p><font face="Comic Sans MS" size="3"><i>Svar: </i>Du kan hitta mappen med uppdrag (puzzles) i den mapp d&auml;r ToonTalk installerats p&aring; din h&aring;rddisk. Klicka p&aring; det uppdragsnummer som du vill b&ouml;rja med. Om du &ouml;ppnar  loggfilen i mappen f&ouml;r anv&auml;ndare (users) i ToonTalkmappen i Mina dokument kan du se vilket uppdragsnummer som du jobbade med senast. Vissa uppdrag bygger p&aring; det du gjort i tidigare uppdrag. Om du b&ouml;rjar med ett s&aring;nt uppdrag kanske ToonTalk f&ouml;resl&aring;r att du f&aring;r b&ouml;rja med n&aring;got tidigare uppdrag. Du kan ocks&aring; trycka flera g&aring;nger efter varann p&aring; Pause-tangenten och p&aring; s&aring; vis hoppa &ouml;ver uppdrag. S</font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p><small><a name="question7"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga #7:</i> Jag vill &auml;ndra p&aring; storleken p&aring; Verktygsl&aring;dan och de andra verktygen och likas&aring; var dom ligger p&aring; golvet. Hur g&ouml;r jag det?</font></p>

<p><font face="Comic Sans MS" size="3"><i>Svar: </i>Du kan anv&auml;nda <a href="pumpy.htm">Pumpas</a> f&ouml;r att &auml;ndra storleken p&aring;  <a href="tooly.htm">Verktygsl&aring;dan</a>, <a href="wand.htm">Trollstaven</a>,
<a href="dusty.htm">Dammis</a> och din <a href="notebook.htm">anteckningsbok</a>. Du kan till och med &auml;ndra p&aring; Pumpas storlek genom att kopiera honom och anv&auml;nda kopian av Pumpas f&ouml;r att &auml;ndra p&aring; hans storlek. Det &auml;r ett bra s&auml;tt att f&aring; mera plats om du vill arbeta med sm&aring; saker. Du kan ocks&aring; ha dina verktyg vid sk&auml;rmens ena sida och ta fram dom med funktionstangenterna (F1, F2 etc). (Se <a href="keyboard.htm">kortkommandon</a>, f&ouml;r mera info.) N&auml;r du anv&auml;nt dom klart &aring;ker de tillbaka till sin ursprungliga plats. </font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p><small><a name="question8"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga #8:</i> Hur f&aring;r jag hj&auml;lp medan jag &auml;r inne i ToonTalk?</font></p>

<p><font face="Comic Sans MS" size="3"><i>Svar: </i><a href="marty.htm">Marty</a>, marsm&auml;nniskan, kommer ge dig en fullst&auml;ndig beskrivning av den sak som du h&aring;ller i eller pekar p&aring; om du kallar p&aring; honom med hj&auml;lp av F1. Att g&ouml;ra &auml;r speciellt bra n&auml;r du vill veta vad en robot &auml;r tr&auml;nad att g&ouml;ra. </font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p><small><a name="question9"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga #9:</i> Jag har en robot men jag vad inte vad han g&ouml;r? Hur kan jag f&aring; reda p&aring; det?</font></p>

<p><font face="Comic Sans MS" size="3"><i>Svar: </i>F&ouml;rutom att kalla p&aring; <a href="marty.htm">Marty</a> f&ouml;r att ber&auml;tta vad en robot &auml;r tr&auml;nad att g&ouml;ra (se ovan), s&aring; kan du anv&auml;nda <a href="wand.htm">Trollstaven</a> f&ouml;r  att f&aring; en kopia av den l&aring;da som roboten fick f&ouml;rsta g&aring;ngen den blev tr&auml;nad. Trollstavens nos ska i s&aring; fall vara inst&auml;lld  p&aring; 'O' f&ouml;r original, om detta ska fungera. Du kan anv&auml;nda Trollstaven p&aring; l&aring;dan i robotens tankebubbla och sedan ge den l&aring;dan till roboten och se vad han g&ouml;r. Om det &auml;r ett arbetslag med robotar kan du se n&auml;r laget jobbar och om du vill fokusera p&aring; en enskild robot i laget kan du bryta upp arbetslaget genom att l&aring;ta <a href="dusty.htm">Dammis</a> suga upp dom och sen spotta ut dom igen. </font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p><small><a name="question10"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga #10:</i> Jag vill g&ouml;ra en massa &auml;ndringar i l&aring;dan i robotens tankebubbla men den &auml;r f&ouml;r liten att jobba med. Vad kan jag g&ouml;ra &aring;t det?</font></p>

<p><font face="Comic Sans MS" size="3"><i>Svar: </i>Anv&auml;nd <a href="dusty.htm">Dammis</a> f&ouml;r att suga ut hela l&aring;dan ur robotens tankebubbla och l&aring;t honom sen  spotta ut den p&aring; golvet. Den kommer bli mycket st&ouml;rre och l&auml;ttare att jobba med och &auml;ndra i. Du kan ocks&aring; anv&auml;nda <a href="pumpy.htm">Pumpas</a> f&ouml;r att g&ouml;ra l&aring;dan st&ouml;rre. G&ouml;r de &auml;ndringar du vill och sl&auml;pp sedan tillbaka l&aring;dan p&aring; robotens tomma tankebubbla. Var noga med att sl&auml;ppa l&aring;dan p&aring; tankebubblan. Sl&auml;pper du l&aring;dan p&aring; roboten tror han att du vill tr&auml;na honom p&aring; nytt. </font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p><small><a name="question11"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga #11:</i> ToonTalk fr&aring;gar alltid vad jag heter n&auml;r det startar. Och programmet kommer ih&aring;g mig. Hur kommer det sig?</font></p>
		<p><font face="Comic Sans MS" size="3"><i>Svar: </i>N&auml;r du ger ditt namn till ToonTalk skapar den filer i ToonTalk-mappen som ligger i mappen Mina dokument. De filerna g&ouml;r att du inte beh&ouml;ver b&ouml;rja fr&aring;n b&ouml;rjan varje g&aring;ng du startar ToonTalk. Filerna b&ouml;rjar med det namn du gav till ToonTalk. Mellanslag f&ouml;rsvinner om du skrivit s&aring;na i namnet. Dessa filer har dina inst&auml;llningar och &auml;ndringar som du gjort i Anteckningsboken. Anv&auml;ndarfilen ( USR filen) inneh&aring;ller dina inst&auml;llningar, hur l&aring;ngt du kommit med uppdragen och   vad du gjort hittills s&aring; att Marty bara kommer med r&aring;d f&ouml;r saker du inte gjort tidigare.  Om det var l&auml;nge sedan du anv&auml;nde ToonTalk och du vill b&ouml;rja om fr&aring;n b&ouml;rjan med uppdragen d&aring; f&aring;r du antingen ge ett nytt anv&auml;ndarnamn eller ta bort USR-filen med ditt namn. Din anteckningsbok finns i en BOK.XML file. Om du gjort &auml;ndringar i din anteckningsbok som du &aring;ngrar kan ta bort eller d&ouml;pa om BOK.XML filen som har ditt namn. Om du har sparat saker i din anteckningsbok och inte vill f&ouml;rlora  dem kan du <a href="#question22">spara dem</a>. N&auml;r du sparar en stad sparas en XML.CTY fil med ditt namn. Om du ser filer som slutar med en siffra som f&ouml;ljs av XML (t ex Sally.15.xml) d&aring; inneh&aring;ller den anteckningsboken p&aring; sidan 15 i din anteckningsbok.</font></p>
		<p><font face="Comic Sans MS" size="3">Nedanst&aring;ende beh&aring;lls p&aring; engelska:<br>
				If you want someone to use ToonTalk, but not maintain any files, you can add &quot;-t 1&quot; to <a href="command.htm#TemporaryUser">the
command line</a> so that all users are treated as temporary users. If you always want to give the same name to ToonTalk and don't want to
be asked, you can </font><font face="Comic Sans MS">double click on your USR 
file.</font></p>
		<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>
		<p><small><a name="question12"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga#12:</i> Jag vill att alla i klassen ska starta med en anteckningsbok och en stad som skiljer sig fr&aring;n den som kommer med ToonTalk. G&aring;r det?</font></p>

<p><font face="Comic Sans MS" size="3"><i>Svar: </i>Ja det g&aring;r bra, <a href="../defuser.htm">l&auml;s mera h&auml;r</a>.</font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>
		<p><small><a name="question13"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga #13:</i> Ibland tar jag bort n&aring;got fr&aring;n en anteckningsbok eller Verktygsl&aring;dan av misstag. M&aring;ste jag anv&auml;nda Dammis f&ouml;r att bli av med det?</font></p>
		<p><font face="Comic Sans MS" size="3"><i>Svar: </i>Om du sl&auml;pper n&aring;got p&aring; en bunt som &auml;r av samma slag som det som ligger i bunten l&auml;ggs det tillbaka i bunten. Antag att du tar en anteckningsbok ur din anteckningsbok och sen vill l&auml;gga tillbaka den. Om anteckningsboken l&aring;g p&aring; sidan 1 fr&aring;n b&ouml;rjan d&aring; m&aring;ste du g&aring; tillbaka till sidan 1 innan du sl&auml;pper tillbaka den.<i> </i></font></p>
		<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p><small><a name="PicturesOnPictures"></a><a name="question14"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga #14:</i> Kan jag l&auml;ra en robot att sl&aring; ihop bilder?</font></p>

<p><font face="Comic Sans MS" size="3"><i>Svar: </i>I  m&aring;nga spel och bilder beh&ouml;ver man robotar som l&auml;gger ihop <a href="picture.htm">bilder</a> med andra bilder. S&aring; h&auml;r kan det g&ouml;ras. I en l&aring;da l&auml;gger du en <a href="remote.htm#RemoteLooks">en fj&auml;rr kontroll f&ouml;r hur n&aring;got ser ut</a> (i detta fallet en bakgrundsbild) och de andra facken de bilder du vill l&auml;gga till. Tr&auml;na en robot att n&auml;r han f&aring;r denna l&aring;da ska han kopiera en av bilderna och v&auml;nda den. Ta ut de fj&auml;rrkontroller du beh&ouml;ver ur anteckningsboken f&ouml;r den nya  bilden (till exempel fj&auml;rrkontrollerna f&ouml;r l&auml;ge och storlek). v&auml;nd tillbaka bilden och sl&auml;pp den p&aring; fj&auml;rrkontrollen f&ouml;r hur bakgrundsbilden ser ut. Tr&auml;na sen roboten att &auml;ndra p&aring; fj&auml;rrkontrollerna som du vill arbeta med (l&auml;ge och storlek).  Vill du sen att denna robot ska kunna arbeta med vilka bilder som helst s&aring; f&aring;r du ta <a href="dusty.htm">Dammis</a> och rensa n&aring;gra bilder i l&aring;dan som ligger i hans tankebubbla.</font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p><small><a name="question15"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga #15:</i> Lulu i London fr&aring;gar &quot;Kan man ge namn till f&aring;glar? Det &auml;r sv&aring;rt att annars h&aring;lla reda p&aring; dom.&quot;</font></p>

<p><font face="Comic Sans MS" size="3"><i>Svar:</i> H&aring;ll i  f&aring;geln och du kan d&aring; skriva hans namn eller en kort beskrivning. G&ouml;r du s&aring; med ett bo som har ett &auml;gg s&aring; kommer b&aring;de f&aring;geln som  kl&auml;cks ur &auml;gget och boet f&aring; samma namn.  Om du vill l&auml;gga in en bild i st&auml;llet f&ouml;r text ska du ta  Pumpas och g&ouml;ra <a href="bird.htm">f&aring;geln</a> j&auml;ttestor och sl&auml;ppa en bild p&aring; f&aring;gelns tr&ouml;ja. Om bilden l&auml;gger sig utanf&ouml;r tr&ouml;jan s&aring; kommer  f&aring;geln tro att bilden &auml;r n&aring;got som den  ska l&auml;gga i sitt bo. Om den hamnar bara p&aring; hennes tr&ouml;ja och inte utanf&ouml;r s&aring; l&auml;ggs den till p&aring; tr&ouml;jan. Man kan ocks&aring; l&auml;gga f&aring;glar och f&aring;gelbon i l&aring;dor och skriva etiketter p&aring; l&aring;dorna f&ouml;r att h&aring;lla reda p&aring; dem.</font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>
		<p><small><a name="question16"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga #16:</i> Jag vill att en robot ska b&ouml;rja jobba om n&aring;got INTE h&auml;nder.</font></p>
		<p><font face="Comic Sans MS" size="3">Nedanst&aring;ende beh&aring;lls p&aring; engelska:<br>
				<i>Svar:</i> Since a robot will only 
run if the robots before him have rejected the box, you can make a robot that 
checks the positive version of your condition. This &quot;dummy&quot; robot is trained to 
do nothing. Erase the conditions from your robot and place it behind the dummy 
robot. Then it'll run only if the conditions of the dummy robot are not true. 
Alternative that works when you want a robot to run if two numbers or text pads 
are not equal is to use scales in the thought bubble. After training your robot 
copy it and and edit the thought bubbles so that one copy has the scale tilting 
to the left and the other one tilting to the right. </font></p>
		<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p><small><a name="question17"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga #17:</i> Tyler Breisacher skriver &quot;Jag l&auml;ser att jag ska kunna &quot;l&auml;gga upp&quot; en robot. Fast jag vet inte riktigt vad det inneb&auml;r och hur det ska g&aring; till. &quot;</font></p>

<p><font face="Comic Sans MS" size="3"><i>Svar: </i><a href="contribp.htm">Klicka  h&auml;r</a>.</font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p><small><a name="question18"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga #18:</i> Ben och Ivan Filippenko fr&aring;gar &quot;Det verkar som att ibland n&auml;r en robot jobbat klart, s&aring; kommer Dammis och suger upp s&aring;nt som ligger p&aring; golvet fast&auml;n roboten inte f&aring;tt l&auml;ra sig att g&ouml;ra det. Finns det en f&ouml;rklaring till att det &auml;r s&aring;?&quot;</font></p>

<p><font face="Comic Sans MS" size="3">Resten av svaren nedan beh&aring;lls p&aring; engelska:<br>
				<i>Svar: </i>Robots do clean up after themselves
whether trained to or not. Besides keeping things tidy, this enforces a good programming
practice. When a robot uses the floor, this is like using &quot;local variables&quot; in
conventional programming languages. And as with such languages there is an automatic
recycling of the memory used for local variables when exiting that part of the program.
If a robot was holding Dusty the Vacuum when you
finished training him he will not automatically clean up. This is a good way to program
robots to fill new houses with things.</font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p><small><a name="question19"></a></small><font face="Comic Sans MS" size="3"><i>Fr&aring;ga</i><em> #19:</em> Frank fr&aring;gar. &quot;N&auml;r jag l&auml;mnar ToonTalk f&ouml;r att redigera en bild s&aring; h&auml;nder det att bilden &ouml;ppnas i min webbl&auml;sare fast&auml;n jag st&auml;llt in s&aring; att Microsoft Paint ska vara programmet som &ouml;ppnar .png-filer. Kan man ordna detta p&aring; ett smartare s&auml;tt?&quot;</font></p>

<p><font face="Comic Sans MS" size="3">Nedanst&aring;ende beh&aring;lls p&aring; engelska:<br>
				<i>Svar</i><em>:</em> If you edit
<a href="ttini.htm#PictureEditor">PictureEditor</a> to have the value &quot;mspaint.exe&quot;, 
it should fix this problem. This isn't set as the default because on some 
versions of Windows Microsoft Paint can't edit PNG picture files.</font></p>
		<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>
		<p align="left"><a name="question20"><font size="3" face="Comic Sans MS"><em>Q</em></font></a><a name="question20"><font face="Comic Sans MS" size="3"><em>uestion 20:</em> I'm using the Touching Who? sensor so my robots can respond to collisions between pictures but when a picture is touching more than one thing only one is shown. How can I get it to react to all the things it is touching?</font></a></p>
		<p align="left"><font face="Comic Sans MS" size="3"><em>Answer:</em> The
<a href="remote.htm#TouchingWho">Touching Who</a> sensor can be vacuumed by 
Dusty, it will then show the next thing being touched if there is one. You can 
have a robot on the back of your picture that does nothing but wait for a 
picture on the Touching Who sensor and vacuums it off.</font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>
<a name="question21">

<p align="left"><font face="Comic Sans MS" size="3"><em>Question 21:</em> Miki in London
asks, </font><font face="Comic Sans MS"><font size="4">&quot;</font><font size="3">If you
have a robot that takes the inputs x and y, can you train it to work on a condition like
'x+y&gt;1'?&quot;</font></font></p>
</a>

<p align="left"><font face="Comic Sans MS" size="3"><em>Answer: </em>A single robot can't
have a complex conditional test like this. You can get a team of robots do to this. The
first robot copies x and y into a new hole that will hold x+y. Next to that hole is a
scale and next to that is a '1'. Another robot can match for the scale showing that x+y is
greater than 1. In general, that robot should then get rid of the extra box or boxes
created by the first robot.</font></p>

<p align="left"><font face="Comic Sans MS" size="3">In the field of concurrent logic
programming this issue is referred to as &quot;deep guards&quot; vs. &quot;flat
guards&quot;. A guard is equivalent to the contents of the thought bubble of a robot. Deep
guards can simplify the expression of some programs but are very hard to implement well.
The problem is that suspended processes (robots waiting for something to arrive on nests
in ToonTalk) test to see if the guard is true whenever something changes (in ToonTalk
whenever a bird covers a nest that a robot is waiting on). If the guard is deep this could
mean a large computation is needlessly recomputed.</font></p>

<p align="left"><font face="Comic Sans MS" size="3">In ToonTalk there is another reason to
avoid deep guards - the expression of conditionals in ToonTalk is visual. A robot accepts
a box if the box visually matches the box in his thought bubble. More complex conditionals
would require a more complex notion of conditionals.</font></p>

<p align="center"><small><font face="Comic Sans MS"><img src="../rainbow.gif" width="623" height="6"></font></small></p>

<p align="left"><font face="Comic Sans MS" size="3"><a name="question22"><em>Question #22:</em> There 
are so many ways of saving things in ToonTalk. Which one should I use when?</a></font></p>

<p align="left"><font face="Comic Sans MS">Answer: When you have created 
something, for example, trained a robot then dropping it on an empty page of 
your <i>main</i> notebook will save it so that it'll be there next time you run 
ToonTalk with the same user name. If you have lots of related things then you 
can put them in a box or a blank notebook and put that in the main notebook. 
Note that only things in the main notebook will be there next time you run 
ToonTalk. If you have many things on the floor or many houses that you've 
changed, then save the entire city. If you want to save something to share with 
others (or with yourself under a different user name), then pick it up and press 
the Pause button on your keyboard and choose 'Save to File' in the resulting 
dialog page. Note that if your creation includes pictures or sounds that you've 
made or imported into ToonTalk then be sure the check mark is there so the 
result includes your media files. Your creation is saved as a TT file that can 
be sent to others and brought into ToonTalk by double clicking on it or dragging 
it into ToonTalk. If you have something that doesn't include media files and you 
want to send it by email then you can type control-c and then when in your mail 
program type control-v. This is also good if you want to see how ToonTalk 
encodes your object.</font></p>

<p align="center"><font face="Comic Sans MS"><small><img src="../rainbow.gif" width="623" height="6"></small></font></p>

<p align="left"><a name="question23"><font face="Comic Sans MS"><em>Question #23:</em>
Miki asks, &quot;How long is a piece of string? (Or rather; is there any way to get a
robot to measure the length of a text string?)&quot;</font></a></p>

<p align="left"><font face="Comic Sans MS">Answer: If you drop a text pad on an erased
box, then the box changes so that there is one letter in each hole. If you then drop that
box on an erased number, the number will change to the number of holes in the box. This is a
bit wasteful since you shouldn't have to make ToonTalk create the box but this will work.</font></p>

<p align="center"><font face="Comic Sans MS"><small><img src="../rainbow.gif" width="623" height="6"></small></font></p>

<p align="left"><font face="Comic Sans MS"><a name="question24"><em>Question #24:</em>
Jackie writes, &quot;Give a stack of numbers on a nest to a robot to train the robot - in
the thought bubble, the robot
manipulates the stack of numbers as though it were the top number only - no stack, no
nest. </a>If the robot takes off the top number, there's nothing underneath. This means
that you can't train the robot to manipulate any number on a stack other than the top
number. Happily, the trained robot treats a stack on a nest given to him as a stack, and
removes one number at a time, (so the demo puzzles work fine) but if you wanted to, say,
train a robot to do something different with alternating numbers on a stack on a nest,
that would not be possible.&quot;</font></p>

<p align="left"><font face="Comic Sans MS">Answer: This  is a
deliberate design choice. Consider what would happen if when training the robot you could
remove things from a stack on a nest. Suppose you trained a robot to remove 3 numbers from
the stack. Then when the robot is running it would expect 3 items on the nest but in his
thought bubble he only checked that there was a number on top. The &quot;story&quot; here
is that when the robot is given the box with a stack of numbers on a nest, he only <em>sees</em>
the top number. So he imagines himself working on the box containing the top number only.
Robots don't have X-ray vision.</font></p>

<p align="left"><font face="Comic Sans MS">I think you are right that it is impossible to
train a robot to do something different with alternating numbers. But you can train two
robots where each one does something different with the numbers. In order to get the
robots to alternate, you'll need to make them use another box hole to contain a number or
text pad that indicates which one should run next. Then join the two robots together.</font></p>

<p align="center"><font face="Comic Sans MS"><small><img src="../rainbow.gif" width="623" height="6"></small></font></p>

<p><font face="Comic Sans MS"><a name="question25"><em>Question #25:</em></a> Is there a
Mac or Linux version of ToonTalk?</font></p>

<p align="left"><font face="Comic Sans MS"><em>Answer</em>: There are no versions of
ToonTalk that run directly on either an Apple Macintosh computer or a computer running
Linux. ToonTalk has been successfully tested on Macs running Virtual PC 4.0 and later.

ToonTalk should be able to run on Linux under a Windows emulator that can deal with
DirectX.</font></p>

<p align="center"><font face="Comic Sans MS"><small><img src="../rainbow.gif" width="623" height="6"></small></font></p>

<p align="left"><font face="Comic Sans MS"><a name="question26"><em>Question #26:</em></a>
What is the best way to get good screen shots from ToonTalk?</font></p>

<p align="left"><font face="Comic Sans MS"><em>Answer</em>: <a href="scrnshot.htm">Click
here</a>.</font></p>

<p align="center"><font face="Comic Sans MS"><small><img src="../rainbow.gif" width="623" height="6"></small></font></p>

<p align="left"><font face="Comic Sans MS"><a name="question27"><em>Question #27:</em></a>
Why can't I hear Marty after installing ToonTalk on Windows XP? Why doesn't ToonTalk 2
running under Windows XP or 2000 remember what I've done in previous sessions? How do I
run with 256 colors in Windows XP?</font></p>

<p align="left"><font face="Comic Sans MS"><em>Answer</em>: <a href="winxp.htm">Click here</a>.</font></p>

<p align="center"><font face="Comic Sans MS"><small><img src="../rainbow.gif" width="623" height="6"></small></font></p>

<p align="left"><font face="Comic Sans MS"><a name="question28"><em>Question #28:</em></a>
Ryan asks how can I make the animation of the explosion (found in the Pictures notebook)
start over again?</font></p>

<p align="left"><font face="Comic Sans MS"><i>Answer</i>: Currently the only way to reset a built-in
animation like the explosion is to set its <a href="remote.htm#WhichPicture"><em>Which
Picture?</em> sensor</a>. E.g. if you drop 1 on the sensor then it is changed but since
the only permissible value is 0 it becomes 0 again. But as a &quot;side effect&quot; of
the change the animation cycle is reset. What would be much clearer and more intuitive
would be to have the <a href="remote.htm#AnimationFinished"><em>Animation Finished?</em>
sensor</a> work as a remote control as well. This way you could change it from &quot;yes
(the animation is over)&quot; to &quot;no (it is not)&quot; and the animation would be
reset.</font></p>

<p align="center"><font face="Comic Sans MS"><small><img src="../rainbow.gif" width="623" height="6"></small></font></p>

<p align="left" dir="ltr"><font face="Comic Sans MS"><a name="question29"><i>
Question #29</i>: I noticed that Marty is able to say numbers even when they 
have hundreds or thousands of digits. How can I see what he is saying?</a></font></p>

<p align="left" dir="ltr"><font face="Comic Sans MS"><i>Answer</i>: You can take 
your number and drop it on an erased <a href="sensor.htm#TextToSpeech">
text-to-speech sound pad</a>. If you want to copy and paste the text into some 
other program then read the answer to the following question.</font></p>

<p align="center" dir="ltr"><font face="Comic Sans MS"><small>
<img src="../rainbow.gif" width="623" height="6"></small></font></p>

<p align="left" dir="ltr"><font face="Comic Sans MS"><a name="question30"><i>
Question #30</i>: Sometimes when I pick up a text pad and type control-c then 
the text ends up on the clipboard. Other times there is an XML encoding with my 
text inside. What is going on?</a></font></p>

<p align="left" dir="ltr"><font face="Comic Sans MS"><i>Answer</i>: There are two kinds 
of <a href="text.htm#FixedAndVariableWidths">text pads</a> in ToonTalk. One that 
uses a fixed with font and the other uses a variable width font. The default for 
cutting and pasting text into and out of ToonTalk is the variable text font. If 
you paste some text into ToonTalk and edit it (or erase it and drop your text on 
it) then you'll be sure that when you type control-c it'll end up on the 
clipboard as plain text. Note that if you change the color or put things on the 
back of the text pad then it'll be saved as XML regardless.</font></p>

<p align="center" dir="ltr"><font face="Comic Sans MS"><small>
<img src="../rainbow.gif" width="623" height="6"></small></font></p>

<p align="left" dir="ltr"><font face="Comic Sans MS"><a name="question31"><i>
Question #31</i>: I have a team of robots on the back of a picture that have 
finished working but if they set off a bomb they blow up the picture, how can I 
stop them?</a></font></p>

<p align="left" dir="ltr"><font face="Comic Sans MS"><i>Answer</i>: If a robot 
vacuums up the box he's working on then the team will stop for good. If this 
happens on the back of a picture ToonTalk tidies up and removes the team as 
well.</font></p>

<p align="center" dir="ltr"><font face="Comic Sans MS"><small>
<img src="../rainbow.gif" width="623" height="6"></small></font></p>

<p align="left" dir="ltr"><font face="Comic Sans MS"><a name="question32"><i>
Question #32</i>: I keep forgetting which function key does what. Can you help?</a></font></p>

<p align="left" dir="ltr"><font face="Comic Sans MS"><i>Answer</i>: You can 
press F10 to see what the function keys do. Pressing F10 again will remove the 
help on the screen. Or you can <a href="http://www.toontalk.com/English/function_key_help.doc">print</a> (and laminate) this 
and put it on your keyboard.</font></p>

<p>&nbsp;</p>

<p id="DontRead" align="center"><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></p>

</body>
</html>