<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>Fixa Problem med Java Applets gjorda av ToonTalk</title>		<meta name="GENERATOR" content="Microsoft FrontPage 3.0">	</head>	<body bgcolor="white">		<center>			<font face="Comic Sans MS" size="4"><strong>Fixa Problem med Java Applets gjorda av ToonTalk</strong></font></center>		<div align="left">			<p><font face="Comic Sans MS" size="4">L&auml;ser du detta i en fil p&aring; din h&aring;rddisk kan du se den senaste versionen p&aring; n&auml;tet genom att <a href="http://www.toontalk.com/English/javaprob.htm">klicka h&auml;r</a>.</font></p>		</div>		<div align="left">			<p><font face="Comic Sans MS">Mycket kan g&aring; snett n&auml;r man skapar <a href="java.htm">Java applets</a>.</font></p>		</div>		<ol>			<li>			<div align="left">				<p><font face="Comic Sans MS"><strong>Du ser webbsidan men den saknar 'Start'- och 'Stop'-knappar.</strong> Detta betyder att den java som skapas av ToonTalk inte kompilerar. Om du programmerar i Java kan du se felmeddelanden genom att k&ouml;ra javashow i ToonTalks Java-mapp. Rapportera g&auml;rna s&aring;dana problem till <a href="mailto:support@toontalk.com">support@toontalk.com</a>. Skicka med denToonTalk-sak som skulle sparas i  Java genom att trycka control-c medan du h&aring;ller i saken och klistra sedan in den i din epostrapport.</font></p>			</div>			<li>			<div align="left">				<p><font face="Comic Sans MS"><strong>Java applet stannar n&auml;r du tryckt p&aring; 'Start'-knappen. </strong>Det finns exempel p&aring; att detta h&auml;nt i en viss webbl&auml;sare och ett visst operativsystem men fungerat i andra. Prova i andra webbl&auml;sare. Rapportera i  vilket fall som helst g&auml;rna till <a href="mailto:support@toontalk.com">support@toontalk.com</a>. Om du kan, skicka i form av en javalog.txt file eller i Java console. N&auml;r man f&ouml;r musmark&ouml;ren &ouml;ver en applet kan webbl&auml;saren ibland visa ett felmeddelande i statusraden.</font></p>			</div>			<li>			<div align="left">				<p><font face="Comic Sans MS"><strong>Java applet k&ouml;rs men bilderna visas bara som'?' och vissa ljud h&ouml;rs inte.</strong> Om du anv&auml;nder egna bilder i ToonTalk s&aring; kr&auml;ver Java att de &auml;r i  GIF eller JPG. Skulle bilderna vara i BMP finns det hundratals bildprogram som kan konvertera bilden och spara den som GIF eller JPG och spara i samma mapp eller enligt <a href="ttini.htm#FileSearchPath">s&ouml;kv&auml;gen</a>. JPG brukar vara b&auml;ttre f&ouml;r foton och GIF f&ouml;r bilder som ska ha partier som &auml;r genomskinliga.</font></p>			</div>			<li>			<div align="left">				<p><font face="Comic Sans MS"><strong>Java applet k&ouml;rs men det &auml;r en gammal applet</strong>, inte den som ToonTalk skapade. Om du k&ouml;r Internet Explorer prova med att h&aring;lla ner ctrl-tangenten och samtidigt trycka p&aring; knappen f&ouml;r Uppdatera.</font></p>			</div>			<li>			<div align="left">				<p><font face="Comic Sans MS"><strong>Java applet k&ouml;rs men den slutar h&auml;nga med musr&ouml;relserna. </strong> Java applets kan inte k&ouml;ra musr&ouml;relser s&aring; ibland slutar ToonTalk-spel som anv&auml;nder musen att fungera n&auml;r de k&ouml;rs i Java. Problemet best&aring;r i att musen har hamnat utanf&ouml;r spelplanen. Du kan flytta tillbaka den och ordna upp det hela. Ofta vill man flytta musen undertill och komma tillbaka fr&aring;n en annan  sida. Rekommendationen &auml;r att spelen anv&auml;nder musr&ouml;relser eller tangentstyrda kommandon f&ouml;r att undvika problemet.</font></p>			</div>			<li>			<div align="left">				<p><font face="Comic Sans MS"><strong>Netscape 6 visar spelet i konstiga  f&auml;rger och det g&aring;r v&auml;ldigt l&aring;ngsamt.  </strong>Detta har bara observerats n&auml;r Windows k&ouml;rts i 256 f&auml;rger. &Auml;ndra till 16-bitars, 24-bitars, eller 32-bitars f&auml;rger s&aring; l&ouml;ser det problemet.</font></p>			</div>			<li>			<div align="left">				<p><font face="Comic Sans MS"><strong>Java applet g&aring;r bra men vissa ljud h&ouml;rs inte.</strong> H&ouml;r du inte n&aring;got ljud &auml;r chansen stor att det &auml;r n&aring;got annat program,  kanske ToonTalk, som h&aring;ller filen i ljudsystemet. Om programmet som h&aring;ller ljudet avslutas, kan det l&ouml;sa problemet.<br>				En annan t&auml;nkbar orsak &auml;r att ljudfilen saknas eller &auml;r i fel format. De flesta webbl&auml;sare kan bara l&auml;sa AU-filer som &auml;r samplade i 8012 hertz. (Netscape 6 &auml;r uppenbarligen inte s&aring; kinkig.) Det finns m&aring;nga program kan l&auml;sa en WAV-fil och g&ouml;ra den till r&auml;tt sort.</font></p>			</div>			<li>			<div align="left">				<p><font face="Comic Sans MS" size="3"><strong>Webbl&auml;saren h&auml;nger sig eller l&auml;mnar felmeddelande.</strong> Vissa versioner av Microsoft Internet Explorer (version 4.0 SP1 - Windows 98 och vissa versioner av 5.0 likas&aring;) visar &quot;Invalid Page Fault&quot; den ska k&ouml;ra en ToonTalk Java applet.<br>				F&ouml;r att komma f&ouml;rbi detta problem kan du skaffa en nyare version av webbl&auml;saren. Denna bugg i Internet Explorer &auml;r borta i version 5.5 och senare.</font></p>			</div>			<li>			<div align="left">				<p><font face="Comic Sans MS" size="3"><strong>Du ser ett meddelande om att det &auml;r ett s&auml;kerhetsproblem att anv&auml;nda BMP-filer. </strong>Detta betyder att Java anv&auml;nder BMP-filer eftersom GIF-filerna saknas. Javaprogrammet kommer &auml;nd&aring; k&ouml;ras. Vill du att det ska fungera i en webbl&auml;sare f&aring;r du skapa GIF-filerna och g&ouml;ra om applet. </font></p>			</ol>			<p><font face="Comic Sans MS">Vill du l&auml;gga upp Java applets fr&aring;n ToonTalk p&aring; en webbserver kan du koiera filerna i Java-mappen i ToonTalk-mappen till webbservern. system.zip och javashow.bat beh&ouml;ver inte kopieras. Du kan avg&ouml;ra vilka   class filer som beh&ouml;vs genom att se p&aring; tiden n&auml;r de skapades eller genom att kolla k&auml;llfilen.  Fr&aring;n  version 2.35 or beta 27 kommer din loggfil (i Users-mappen i ToonTalk med ditt namn f&ouml;ljt av &quot;.txt&quot;) att lista ljud och bilder som applet anv&auml;nder.</font></p>		</div>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>