<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>ToonTalk kan g&ouml;ra en Java applet fr&aring;n ett ToonTalk program.</title>		<meta name="generator" content="GoLive CyberStudio">		<meta name="Template" content="C:\PROGRAM FILES\MICROSOFT OFFICE\OFFICE\html.dot">	</head>	<body link="blue" vlink="purple" bgcolor="white">		<center>			<font size="4" face="Comic Sans MS"><b>ToonTalk och Java</b></font></center>		<p><font face="Comic Sans MS">ToonTalk kan g&ouml;ra en Java applet fr&aring;n ett ToonTalk program. </font></p>		<p><font face="Comic Sans MS">F&ouml;r att &ouml;vers&auml;tta n&aring;got till en Java applet ska man plocka upp det, trycka p&aring; pause-tangenten och sedan klicka p&aring; &quot;Komma tillbaka senare&quot;. Det du gjort d&aring; &auml;r, att du flyttat det fr&aring;n ToonTalk in i Windows. Om allt fungerar ska en webbl&auml;sare &ouml;ppnas automatiskt och du kommer att f&aring; se ditt program bli uppspelat. F&ouml;r att du sj&auml;lv ska kunna prova detta kan du g&aring; till anteckningsboken och sl&aring; upp sidan 6, anteckningsboken f&ouml;r exempel, och p&aring; sidan 2 plocka upp roboten som hela tiden l&auml;gger till 1. Tryck p&aring; pause-tangenten och klicka p&aring; &quot;Komma tillbaka senare&quot;. N&auml;r din applet dyker upp i din webbl&auml;sare, klicka p&aring; &quot;Start&quot; och du kan se hur siffrorna blir st&ouml;rre. Det &auml;r bara robotar, lastbilar och bilder som kan skapa en Java applet om de plockas upp medan ToonTalk stannas. En robot kommer k&ouml;ras med en l&aring;da som &auml;r likadan som den han tr&auml;nades med. N&auml;r du laddar upp en lastbil beh&ouml;ver du kanske trycka p&aring; F8 f&ouml;r att hindra den fr&aring;n att k&ouml;ra bort. Du kan l&auml;gga ett textkort i lastbilen f&ouml;r att ge den ett namn. Om du vill att dina robotar ska anv&auml;nda en speciell anteckningsbok m&aring;ste du l&auml;gga en kopia av den anteckningsboken i lastbilen. F&ouml;r att ge ett namn till en applet som skapats av en bild (med robotar p&aring; baksidan) l&auml;gger du bara ett textkort p&aring; bildens baksida.</font></p>		<p><font face="Comic Sans MS">En applet kan be anv&auml;ndaren att l&auml;gga in v&auml;rden. Anta att du &ouml;vers&auml;tter n&aring;got till Java med ett <a href="bird.htm">f&aring;gelbo</a> i en <a href="box.htm">l&aring;da</a> (och <a href="bird.htm">f&aring;geln</a> som tillh&ouml;r det boet inte blir &ouml;versatt till Java) och du har satt en etikett under facket i l&aring;dan. N&auml;r d&aring; denna Java applet beh&ouml;ver ett v&auml;rde och hittar f&aring;gelboet kommer den att be anv&auml;ndaren om ett v&auml;rde genom att skriva etiketten. P&aring; samma s&auml;tt &auml;r det med en f&aring;gel som &auml;r i ett fack med etikett och som f&aring;r n&aring;got. D&aring; skrivs etiketten med en beskrivning av den sak f&aring;geln f&aring;tt. Tanken &auml;r att f&aring;glar och bon anv&auml;nds f&ouml;r meddelanden, i b&auml;gge riktningarna, mellan anv&auml;ndaren och den Java applet som &auml;r aktuell.</font></p>		<p><font face="Comic Sans MS">Denna m&ouml;jlighet kr&auml;ver en webbl&auml;sare som klarar Java, t ex Microsoft Internet Explorer 4.0 (som finns p&aring; ToonTalk CD-ROM eller kan laddas ner fr&aring;n <a href="http://www.microsoft.com/ie">www.microsoft.com/ie</a>) och Netscape Navigator 4.0 (som kan laddas ner fr&aring;n <a href="http://www.netscape.com/">www.netscape.com</a>).</font></p>		<p><a href="javaprob.htm"><font face="Comic Sans MS">Klicka h&auml;r</font></a><font face="Comic Sans MS"> f&ouml;r l&ouml;sningar p&aring; problem med Java applets.</font></p>		<p><font face="Comic Sans MS">F&ouml;r att k&ouml;ra och se n&aring;gra demon av program som &ouml;versatts fr&aring;n ToonTalk till Java, <a href="http://www.toontalk.com/English/javademo.htm">klicka h&auml;r </a>.</font></p>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>