<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>Joystick-sensorer i ToonTalk</title>		<meta name="Version" content="8.0.4308">		<meta name="Date" content="7/8/97">		<meta name="Template" content="C:\PROGRAM FILES\MICROSOFT OFFICE\OFFICE\html.dot">		<meta name="GENERATOR" content="Microsoft FrontSidan 3.0">	</head>	<body bgcolor="white" text="black">		<center>			<font size="5" face="Comic Sans MS"><b>Joystick-sensorer i ToonTalk</b></font></center>		<p><font face="Comic Sans MS" size="3">Har du en joystick kopplad till datorn hittar du en <a href="sensor.htm#Joysticks">anteckningsbok f&ouml;r joystick-sensorer</a> f&ouml;r varje joystick du har inkopplad. Sensorerna &auml;r :</font></p>		<ul>			<li><font face="Comic Sans MS" size="3">Sidan 2. <b>Joystick X hastighet</b>. Denna sensor visar hur l&aring;ngt till v&auml;nster eller h&ouml;ger som din joystick har kommit. Fr&aring;n -1000 till 1000. </font>			<li><font face="Comic Sans MS" size="3">Sidan 4. <b>Joystick Y hastighet</b>. Denna sensor visar hur l&aring;ngt fram&aring;t eller tillbaka din joystick har kommit. Fr&aring;n -1000 till 1000. </font>			<li><font face="Comic Sans MS" size="3">Sidan 6. <b>Joystick Z hastighet</b>. Denna sensor visar hur l&aring;ngt upp eller ner din joystick har kommit. Ofta samma sak som gaspedal. Saknar din joystick detta &auml;r v&auml;rdet 0,  Fr&aring;n -1000 till 1000. </font>			<li><font face="Comic Sans MS" size="3">Sidan 8<b>. Joystick X-axel</b>. Denna sensor visar hur mycket din joystick roterat till v&auml;nster eller till h&ouml;ger. Saknar din joystick detta &auml;r v&auml;rdet 0, Fr&aring;n -1000 till 1000. </font>			<li><font face="Comic Sans MS" size="3">Sidan 10<b>. Joystick Y-axel</b>. Denna sensor visar hur  mycket din joystick roterat fram&aring;t eller tillbaka. Saknar din joystick detta &auml;r v&auml;rdet 0, Fr&aring;n -1000 till 1000. </font>			<li><font face="Comic Sans MS" size="3">Sidan 12<b>. Joystick Z-axel</b>. Denna sensor visar hurmycket din joystick roterat  upp eller ner. Kallas ofta roder. Saknar din joystick detta &auml;r v&auml;rdet 0, Fr&aring;n -1000 till 1000. </font>			<li><font face="Comic Sans MS" size="3">Sidan 14. <b>Joystick-knappar som tryckts</b>. ToonTalk kan k&auml;nna av upp till 32 joystick-knappar. N&auml;r en knapp tryckts blir v&auml;rdet &quot;Ja&quot; mycket kort tid. Annars &auml;r det &quot;Nej&quot;. </font>			<li><font face="Comic Sans MS" size="3">Sidan 16. <b>Joystick-knappar som &auml;r nertryckta</b>. Visar &quot;Ja&quot; om den aktuella knappen &auml;r nertryckt och i annat fall visar sensorn &quot;Nej&quot;.</font>		</ul>		<p><font face="Comic Sans MS" size="3">Har du en force feedback joystick, skapas <a href="force.htm">en speciell anteckningsbok f&ouml;r att skapa och st&auml;lla in effekter f&ouml;r olika krafter</a>.</font></p>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>