<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>Snabbkommandon f&ouml;r ToonTalk</title>		<meta name="Generator" content="Microsoft Word 97">		<meta name="Template" content="C:\PROGRAM FILES\MICROSOFT OFFICE\OFFICE\html.dot">	</head>	<body text="black" link="blue" vlink="purple" bgcolor="white">		<center>			<font size="4" face="Comic Sans MS"><b>ToonTalks tangentbord</b></font></center>		<p><font face="Comic Sans MS">Du beh&ouml;ver inte l&auml;gga alla de f&ouml;ljande snabbkommandona p&aring; minnet. Det allra mesta kan du g&ouml;ra med musen och mellanslag. M&aring;nga av dessa snabbkommandon &auml;r bara till f&ouml;r att g&ouml;ra det snabbare.</font></p>		<p><font face="Comic Sans MS"><b>N&auml;r programmet b&ouml;rjar:</b></font></p>		<p><font face="Comic Sans MS">Tryck p&aring; valfri tangent f&ouml;r att g&aring; till n&auml;sta sk&auml;rmbild. 'Esc' g&ouml;r att du hoppar &ouml;ver inledningen.</font></p>		<p><font face="Comic Sans MS"><b>N&auml;r du spelar en demo:</b></font></p>		<p><font face="Comic Sans MS">Om du trycker p&aring; en valfri tangent, g&ouml;r ToonTalk en paus och ger dig m&ouml;jlighet att v&auml;lja att avsluta, spela sj&auml;lv eller g&aring; tillbaka till demon.</font></p>		<p><font face="Comic Sans MS"><b>Att flyga, g&aring; eller att vara p&aring; golvet:</b></font></p>		<p><font face="Comic Sans MS">Tryck p&aring; piltangenterna f&ouml;r att g&aring; i vilken som helst av 8 riktningar. (P&aring; en del tangentbord har bara 4 piltangenter en p&aring;skrift. Det st&aring;r <i>Home</i>, <i>Page Up</i>, <i>Page Down</i>, och <i>End</i> och dom kan anv&auml;ndas f&ouml;r g&aring; diagonalt. Du kan h&aring;lla ner dom f&ouml;r att forts&auml;tta att g&aring; i den riktningen. Du kan till och med h&aring;lla ner tv&aring; samtidigt och g&aring; &aring;t b&auml;gge h&aring;llen.</font></p>		<p><font face="Comic Sans MS">Om du trycker Pil upp och Pil h&ouml;ger samtidigt g&aring;r du snett upp&aring;t till h&ouml;ger. Om du trycker Pil ner och Pil v&auml;nster samtidigt g&aring;r du snett ner&aring;t till v&auml;nster.</font></p>		<p><font face="Comic Sans MS">Tryck p&aring; Pause f&ouml;r att stoppa ToonTalk och f&aring; m&ouml;jlighet att v&auml;lja avsluta, komma igen senare eller forts&auml;tta ToonTalk.</font></p>		<p><font face="Comic Sans MS">Tryck F7 f&ouml;r att snabba p&aring; det som h&auml;nder p&aring; sk&auml;rmen.</font></p>		<p><font face="Comic Sans MS">Tryck F8 f&ouml;r att st&auml;nga av alla <a href="robot.htm">robotar</a> och <a href="picture.htm">r&ouml;rliga bilder</a> i hela staden. Trycker du F8 igen s&aring; s&auml;tts dom ig&aring;ng.</font></p>		<p><font face="Comic Sans MS">Tryck F11 f&ouml;r att spara en bild av det du ser p&aring; sk&auml;rmen. Du hittar bilden i den katalog som hetere ToonTalk frm1234.bmp. 1234 &auml;r numret p&aring; den ruta du tog bilden av.</font></p>		<p><font face="Comic Sans MS">Tryck F12 f&ouml;r att ta en bild av sk&auml;rmen och spara i Windows Urklipp.</font></p>		<p><font face="Comic Sans MS">PageDown-knappen g&ouml;r att <a href="marty.htm">Marty</a> g&aring;r vidare med n&auml;sta sak han har att ber&auml;tta.</font></p>		<p><font face="Comic Sans MS">PageUp-knappen f&aring;r Marty att upprepa det senaste han sa.</font></p>		<p><font face="Comic Sans MS"><b><a name="Helicopter"></a>Att flyga och landa:</b></font></p>		<p><font face="Comic Sans MS">Tryck u eller U f&ouml;r att flyga <u>u</u>pp (h&ouml;gre). Det g&aring;r bra att h&aring;lla ner den h&ouml;gra musknappen ocks&aring;.</font></p>		<p><font face="Comic Sans MS">Tryck d eller D f&ouml;r att <u>d</u>ala ner (mot marken). Det g&aring;r bra att h&aring;lla ner den v&auml;nstra musknappen ocks&aring;.</font></p>		<p><font face="Comic Sans MS"><b>Att g&aring; utomhus:</b></font></p>		<p><font face="Comic Sans MS">Tryck F1, h eller H f&ouml;r att f&aring; <u>h</u>elikoptern dit du &auml;r.</font></p>		<p><font face="Comic Sans MS"><b><a name="InRoom"></a>Att g&aring; inomhus</b></font></p>		<p><font face="Comic Sans MS">Tryck p&aring; valfri tangent f&ouml;r att s&auml;tta dig ner.</font></p>		<p><font face="Comic Sans MS"><b><a name="OnFloor"></a>P&aring; golvet eller i en tankebubbla:</b></font></p>		<p><font face="Comic Sans MS">Tryck <i>Escape</i> (det brukar st&aring; <i>Esc</i>) f&ouml;r att avsluta.</font></p>		<p><font face="Comic Sans MS">Tryck F1 f&ouml;r att h&auml;mta <a href="marty.htm">Marty </a>eller, om han redan &auml;r framme, f&ouml;r att skicka iv&auml;g honom.</font></p>		<p><font face="Comic Sans MS"><i>Och om din hand &auml;r tom och du inte pekar p&aring; n&aring;got</i>.</font></p>		<p><font face="Comic Sans MS">Tryck u eller U f&ouml;r att st&auml;lla dig <u>u</u>p.</font></p>		<p><font face="Comic Sans MS">Tryck p eller P f&ouml;r att <u>p</u>locka upp det som &auml;r under fingret.</font></p>		<p><font face="Comic Sans MS">Tryck f eller F <u>f</u>f&ouml;r att flippa eller v&auml;nda.</font></p>		<p><font face="Comic Sans MS">Tryck F9 f&ouml;r att g&ouml;mma din hand om den &auml;r synlig eller visa den om den &auml;r osynlig. Se ocks&aring; <a href="sensor.htm#HandVisible">hur du har kontroll &ouml;ver handens synlighet</a>.</font></p>		<p><font face="Comic Sans MS"><i>Och om du h&aring;ller n&aring;got(f&ouml;rutom textkort).</i></font></p>		<p><font face="Comic Sans MS">Tryck f eller F f&ouml;r att <u>f</u>lippa eller v&auml;nda det (om det &auml;r m&ouml;jligt).</font></p>		<p><font face="Comic Sans MS">Tryck d eller D f&ouml;ra att <u>d</u>roppa eller sl&auml;ppa det.</font></p>		<p><font face="Comic Sans MS"><i>Och om du h&aring;ller i ett verktyg:</i></font></p>		<p><font face="Comic Sans MS">Tryck mellanslag f&ouml;r att s&auml;tta ig&aring;ng eller st&auml;nga av verktyget. ( <a href="wand.htm">Trollstaven</a> st&auml;nger av sig sj&auml;lv n&auml;r den anv&auml;nts.)</font></p>		<p><font face="Comic Sans MS"><i><a name="Dusty"></a>Och om du h&aring;ller i <a href="dusty.htm">Dammis</a>:</i></font></p>		<p><font face="Comic Sans MS">Tryck s eller S f&ouml;r att &auml;ndra Dammis s&aring; att han suger bort saker och &auml;r ig&aring;ng. (<u>S</u>uger bort &auml;r grundl&auml;get.)</font></p>		<p><font face="Comic Sans MS">Tryck r eller R s&aring; att han rensar saker och s&auml;tts ig&aring;ng. (<u>r</u>ensar)</font></p>		<p><font face="Comic Sans MS">Tryck b ellerB f&ouml;r att f&aring; honom att spotta ut saker och s&auml;tta ig&aring;ng honom. (<u>B</u>akl&auml;nges)</font></p>		<p><font face="Comic Sans MS"><a name="OLE_LINK2"></a>Tryck F2 f&ouml;r att h&auml;mta Dammis. Han kommer direkt till din hand. Om du trycker F2 igen g&aring;r det fortare.</font></p>		<p><font face="Comic Sans MS"><i><a name="Pumpy"></a>Och om du h&aring;ller <a href="pumpy.htm">Pumpas</a>:</i></font></p>		<p><font face="Comic Sans MS">Tryck s eller S f&ouml;r att f&aring; Pumpas att g&ouml;ra saker <u>s</u>t&ouml;rre och s&auml;tta ig&aring;ng honom. (grundl&auml;ge)</font></p>		<p><font face="Comic Sans MS">Tryck h eller H f&ouml;r att f&aring; honom att g&ouml;ra saker <u>h</u>&ouml;gre och s&auml;tta ig&aring;ng honom.</font></p>		<p><font face="Comic Sans MS">Tryck b or B f&ouml;r att f&aring; honom att g&ouml;ra saker <u>b</u>redare och s&auml;tta ig&aring;ng honom.</font></p>		<p><font face="Comic Sans MS">Tryck m or M f&ouml;r att f&aring; honom att g&ouml;ra saker <u>m</u>indre och s&auml;tta ig&aring;ng honom.</font></p>		<p><font face="Comic Sans MS">Tryck t or T f&ouml;r att f&aring; honom att g&ouml;ra saker <u>t</u>unnare och s&auml;tta ig&aring;ng honom.</font></p>		<p><font face="Comic Sans MS">Tryck k or K to f&ouml;r att f&aring; honom att g&ouml;ra saker <u>k</u>ortare och s&auml;tta ig&aring;ng honom.</font></p>		<p><font face="Comic Sans MS">Tryck x eller X f&ouml;r att f&aring; honom att g&ouml;ra en sak till en &quot;bra&quot; storlek.</font></p>		<p><font face="Comic Sans MS">Tryck F3 f&ouml;r att h&auml;mta honom direkt in i din hand. Trycker du F3 igen s&aring; skyndar han sig.</font></p>		<p><font face="Comic Sans MS"><i><a name="MagicWand"></a>Och om du h&aring;ller i <a href="wand.htm">Trollstaven</a>:</i></font></p>		<p><font face="Comic Sans MS">Tryck o or O f&ouml;r att g&ouml;ra en kopia av <u>o</u>riginalet till saken under staven.</font></p>		<p><font face="Comic Sans MS">Tryck k or K f&ouml;r att g&ouml;ra en <u>k</u>opia av saken.</font></p>		<p><font face="Comic Sans MS">Tryck s eller S f&ouml;r att f&aring; staven att g&ouml;ra en kopia av sig <u>s</u>j&auml;lv.</font></p>		<p><font face="Comic Sans MS">Tryck F5 f&ouml;r att f&aring; staven att komma flygande till din hand. Trycker du F5 igen kommer den att skynda sig p&aring;.</font></p>		<p><font face="Comic Sans MS"><i>Och om du h&aring;ller i en bomb:</i></font></p>		<p><font face="Comic Sans MS">Tryck valfri tangent f&ouml;r att sm&auml;lla av bomben.</font></p>		<p><font face="Comic Sans MS"><i><a name="Notebook"></a>Och om du h&aring;ller i eller pekar p&aring; en <a href="notebook.htm">anteckningsbok</a>:</i></font></p>		<p><font face="Comic Sans MS">Tryck - eller <i>Backsteg</i> f&ouml;r att komma till f&ouml;reg&aring;ende sida (sista sidan om du &auml;r p&aring; den f&ouml;rsta).</font></p>		<p><font face="Comic Sans MS">Tryck + eller mellanslag f&ouml;r att g&aring; till n&auml;sta sida.</font></p>		<p><font face="Comic Sans MS">Tryck siffror (0 till 9) f&ouml;r att mata in ett sidnummer.</font></p>		<p><font face="Comic Sans MS">Tryck F4 f&ouml;r att f&aring; den senaste anteckningsboken komma flygande. Trycker du F4 kommer den snabbare.</font></p>		<p><font face="Comic Sans MS"><i>Och om du h&aring;ller en <a href="number.htm">siffra</a> eller pekar p&aring; en siffra</i></font></p>		<p><font face="Comic Sans MS">Tryck siffror (0 till 9) f&ouml;r att mata in ett siffertal.</font></p>		<p><font face="Comic Sans MS">Tryck <i>Backsteg</i> f&ouml;r att radera den sista siffran.</font></p>		<p><font face="Comic Sans MS">Tryck +, -, /, *, x, %, ^, &amp; , | eller = f&ouml;r att utf&ouml;ra en bearbetning av talet, t ex addera (l&auml;gga till), subtrahera (minska med) och s&aring; vidare.</font></p>		<p><font face="Comic Sans MS">Tryck f eller F f&ouml;r att <u>f</u>lippa eller v&auml;nda p&aring; ett sifferkort. Fungerar bara om du h&aring;ller i en siffra.)</font></p>		<p><font face="Comic Sans MS"><i>Och om du h&aring;ller i eller pekar p&aring; ett <a href="text.htm">textkort</a>:</i></font></p>		<p><font face="Comic Sans MS">Bara skriv den text du vill ha.</font></p>		<p><font face="Comic Sans MS">Tryck <i>Backsteg</i> f&ouml;r att radera den sista bokstaven.</font></p>		<p><font face="Comic Sans MS"><i><a name="Picture"></a>Och om du h&aring;ller i eller pekar p&aring; en <a href="picture.htm">bild eller en animation</a>:</i></font></p>		<p><font face="Comic Sans MS">Tryck + eller mellanslag f&ouml;ra att g&aring; till n&auml;sta next avsnitt, f&auml;rg eller del.</font></p>		<p><font face="Comic Sans MS">Tryck - eller <i>Backsteg</i> f&ouml;r att g&aring; tillbaka</font></p>		<p><font face="Comic Sans MS">Tryck f eller F f&ouml;r att <u>f</u>lippa eller v&auml;nda.</font></p>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>