<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>Long-distance Birds Flying Between Computers Running ToonTalk</title>		<meta name="GENERATOR" content="Microsoft FrontPage 3.0">	</head>	<body bgcolor="white">		<center>			<font size="6" face="Comic Sans MS"><b>L&aring;ngdistans f&aring;glar flyger mellan datorer som k&ouml;r ToonTalk</b></font></center>		<center>			<p><font size="2" face="Comic Sans MS"><img src="../bird.gif" alt="A Picture of a bird" width="118" height="158"></font></p>		</center>		<p><font face="Comic Sans MS">I  korthet, man kan kopiera en f&aring;gel till Urklipp med ctrl-c  och sedan klistra in den med ctrl-v i ett ett epostmeddelande, i ett chat- eller i ett instant message-meddelande, en webbsida eller en diskett s&aring; att f&aring;geln kan komma till en dator som k&ouml;r ToonTalk. Om man ger f&aring;geln n&aring;got och datorn som f&aring;geln kommer fr&aring;n fortfarande &auml;r ig&aring;ng och det finns ett n&auml;tverk utan hinder fr&aring;n brandv&auml;ggar eller liknande d&aring; kommer f&aring;geln flyga tillbaka  till  sitt bo med saken den har i  sina klor. Om den andra datorn k&ouml;rs ig&aring;ng innan du avslutar ditt ToonTalk kommer ett meddelande levereras strax efter uppstart.</font></p>		<p><font face="Comic Sans MS">Boet kan sparas i en stad p&aring; en dator och f&aring;geln p&aring; en annan  dator. Kontakten kommer att uppst&aring; igen n&auml;r b&aring;da systemen k&ouml;rs, F&aring;geln och boet &aring;terskapas och datorerna kopplas till varann. F&ouml;r n&auml;rvarande funkar detta enbart om datorn med boet  beh&aring;ller sin IP-adress som datorn hade n&auml;r f&aring;geln skapades. F&aring;geln kan kan kopieras till flera datorer och de kommer alla flyga till samma bo.</font></p>		<p><font face="Comic Sans MS">Du kan ocks&aring; ha  f&aring;geln och boet p&aring; samma ToonTalk och samma dator utan att ha tillg&aring;ng  till ett n&auml;tverk. </font></p>		<p><font face="Comic Sans MS">Skulle du vilja ha en f&aring;gel som <i>inte</i> kan flyga i n&auml;tverk f&aring;r du kopiera f&aring;geln och boet p&aring; samma g&aring;ng. Ett s&auml;tt &auml;r att l&auml;gga b&aring;de i en l&aring;da med tv&aring; fack och kopiera l&aring;dan.</font></p>		<p><font face="Comic Sans MS">Du kan &auml;ndra din <a href="ttini.htm#LogNetworkEvents">toontalk.ini</a>-fil f&ouml;r att skapa en detaljerad loggfil &ouml;ver vad din f&aring;gel har f&ouml;r sig.</font></p>		<p><font face="Comic Sans MS">Anta att du skapade en koppling med en l&aring;ngdistans-f&aring;gel och dess bo p&aring; en annan dator och b&aring;da ToonTalk-st&auml;derna sparades. Om kopplingen ska beh&aring;llas m&aring;ste b&aring;da datorerna beh&aring;lla sina tidigare IP-adresser. Med modemuppling tilldelas datorn oftast ett IP-nummer vid  varje upkopplingstillf&auml;lle och d&aring; m&aring;ste f&aring;gel och bo bytas ut vid varje ny uppkoppling.</font></p>		<p><font face="Comic Sans MS">Framtida versioner kommer klara dynamiska IP adresser. Vi planerar ocks&aring; att g&ouml;ra det m&ouml;jligt att kopiera f&aring;gelbon och flytta dem. Meddelanden kommer ocks&aring; s&auml;ndas utan att b&aring;da datorerna &auml;r uppkopplade samtidigt.</font></p>		<p><font face="Comic Sans MS">L&aring;ngdistansf&aring;glar kr&auml;ver Beta 23 eller version 2.35 eller senare. Kr&auml;ver &auml;ven <a href="http://www.microsoft.com/directx">DirectX 7</a> eller senare. F&ouml;r Windows NT 4.0 beh&ouml;vs service pack 6 eller senare. </font></p>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>