<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>Din anteckningsbok f&ouml;r ToonTalk</title>		<meta name="GENERATOR" content="Microsoft FrontPage 5.0">	</head>	<body bgcolor="white" text="black">		<center>			<font face="Comic Sans MS">            <img src="../notebook.gif" alt="A picture of your notebook." width="300" height="220"></font></center>		<p><font face="Comic Sans MS">Din anteckningsbok bor i <a href="tooly.htm">Verktygsl&aring;dan</a> som f&ouml;ljer dig vart du &auml;n g&aring;r. P&aring; sidorna i din anteckningsbok hittar du andra anteckningsb&ouml;cker. En &auml;r till f&ouml;r bilder och animationer. En annan &auml;r f&ouml;r ljudeffekter. En anteckningsbok &auml;r fylld med <a href="file:///MacOSX/Users/lmogren/Desktop/TT-nya%20docs/att%20%9Avers%8Atta/sensor.htm">sensorer</a> som du kan anv&auml;nda f&ouml;r att g&ouml;ra spel och andra program. En massa exempel p&aring; saker du kan bygga i ToonTalk ligger i ytterligare en. En anteckningsbok &auml;r full med tillval du kan &auml;ndra s&aring; att <a href="you.htm">du ser annorlunda ut</a>, s&aring; att Marty talar snabbare eller l&aring;ngsammare, eller med st&ouml;rre eller mindre bokst&auml;ver, hur stor staden &auml;r och en m&auml;ngd annat. Det finns en anteckningsbok i slutet av din huvudanteckningsbok som &auml;r f&ouml;r att arbeta med olika slags <a href="newnum.htm">br&aring;ktal och decimaltal</a></font></p>		<p><font face="Comic Sans MS">Din anteckningsbok &auml;r ocks&aring; r&auml;tta st&auml;llet att spara saker du byggt i ToonTalk eller <a href="robot.htm">robotar</a> som du l&auml;rt upp. Det &auml;r bara att sl&auml;ppa dom p&aring; en tom sida. I slutet av anteckningsboken har du en massa tomma sidor. Du f&aring;r se upp med en sak. Det &auml;r bara den f&ouml;rsta huvudanteckningsboken som stannar kvar hos dig. Om du sparar n&aring;got i en annan anteckningsbok och sedan g&aring;r ur ToonTalk kommer den att f&ouml;rsvinna. Du kan spara den nya anteckningsboken genom att sl&auml;ppa den p&aring; en tom sida i huvudanteckningsboken. Det &auml;r bara med hj&auml;lp av <a href="dusty.htm">Dammis</a> som du kan ta bort saker fr&aring;n en anteckningsbok.</font></p>		<p><font face="Comic Sans MS">Varje g&aring;ng du startar ToonTalk p&aring; nytt och talar om ditt namn kommer du att f&aring; tillbaka din anteckningsbok med alla &auml;ndringar du gjort. Om du avslutar och loggar in i ToonTalk med ett annat namn, f&aring;r du en helt ny anteckningsbok. Du kan spara det gjort genom att anv&auml;nda <a href="sensor.htm#Clipboard">en sensor f&ouml;r urklipp</a>.</font></p>		<p><font face="Comic Sans MS">Om du sl&auml;pper en siffra p&aring; en anteckningsbok, kommer den att sl&aring; upp den sidan. Om du sl&auml;pper ett textkort, kommer den att sl&aring; upp sidan med den texten. I anteckningsboken kan det finnas mera text efter den text du sl&auml;ppt p&aring; den. S&aring; om du har ordet &quot;mat&quot; i anteckningsboken och du sl&auml;pper &quot;ma&quot; p&aring; den s&aring; kommer den att hitta sidan med &quot;mat&quot; p&aring;.</font></p>		<p><font face="Comic Sans MS">Det finns m&aring;nga <a href="keyboard.htm">snabbkommandon</a> som du kan ge till anteckningsb&ouml;cker.</font></p>		<p><font face="Comic Sans MS">Tips. Om anteckningsboken &auml;r p&aring; sidan 1 och du trycker p&aring; <i>Backsteg</i>, hoppar den till sista sidan som det finns n&aring;got i.<br>		</font></p>		<p><font face="Comic Sans MS"><b>Avancerat tips</b>; Om du sl&auml;pper en anteckningsbok p&aring; rensad l&aring;da f&aring;r l&aring;dan ett fack med alla sidorna i din anteckningsbok. Sl&auml;pper du tv&auml;rtom en l&aring;da p&aring; en rensad anteckningsbok kommer anteckningsboken fyllas med inneh&aring;llet i l&aring;dans fack.</font></p>		<p><font face="Comic Sans MS"><b>Avancerat tips</b>; Robotar kan tr&auml;nas att l&auml;gga till eller ta bort saker fr&aring;n anteckningsb&ouml;cker. T&auml;nk p&aring; att det <i>inte</i> g&auml;ller huvudanteckningsboken som ju anv&auml;nds av alla robotar och dig som programmerar.</font></p>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>