<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>ToonTalk Robotar</title>		<meta name="generator" content="GoLive CyberStudio">	</head>	<body bgcolor="white" text="black">		<center>			<font face="Comic Sans MS"><img src="../robot.gif"></font>			<p><font face="Comic Sans MS" size="4"><b>Du kan tr&auml;na robotar att f&ouml;lja din viljas minsta vink</b></font></p>		</center>		<p><font face="Comic Sans MS">Inuti <a href="tooly.htm">Verktygsl&aring;dan</a> finns det en massa robotar. Om du tar ut en s&aring; ser du att han har en tom <a href="../bubble.htm">tankebubbla</a>. Du kan b&ouml;rja tr&auml;na en ny robot med att sl&auml;ppa en l&aring;da p&aring; honom. Du kommer in i robotens tankar och kan kontrollera honom. Du kan f&aring; honom att plocka upp saker, anv&auml;nda verktyg och sl&auml;ppa ner saker. Han kommer ih&aring;g allt. Om du l&auml;r honom att ta n&aring;got ur en l&aring;da eller att l&auml;gga dit n&aring;got s&aring; kommer han ih&aring;g vilket fack det var genom att r&auml;kna fr&aring;n v&auml;nster sida av l&aring;dan. N&auml;r du l&auml;rt honom f&auml;rdigt kan du trycka escape-knappen (den brukar heta <i>Esc</i>).</font></p>		<p><font face="Comic Sans MS">Sen kan du f&aring; roboten att g&ouml;ra det du tr&auml;nat honom till genom att ge honom l&aring;dan igen. N&auml;r han &auml;r f&auml;rdig kommer han f&ouml;rs&ouml;ka g&ouml;ra det igen s&aring; l&auml;nge som l&aring;dan <a href="../bubble.htm">&auml;r densamma som den i hans tankebubbla</a>.</font></p>		<p><font face="Comic Sans MS"><b>Tips. </b>Robotar &auml;r v&auml;ldigt kinkiga. Dom arbetar enbart med l&aring;dor som &auml;r likadana som de l&aring;dor som finns i deras tankebubblor. Som tur &auml;r kan du anv&auml;nda <a href="dusty.htm">Dammis</a> f&ouml;r att suga bort en del saker ur l&aring;dan som &auml;r i tankebubblan. En bra id&eacute; kan vara att suga bort bara s&aring; mycket att du kan f&aring; roboten att arbeta n&auml;r du vill det. Ibland &auml;r det l&auml;ttare att suga bort l&aring;dan ur tankebubblan, spotta ut den och sedan sl&auml;ppa tillbaka den p&aring; tankebubblan igen.</font></p>		<p><font face="Comic Sans MS"><b>Hela lag med robotar.</b> Du kan g&ouml;ra ett lag av robotar genom att sl&auml;ppa dom p&aring; varandra. N&auml;r du ger en l&aring;da till laget d&aring; ser roboten l&auml;ngst fram i ledet efter om l&aring;dan &auml;r likadan som den i hans tankebubbla. &Auml;r den det kommer han att b&ouml;rja arbeta med den och hans lagkamrater kommer h&aring;lla sig ur v&auml;gen. Om l&aring;dan inte &auml;r likadan, kommer han att skicka den vidare till n&auml;sta robot som st&aring;r i tur. Om det saknas n&aring;got i l&aring;dan eller om det ligger ett f&aring;gelbo i den och roboten vill ha n&aring;got annat d&aring; v&auml;ntar han. N&auml;r l&aring;dan fylls p&aring; med det som fattas, eller det l&auml;ggs i boet, s&aring; b&ouml;rjar han arbeta igen.</font></p>		<p><font face="Comic Sans MS"><b>Tips.</b> Om du vill att en robot ska g&ouml;ra n&aring;got bara n&auml;r n&aring;got <i>inte</i> &auml;r d&auml;r, d&aring; kan du l&aring;ta roboten framf&ouml;r honom kolla efter n&aring;got, t ex talet 42 f&ouml;r att roboten efter honom bara ska f&aring; en m&ouml;jlighet att k&ouml;ra ig&aring;ng om talet &auml;r n&aring;got annat &auml;n 42.</font></p>		<p><font face="Comic Sans MS">&Ouml;verallt d&auml;r du beh&ouml;ver en robot kan du anv&auml;nda ett lag av robotar lika g&auml;rna. Du kan sl&auml;ppa ett lag av robotar i en <a href="truck.htm">lastbil</a> eller f&auml;sta dom p&aring; baksidan av en <a href="picture.htmm">bild</a>. Enda s&auml;ttet att l&ouml;sa upp ett lag &auml;r att anv&auml;nda <a href="dusty.htm">Dammis</a> f&ouml;r att dra is&auml;r dom.</font></p>		<p><font face="Comic Sans MS"><b><a name="ReTraining"></a>Tips.</b> Om du tr&auml;nat en robot att g&ouml;ra n&auml;stan precis r&auml;tt, men st&ouml;kat till det en smula, d&aring; kan du tr&auml;na om honom. Sug bara ut l&aring;dan ur robotens tankebubbla, spotta ut den och sl&auml;pp sedan l&aring;dan p&aring; roboten (var noga med att inte sl&auml;ppa den p&aring; tankebubblan). Du g&aring;r tillbaka in i robotens tankebubbla, men den h&auml;r g&aring;ngen kommer roboten g&ouml;ra om det du l&auml;rt honom att g&ouml;ra tills du klickar med musen eller en tangent p&aring; tangentbordet. Sedan kan du forts&auml;tta att tr&auml;na honom som vanligt.</font></p>		<p><font face="Comic Sans MS">H&auml;r kommer n&aring;gra avancerade tips p&aring; engelska.</font></p>		<p><font face="Comic Sans MS"><b>Advanced tip. </b>You can't train a robot to give something to other robots, but you can train a robot to load up a truck with other robots. Computer scientists would describe this as saying that while you can't do a procedure call, you can do a more general process spawn. If you want to get something back from the robots then arrange for them to give a reply to a bird.</font></p>		<p><font face="Comic Sans MS"><b>Advanced tip.</b> Computer scientists talk about <i>recursive</i> programs - programs that use themselves. Here's how you can make recursive programs in ToonTalk. Put a fresh robot on a blank page of your <a href="notebook.htm">main notebook</a>. Then train another robot to, among other things, find the page with the saved robot. Train the robot to put a copy of the robot in the notebook into a truck along with a box for him to work on. After finishing your robot's training, find the page where you saved the robot. Use <a href="dusty.htm">Dusty</a> to remove that robot and put in his place the robot you just trained.</font></p>		<p><font face="Comic Sans MS">The factorial of a number (1 times 2 times 3 and so on up to your number) can be computed recursively or <i>iteratively</i> (repeatedly without using recursion). <a href="programs.htm#SingleFactorial">Click here</a> to find robots to compute the factorial using recursion once. <a href="programs.htm#DoubleFactorial">Click here</a> to find robots that compute factorial using recursion twice. Robots that compute factorial without recursion can found on page 12 of the examples notebook which is on page 6 of your main notebook.</font></p>		<p><font face="Comic Sans MS"><b><a name="MetaProgramming"></a>Advanced tip.</b> You can put robots in boxes and even train other robots to manipulate those robots. Computer scientists call this <i>meta-programming</i>. Robots cannot train other robots, but they can re-arrange teams, remove, edit and replace boxes in thought bubbles, and the like. <a href="box.htm#ExplodingTeams">Dropping a team of robots on a blank box</a> breaks the team up -- one robot per hole of the box. A robot in a box in a thought bubble will only match another robot with the same name. You can use Dusty to &quot;erase&quot; a robot so that it will only match any robot.</font></p>		<p><font face="Comic Sans MS">You can also train a robot to pick up a team of robots from a box and put them in a truck together with a box for them to work on. Computer scientists call this <i>higher-order programming</i>. There is a way of combining higher-order programming and recursive programming -- see if you can figure out how.</font></p>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>