<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>Att anv&auml;nda sensorer i ToonTalk</title>		<meta name="generator" content="GoLive CyberStudio">	</head>	<body text="black" bgcolor="white">		<center>			<b><font size="4" face="Comic Sans MS">Att anv&auml;nda sensorer</font></b></center>		<p><font size="2" face="Comic Sans MS">P&aring; sidan 4 i din f&ouml;rsta anteckningsbok finns en anteckningsbok full med sensorer. De &auml;r bra f&ouml;r att styra saker med musen och tangentbordet. Det finns ocks&aring; sensorer f&ouml;r att m&auml;ta tiden, f&aring; fram slumptal och adressen till huset. En del sensorer &auml;r till f&ouml;r att l&auml;gga in bilder, ljud, text och ToonTalk saker utifr&aring;n. Sensorer fungerar ungef&auml;r likadant som <a href="remote.htm">kontroller f&ouml;r bilder</a>.</font></p>		<p><font size="2" face="Comic Sans MS">Sensorerna i anteckningsboken &auml;r f&ouml;ljande:</font></p>		<dl>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 2 - Musens hastighet &aring;t h&ouml;ger.</b></font>			<dd><font size="2" face="Comic Sans MS">De h&auml;r sensorerna m&auml;ter hur snabbt datorns mus (inte <a href="bammer.htm">Hammarmusen</a>) r&ouml;r sig fr&aring;n v&auml;nster till h&ouml;ger. Om talet &auml;r negativt r&ouml;r sig musen fr&aring;n h&ouml;ger till v&auml;nster. Hastigheten 1000 betyder att musen kan flyttas tv&auml;rs &ouml;ver sk&auml;rmen p&aring; 1 sekund.</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 4 - Musens hastighet upp&aring;t.</b></font>			<dd><font size="2" face="Comic Sans MS">Den h&auml;r sensorn m&auml;ter hur snabbt musen kan flyttas upp&aring;t. Om talet &auml;r negativt g&auml;ller det hastigheten ner&aring;t. Hastigheten 1000 betyder att musen kan flyttas nerifr&aring;n och upp p&aring; 1 sekund.</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 6 - Musens v&auml;nstra knapp.</b></font>			<dd><font size="2" face="Comic Sans MS">Den h&auml;r sensorn svarar p&aring; fr&aring;gan, &quot;Tryckte du p&aring; den v&auml;nstra musknappen?&quot; Om du trycker p&aring; den v&auml;nstra musknappen kommer den att v&auml;xla fr&aring;n &quot;nej&quot; till &quot;ja&quot; och sedan tillbaka till &quot;nej&quot; v&auml;ldigt fort. Men en robot kan uppfatta det och reagera p&aring; att det &auml;r &quot;ja&quot;.</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 8 - Musens mittknapp.</b></font>			<dd><font size="2" face="Comic Sans MS">Den h&auml;r sensorn svarar p&aring; fr&aring;gan, &quot;Tryckte du p&aring; mittknappen?&quot; Om du trycker p&aring; mittknappen v&auml;xlar den fr&aring;n &quot;nej&quot; till &quot;ja&quot; och sen tillbaka till &quot;nej&quot; v&auml;ldigt fort.</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 10 - Musens h&ouml;gra knapp.</b></font>			<dd><font size="2" face="Comic Sans MS">Den h&auml;r sensorn svarar p&aring; fr&aring;gan, &quot;Tryckte du p&aring; den h&ouml;gra musknappen?&quot; Om du trycker den h&ouml;gra musknappen kommer den att v&auml;xla fr&aring;n &quot;nej&quot; till &quot;ja&quot; och sen tillbaka till &quot;nej&quot; igen v&auml;ldigt fort.</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 12 - Musens v&auml;nstra knapp nere.</b></font>			<dd><font size="2" face="Comic Sans MS">Den h&auml;r sensorn svarar p&aring; fr&aring;gan, &quot;&Auml;r den v&auml;nstra musknappen nertryckt nu?&quot; Om du trycker den v&auml;nstra musknappen v&auml;xlar den fr&aring;n &quot;nej&quot; till &quot;ja&quot; och f&ouml;rblir i det l&auml;get till dess du sl&auml;pper upp musknappen.</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 14 - Musens mittknapp nere.</b></font>			<dd><font size="2" face="Comic Sans MS">Den h&auml;r sensorn svarar p&aring; fr&aring;gan, &quot;&Auml;r mittenknappen nertryckt nu?&quot; Om du trycker mittenknappen v&auml;xlar den fr&aring;n &quot;nej&quot; till &quot;ja&quot; och f&ouml;rblir i det l&auml;get till dess du sl&auml;pper upp musknappen.</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 16 - Musens h&ouml;gra knapp nere.</b></font>			<dd><font size="2" face="Comic Sans MS">Den h&auml;r sensorn svarar p&aring; fr&aring;gan, &quot;&Auml;r den h&ouml;gra musknappen nertryckt nu?&quot; Om du trycker den h&ouml;gra musknappen v&auml;xlar den fr&aring;n &quot;nej&quot; till &quot;ja&quot; och f&ouml;rblir i det l&auml;get till dess du sl&auml;pper upp musknappen.</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 18 - Nyss tryckt tangent.</b></font>			<dd><font size="2" face="Comic Sans MS">Den h&auml;r sensorn visar vilken tangentknapp som senast trycktes. N&auml;r du trycker en tangent, g&aring;r den h&auml;r sensorn fr&aring;n att vara tom, till att visa vilken tangent det &auml;r du trycker, till att bli tom igen v&auml;ldigt fort. En robot kan tr&auml;nas till att f&aring;nga upp den v&auml;xlingen.</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 20 - Senaste tangenttryck.</b></font>			<dd><font size="2" face="Comic Sans MS">Den h&auml;r sensorn svarar p&aring; fr&aring;gan &quot;Vilken tangentknapp trycktes senast ner?&quot; den visar vilken tangent det var tills den sl&auml;pps upp igen.</font>			<dt><font size="2" face="Comic Sans MS"><a name="OLE_LINK2"></a><b>Sidan 22 - Shift nere.</b></font>			<dd><font size="2" face="Comic Sans MS">Den h&auml;r sensorn svarar p&aring; fr&aring;gan &quot;&Auml;r <i>Shift</i> tangenten p&aring; tangentbordet nertryckt just nu?&quot;</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 24 - Ctrl nere.</b></font>			<dd><font size="2" face="Comic Sans MS">Den h&auml;r sensorn svarar p&aring; fr&aring;gan &quot;&Auml;r <i>Control</i> knappen (den heter ofta <i>Ctrl</i>) p&aring; tangentbordet nertryckt just nu?&quot;</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 26 - Tusendels sekunder sedan senaste filmruta.</b></font>			<dd><font size="2" face="Comic Sans MS">Den h&auml;r sensorn svarar p&aring; fr&aring;gan &quot;Hur l&aring;ng tid har g&aring;tt sedan du senast svarade p&aring; den h&auml;r fr&aring;gan?&quot;. Svaret ges i millisekunder (tusendelar av en sekund). Med den h&auml;r sensorn kan du skapa klockor och tidtagare.</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 28 - Tal mellan 0 och 1000.</b></font>			<dd><font size="2" face="Comic Sans MS">Den h&auml;r sensorn svarar p&aring; fr&aring;gan &quot;Vilket tal mellan 0 och 1000?&quot; Den g&ouml;r sitt b&auml;sta att svara slumpm&auml;ssigt, <i>random</i>, som n&auml;r du singlar slant eller kastar t&auml;rning. Om du vill ha en kopia av denna som inte &auml;ndras s&aring; sl&auml;pp den p&aring; en nolla.</font>			<dt><font size="2" face="Comic Sans MS"><a name="Clipboard"></a><b>Sidan 30 - Till och fr&aring;n andra program.</b></font>			<dd><font size="2" face="Comic Sans MS">Den h&auml;r sensorn kopplar till <i>urklipp</i> i Microsoft Windows. Om du sl&auml;pper n&aring;got p&aring; den h&auml;r sensorn n&auml;r den &auml;r tom (svart), d&aring; kommer Hammarmusen klippa in det du sl&auml;ppte i urklippet. D&auml;refter kan du g&aring; till ett annat program i Windows, t ex ett a epostprogram eller en ordbehandlare och v&auml;lja <i>Klistra in</i> fr&aring;n menyn (det brukar vara <i>Edit</i> eller <i>Redigera</i>). Texten som sparas kan l&auml;ggas in i dokument, skickas med epost eller vad nu vill g&ouml;ra med det. N&auml;r du vill g&aring; i den andra riktningen och h&auml;mta in n&aring;got till ToonTalk utifr&aring;n d&aring; &auml;r det bara att markera den text ToonTalk skapade och v&auml;lja <i>Copy</i> eller <i>Kopiera</i> fr&aring;n menyraden. ToonTalk sensor f&ouml;r urklipp kommer nu visa det som kopierats. Anv&auml;nd <a href="dusty.htm">Dammis</a> f&ouml;r att ta ut det fr&aring;n urklipp och spotta ut det. Du kan ocks&aring; kopiera in text i ToonTalk p&aring; det h&auml;r viset.</font>			<dt><font size="2" face="Comic Sans MS"><a name="HandVisible"></a><b>Sidan 32 - Hand synlig?.</b></font>			<dd><font size="2" face="Comic Sans MS">Den h&auml;r sensorn svarar p&aring; fr&aring;gan, &quot;&Auml;r din hand synlig?&quot;. Du kan h&aring;lla ner mellanslag medan du pekar p&aring; eller h&aring;ller i den h&auml;r sensorn och din hand blir osynlig om den &auml;r synlig eller synlig om den &auml;r osynlig. N&auml;r sidan du spelar ett spel som Bordtennis (p&aring; sidan 24 i anteckningsboken f&ouml;r exempel p&aring; sidan 6 i din f&ouml;rsta anteckningsbok) vill du f&ouml;r det mesta d&ouml;lja din hand. Det h&auml;r &auml;r ett bra s&auml;tt f&ouml;r dig att l&aring;ta en robot g&ouml;ra det n&auml;r spelet s&auml;tter ig&aring;ng. F9 g&ouml;mmer ocks&aring; din hand. Trycker du F9 igen blir den synlig.</font>			<dt><font size="2" face="Comic Sans MS"><a name="PictureFile"></a><b>Sidan 34. - Fil till Bild </b></font>			<dd><font face="Comic Sans MS" size="2">Den h&auml;r sensorn f&ouml;rvandlar filnamn till bilder. Sl&auml;pp bara ett textkort med filnamnet p&aring; en Windows BMP fil p&aring; en sensor s&aring; kommer <a href="bammer.htm">Hammarmusen</a> att sm&auml;lla ihop dom. Om din bildfil ligger mappen Users i ToonTalk-mappen eller i <a href="ttini.htm#FileSearchPath">filens s&ouml;kv&auml;g</a> kan du anv&auml;nda bildens kortnamn. Sen kan du dra ur bilden med <a href="dusty.htm">Dammis</a>. Du kan skapa BMP filer p&aring; m&aring;nga s&auml;tt - Paint Brush som finns i Windows l&aring;ter dig g&ouml;ra dom. Du kan se till f&auml;rgen svart i dina bilder blir genomskinlig med hj&auml;lp av <a href="remote.htm#Visible">synlighetskontrollen </a>.<br>			Filnamnet kan vara en URL/webbadress som &lt;http://www.toontalk.com/ghost.bmp&gt;. Filen kan vara JPG, PNG, GIF, eller DIB ocks&aring; om filnamnet har med &quot;.jpg&quot;, &quot;.jpeg&quot;, &quot;.png&quot;, &quot;.gif&quot;, eller &quot;.dib&quot;. Om du tar in en bild som har en genomskinlig f&auml;rg (bara GIF coh PNG funkar med detta), d&aring; kommer den f&auml;rgen vara osynlig n&auml;r bildens sensor Synlig? &auml;r st&auml;lld till &quot;Se lite&quot;. En del GIF-filer som &auml;r genomskinliga i en webbl&auml;sare visas med f&auml;rgen vit i ToonTalk i st&auml;llet f&ouml;r osynlig. Vissa program sparar dessa GIF-filer korrekt. Att &ouml;pnna och spara dom i Adobe Photoshop l&ouml;ser problemet. Tyv&auml;rr &auml;r det s&aring; att Microsoft API g&ouml;r cyan (100% red, 0% green, and 100% blue) osynligt ocks&aring;. Vill du ha cyan och genomskinlighet, anv&auml;nd i s&aring; fall inte en genomskinlig f&auml;rg utan anv&auml;nd svart f&ouml;r genomskinlighet. Vill du ha med svart synligt ska du v&auml;lja en f&auml;rg som bara &auml;r 99% svart. Eller anv&auml;nd en f&auml;rg som &auml;r 99% cyan. Du kan ocks&aring; ta in bilder n&auml;r du k&ouml;r ToonTalk i ett f&ouml;nster och trycker p&aring; F8 f&ouml;r att sl&auml;ppa loss musen och sen dra in i ToonTalk-f&ouml;nstret. Tryck F8 f&ouml;r att f&aring; in musen igen. Eller du kan kopiera filnamnet och klistra in det i ToonTalk.</font>			<dt><font face="Comic Sans MS" size="2"><a name="SoundFile"></a><b>Sidan 36 - Fil till ljud.</b></font>			<dd><font size="2" face="Comic Sans MS">Denna sensor konverterar filnamn till ljud. Sl&auml;pp bara ett textkort med filnamnet p&aring; en Windows WAV (ljud) fil p&aring; sensorn s&aring; kommer <a href="bammer.htm">Hammarmusen</a> och sm&auml;ller in den. Ljudet kommer att spelas upp tills det &auml;r slut eller s&aring; kan du anv&auml;nda <a href="dusty.htm">Dammis</a> f&ouml;r att suga bort det. Du kan skaffa ett <a href="sound.htm">kort f&ouml;r ljud</a> som du kan anv&auml;nda m&aring;nga g&aring;nger. Sug bara bort det fr&aring;n sensorn och l&aring;t Dammis spotta ut det. Om din WAV-fil ligger i underkatalogen &quot;users&quot; i ToonTalk, d&aring; kan du anv&auml;nda filens korta namn. Du kan spela upp en ljudfil med fj&auml;rrkontrollen f&ouml;r MCI.</font>			<dt><font size="2" face="Comic Sans MS"><a name="TextToMCI"></a><b>Sidan 38 - Media Control Interface.</b></font>			<dd><font size="2" face="Comic Sans MS">Sl&auml;pper du ett textkort p&aring; denna sensor, skickas texten till <a href="mci.htm">Microsoft Window's Media Control Interface</a> (MCI). Det h&auml;r &auml;r ett vanligt s&auml;tt att spela olika slags media. Du kan suga bort det <a href="sound.htm">kort f&ouml;r ljud</a> du nyss gjort och anv&auml;nda det som vilket ljud som helst. Om du t ex sl&auml;pper &quot;play c:\windows\media\canyon.mid&quot; p&aring; denna kontroll kommer du att skapa ett kort f&ouml;r att spela &quot;canyon.mid&quot;, en MIDI fil.</font>			<dt><font size="2" face="Comic Sans MS"><a name="TextToSpeech"></a><b>Sidan 40. - Text till Tal </b></font>			<dd><font size="2" face="Comic Sans MS">Om du sl&auml;pper ett textkort p&aring; denna sensor kommer texten bli uppl&auml;st. Det fungerat bara i 32-bitarsversionen av ToonTalk. Du skapar ett <a href="sound.htm">kort f&ouml;r ljud</a> som du kan suga bort fr&aring;n sensorn.</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 42 - V&auml;gg Utsmyckning.</b></font>			<dd><font size="2" face="Comic Sans MS">Denna inneh&aring;ller en bild p&aring; v&auml;ggen i rummet. Du kan sl&auml;ppa bilder och text p&aring; den och v&auml;ggen i rummet du befinner dig i kommer att se ut precis som denna sensor.</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 44 - Hus Utsmyckning.</b></font>			<dd><font size="2" face="Comic Sans MS">Denna inneh&aring;ller en bild p&aring; husets framsida. Du kan sl&auml;ppa bilder och text p&aring; den och framsidan p&aring; huset du befinner dig i kommer att se ut precis som denna sensor.</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 46 - Yttertak Utsmyckning.</b></font>			<dd><font size="2" face="Comic Sans MS">Denna inneh&aring;ller en bild p&aring; husets tak. Du kan sl&auml;ppa bilder och text p&aring; den och taket p&aring; huset du befinner dig i kommer att se ut precis som denna sensor.</font>			<dt><font size="2" face="Comic Sans MS"><a name="Address"></a><b>Sidan 48 - Min adress.</b></font>			<dd><font size="2" face="Comic Sans MS">P&aring; den h&auml;r sidan finns 2 sensorer som visar <a href="location.htm">adressen till huset</a> som de ligger i. Den f&ouml;rsta sensorn visar numret v&auml;gen och den andra numret p&aring; gatan. V&auml;gar g&aring;r fr&aring;n norr till s&ouml;der. Gator g&aring;r fr&aring;n &ouml;ster till v&auml;sterut. Du kan g&ouml;ra nya adresser av gamla. Om du sl&auml;pper en adress p&aring; en lastbil, d&aring; kommer byggjobbarna bygga huset s&aring; n&auml;ra den adressen dom kan.</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 50 - Spr&aring;k som anv&auml;nds.</b></font>			<dd><font face="Comic Sans MS" size="2">Denna visar namnet p&aring; det spr&aring;k som &auml;r i anv&auml;ndning nu i ToonTalk. det kan vara &quot;English&quot;, &quot;Brasileiro&quot;, &quot;Portugu&Iacute;s&quot;, och &quot;Swedish&quot;.</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 52 - Fr&auml;mmande f&aring;gel</b></font>			<dd><font size="2" face="Comic Sans MS">Denna sensor &auml;r en f&aring;gel <a href="extend.htm">som kan flyga utanf&ouml;r ToonTalk</a> och skapa f&ouml;rbindelser till operativsystemet och andra externa tj&auml;nster.</font>			<dt><font size="2" face="Comic Sans MS"><b>Sidan 54 - Styrspak.</b></font>			<dd><font size="2" face="Comic Sans MS"><a name="Joysticks"></a>En anteckningsbok f&ouml;r joystick sensorer. Denna anteckningsbok visar sig bara om du k&ouml;r 32-bitarsversionen av ToonTalk i Windows 95 och har kopplat in en joystick till datorn. Du kanske m&aring;ste <a href="joycalib.htm">informera Windows 95 om din joystick</a>. Har du fler &auml;n en joystick kopplade till datorn kommer de f&ouml;ljande sidorna f&aring; anteckningsb&ouml;cker f&ouml;r dessa joysticks. Det finns flera <a href="joysense.htm">joystick sensorer</a>.</font>		</dl>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>