<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>ToonTalk kan h&auml;nga sig vid arbete med mycket stora tal</title>		<meta name="GENERATOR" content="Microsoft FrontPage 3.0">	</head>	<body bgcolor="white">		<center>			<font face="Comic Sans MS" size="5"><strong>ToonTalk kan h&auml;nga sig vid arbete med mycket stora tal</strong></font></center>		<div align="left">			<p><font face="Comic Sans MS">Vill du se den senaste versionen av denna sida p&aring; webben <a href="http://www.toontalk.com/English/slownumb.htm">kan du klicka h&auml;r</a>.</font></p>		</div>		<div align="left">			<p><font face="Comic Sans MS">Fr&aring;n version 2.50 (eller beta 34) kan ToonTalk arbeta med <a href="newnum.htm">hur stora tal som helst</a> (som datorn klarar av). N&auml;r talen &auml;r p&aring; v&auml;g att bli v&auml;ldigt stora kanske du m&auml;rker att ToonTalk h&auml;nger sig ett tag med siffrorna byts ut, kopieras eller n&auml;r du ska s&auml;tta dig i ett hus med v&auml;ldigt stora tal p&aring; golvet. Tal med f&auml;rre &auml;n 1000 siffror &auml;r inte n&aring;got problem. Inte heller b&ouml;r du f&aring; problem med robotar som arbetar med tal som har en miljon siffror under f&ouml;ruts&auml;ttning att de finns i ett annat hus &auml;n det du &auml;r i eller om de ligger p&aring; baksidan av en bild. Om du d&auml;remot f&ouml;rsta g&aring;ngen ska se ett tal med en miljon siffror kan du f&aring; v&auml;nta i flera timmar medan ToonTalk f&ouml;rebereder talet f&ouml;r visning p&aring; sk&auml;rmen. </font></p>		</div>		<div align="left">			<p><font face="Comic Sans MS">Vill du v&auml;ldigt g&auml;rna arbeta med tal som har tusentals eller miljontals siffror kan du unvika dessa l&aring;nga pauser genom att se talen efter l&auml;mplig potensupph&ouml;jning. <a href="numbbase.htm">Klicka h&auml;r</a> f&ouml;r att l&auml;ra dig hur man &auml;ndrar talens potens.</font></p>			<p><font face="Comic Sans MS">Detta problem kan ocks&aring; upptr&auml;da n&auml;r det g&auml;ller exakta br&aring;ktal eftersom de kan inneh&aring;lla v&auml;ldigt stora tal, ett f&ouml;r n&auml;mnaren och ett f&ouml;r t&auml;ljaren.</font></p>		</div>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>