<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=x-mac-roman">
		<title>ToonTalks textkort</title>
		<meta name="generator" content="Microsoft FrontPage 5.0">
	</head>

	<body text="black" bgcolor="white">
		<center>
			<font size="5" face="Comic Sans MS"><b>ToonTalk Textkort</b></font>
			<p><font face="Comic Sans MS">
            <img there will be a picture here. src="../text.gif" alt="A picture of a text pad" width="401" height="66"></font></p>
		</center>
		<p><font face="Comic Sans MS">Det ligger en mycket tjock bunt med textkort med bokstaven &quot;A&quot; inne i <a href="tooly.htm">Verktygsl&aring;dan</a>. Du kan ta upp ett och skriva ord, meningar eller vad du vill. Om du trycker <i>Enter</i> s&aring; ger du kortet en ny rad. Om du sl&auml;pper ett textkort p&aring; ett annat kommer <a href="bammer.htm">Hammarmusen</a> och sl&aring;r ihop dom. Och om du sl&auml;pper &quot;Talk&quot; till h&ouml;ger om &quot;Toon&quot; s&aring; f&aring;r du &quot;ToonTalk&quot;. Om du sl&auml;pper det till v&auml;nster om Toon s&aring; f&aring;r du &quot;TalkToon&quot;.</font></p>
		<p><font face="Comic Sans MS"><b>Tips.</b> Du kan sl&auml;ppa textkort p&aring; en <a href="notebook.htm">anteckningsbok</a> f&ouml;r att hitta sidan med just den texten.</font></p>
		<p><font face="Comic Sans MS"><b>Tips.</b> Du kan sl&auml;ppa en <a href="number.htm">siffra</a> p&aring; ett textkort. D&aring; &auml;ndras den f&ouml;rsta eller sista bokstaven p&aring; kortet (beroende p&aring; vilken sida om kortet du sl&auml;pper siffran p&aring;) lika m&aring;nga steg fram&aring;t i alfabetet. Om du sl&auml;pper 2 p&aring; &quot;a&quot; f&aring;r du allts&aring; &quot;c&quot;.</font></p>
		<p><font face="Comic Sans MS"><b>Tips.</b> Textkorten som du finner i <a href="notebook.htm">anteckningsboken</a> (till exempel, &quot;Bilder&quot; p&aring; sidan 1) &auml;r gjorda med bokst&auml;ver som har &quot;variabel bredd&quot;. Ett W &auml;r till exempel mycket bredare &auml;n ett I. Du kan anv&auml;nda dessa textkort precis som de vanliga med &quot;fast bredd&quot;.</font></p>
		<p><font face="Comic Sans MS"><i><b>ENDAST AVANCERADE ANV&Auml;NDARE:</b></i></font></p>
		<p><font face="Comic Sans MS"><a name="BlankText"></a><b>Tomma textkort</b></font></p>
		<p><a href="dusty.htm"><font face="Comic Sans MS">Dammis</font></a><font face="Comic Sans MS"> kan hj&auml;lpa dig att g&ouml;ra tomma textkort. Dom kommer v&auml;l till pass inne i en robots <a href="bubble.htm">tankebubbla</a>. En robot tar ju bara emot l&aring;dor som liknar det som finns i hans tankebubbla. Det h&auml;r &auml;r ett s&auml;tt att g&ouml;ra roboten mindre nogr&auml;knad. Om en l&aring;da i hans tankebubbla inneh&aring;ller textkort som det st&aring;r &quot;OK&quot; p&aring; d&aring; godtar han bara l&aring;dor med textkort som det st&aring;r &quot;OK&quot; p&aring;. Men om du rensar och t&ouml;mmer det s&aring; godtar han glatt textkort med vad som helst skrivet p&aring;.</font></p>
		<p><font face="Comic Sans MS">Tomma textkort kan anv&auml;ndas f&ouml;r att konvertera ett tal till text. Sl&auml;pp ett
        <a href="newnum.htm">siffertal</a> p&aring; ett tomt kort s&aring; f&aring;r du ett textkort med samma siffror p&aring;. Fast det ser ut som ett tal &auml;r det nu skrivet p&aring; ett textkort i st&auml;llet f&ouml;r ett sifferkort.</font></p>
		<p><font face="Comic Sans MS"><b>Att &auml;ndra utseendet p&aring; texten.</b></font></p>
		<p><font face="Comic Sans MS">Om du v&auml;nder p&aring; ett textkort (genom att trycka ner shift-tangenten och klicka med musen medan du h&aring;ller i ett textkort), d&aring; kan du anv&auml;nda n&aring;gra av <a href="remote.htm">fj&auml;rkontrollerna</a> i anteckningsboken som flyger ut, f&ouml;r att &auml;ndra f&auml;rgen eller synligheten p&aring; ett textkort.</font></p>
		<p><font face="Comic Sans MS"><b><a name="FixedAndVariableWidths"></a>Fixed width vs. variable width fonts</b>.</font></p>
		<p><font face="Comic Sans MS">ToonTalk har tv&aring; slags textkort:</font></p>
		<p><img border="0" src="../text.h1.jpg" alt="Fixed width text pad" width="705" height="64"></p>
		<p><img border="0" src="../text.h2.jpg" alt="Variable width text pad" width="885" height="66"></p>
		<p><font face="Comic Sans MS">Bara i typsnitt med fast bredd visas ett 'W' och ett 'I' i samma storlek. De tv&aring; textkortstyperna &auml;r annars identiska (de fungerar p&aring; samma s&auml;tt i tankebubblor t ex). N&auml;r du klistrar in text i ToonTalk blir det bokst&auml;ver med variable bredd. Om du kopierar text med varialbel bredd p&aring; bokst&auml;verna s&aring; kommer du  enbart se texten och inte den tillh&ouml;rande XML (om du inte har lagt robotar p&aring; baksidan av textkortet eller &auml;ndrat f&auml;rg p&aring; texten). I <a href="tooly.htm">Verktygsl&aring;dan</a> finns  bokst&auml;ver6 med fast bredd+edan bokst&auml;ver med variabel  bredd anv&auml;nds i de inbyggda anteckningsb&ouml;ckerna.</font></p>
		<center>
			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>
	</body>

</html>