<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=ISO-8859-1">
<TITLE>ToonTalk Tips</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.04z">
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
<P>
<CENTER><B><FONT SIZE=4>ToonTalk Tips</FONT></B></CENTER>
<OL>
<LI><B>Ordna dina verktyg.</B> Du kan anv&auml;nda <A HREF="pumpy.htm">Pumpas</A>
f&ouml;r att byta storlel p&aring; <A HREF="tooly.htm">Verktygsl&aring;dan</A>,
<A HREF="wand.htm">Trollstaven</A>, <A HREF="dusty.htm">Dammis</A>,
och din <A HREF="notebook.htm">anteckningsbok</A>. Du kan till
och med byta storlek p&aring; Pumpas genom att kopiera honom och
anv&auml;nda kopian f&ouml;r att &auml;ndra hans storlek. Det
h&auml;r &auml;r et bra s&auml;tt att f&aring; mera plats om du
hellre vill arbeta med sm&aring; saker. Du kan ocks&aring; l&auml;mna
dina verktyg vid sk&auml;rmens kant och anv&auml;nda funktionstangenterna
f&ouml;r att h&auml;mta dom till dig. (Se <A HREF="keyboard.htm">ToonTalks tangentbord</A>,
f&ouml;r detaljer.) N&auml;r du &auml;r f&auml;rdig med dom g&aring;r
de tillbaka till sin ursprungliga plats.
<LI><B>Hj&auml;lp av Marty.</B> <A HREF="marty.htm">Marty</A>,
marsm&auml;nniskan kommer att ge en fullst&auml;ndig beskrivning
av n&aring;gonting om du h&auml;mtar honom (med F1) medan du pekar
p&aring; eller h&aring;ller i saken. Speciellt bra f&ouml;r att
f&aring; en beskrivning av vad en robot g&ouml;r.
<LI><B>Att f&ouml;rst&aring; en robot.</B> F&ouml;rutom att l&aring;ta
<A HREF="marty.htm" >Marty</A> beskriva roboten (se ovan), kan
du ocks&aring; anv&auml;nda <A HREF="wand.htm" >Trollstaven</A>
b&aring;de f&ouml;r att kopiera n&aring;gonting, men &auml;ven
f&ouml;r att f&aring; tillbaka delar som raderats. Trollstavens
knapp ska i s&aring; fall vara st&auml;lld p&aring;  &quot;O&quot;
(original) f&ouml;r att detta ska fungera. Det h&auml;r s&auml;ttet
kan du anv&auml;nda med l&aring;dan i robotens tankebubbla och
sedan ge den &aring;terst&auml;llda kopian till roboten och se
honom arbeta med den ursprungliga tr&auml;ningen. Om det g&auml;ller
ett helt robotlag kan du se hur laget arbetar. Vill du koncentrera
dig p&aring; en speciell robot kan du anv&auml;nda <A HREF="dusty.htm" >Dammis</A>
f&ouml;r att s&auml;ra p&aring; robotarna i laget. L&aring;t Dammis
suga upp dem och spotta s&aring; ut dem igen.
<LI><B>Kluriga &auml;ndringar av tankebubblor.</B> Du kan anv&auml;nda
<A HREF="dusty.htm">Dammis</A> f&ouml;r att suga bort hela l&aring;dan
i en robots tankebubbla och sen l&aring;ta honom spotta ut den
p&aring; golvet. D&aring; blir den mycket st&ouml;rre och l&auml;ttare
att &auml;ndra. Om du inte kan anv&auml;nda <A HREF="pumpy.htm">Pumpas</A>
f&ouml;r att utvidga l&aring;dan. Du kan g&ouml;ra de &auml;ndringar
du vill och sedan sl&auml;ppa tillbaka l&aring;dan i den tomma
tankebubblan. 
<LI><B>ToonTalks anv&auml;ndarinst&auml;llningar.</B> N&auml;r
du ger ditt namn till ToonTalk skapar den filer i &quot;Users&quot;
underkatalog till ToonTalk katalogen. Filerna b&ouml;rjar med
det namn du gav till ToonTalk. Mellanslag as bort fr&aring;n ditt
namn och det blir avkortat om det &auml;r l&auml;ngre &auml;n
8 bokst&auml;ver. Om vi antar att ditt namn &auml;r Albert Einstein
d&aring; kommer dina filer att heta &quot;albertei&quot;. Dessa
filer kommer att inneh&aring;lla dina anv&auml;ndarinst&auml;llningar
och de &auml;ndringar du gjort i din anteckningsbok. Anv&auml;ndarinst&auml;llningar
(USR filen) inneh&aring;ller dina inst&auml;llningar, hur l&aring;ngt
du kommit med uppdragen och de handlingar du utf&ouml;rt s&aring;
att Marty bara ger f&ouml;rslag p&aring; s&aring;nt du &auml;nnu
inte gjort. Om du inte anv&auml;nt ToonTalk p&aring; ett tag eller
vill b&ouml;rja med uppdragen fr&aring;n b&ouml;rjan d&aring;
b&ouml;r du antingen ge dig sj&auml;lv ett nytt namn eller ta
bort USR filen med ditt namn. Om du gjort &auml;ndringar till
anteckningsboken som du vill &aring;ngra kan du ta bort eller
d&ouml;pa om BOK filen med ditt namn. Om du har sparat saker i
anteckningsboken och inte vill f&ouml;rlora dom kan du anv&auml;nda
ToonTalks <A HREF="sensor.htm#Clipboard">sensor f&ouml;r urklipp</A>
och spara dom. 
</OL>
</BODY>
</HTML>
