<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=x-mac-roman">		<title>Vad du kan g&ouml;ra om ToonTalk arbetar f&ouml;r l&aring;ngsamt</title>		<meta name="Generator" content="Microsoft Word 97">		<meta name="Version" content="8.0.4308">		<meta name="Date" content="7/8/97">		<meta name="Template" content="C:\Program Files\Microsoft Office\Office\HTML.DOT">	</head>	<body bgcolor="white" text="black">		<center>			<b><font size="4" face="Comic Sans MS">Vad du kan g&ouml;ra om ToonTalk arbetar f&ouml;r l&aring;ngsamt</font></b></center>		<p><font face="Comic Sans MS">ToonTalks hastighet beror p&aring; m&aring;nga olika saker. De kan vara din dators snabbhet, hur mycket minne den har, vilken typ av ljud- och videokort som sitter i den, vilken version av Windows du k&ouml;r, om dina drivrutiner f&ouml;r ljud och video &auml;r uppdaterade och mycket annat.</font></p>		<p><font face="Comic Sans MS">Om du har hundratals robotar som k&ouml;r i ett hus eller p&aring; baksidan av bilder kan ToonTalk bli l&aring;ngsamt.  Om du anv&auml;nder mycket stora tal kan sakta ner. Du kan f&ouml;rs&ouml;ka med att logga in med ett annat namn f&ouml;r att f&aring; bort problemet.</font></p>		<p><font face="Comic Sans MS">H&ouml;guppl&ouml;sta bilder &auml;r l&aring;ngsamma att visa. Det kan  ocks&aring; bli stor skillnad i hastighet beroende p&aring; om ToonTalk k&ouml;rs i fullsk&auml;rmsl&auml;ge eller i ett f&ouml;nster. Ibland kan det bli l&aring;ngsamt om du st&auml;llt in det s&aring; att Marty talar  engelska. Prova med att v&auml;lja olika inst&auml;llningar under V&auml;lja alternativ n&auml;r du startar ToonTalk.</font></p>		<p><font face="Comic Sans MS">Har du ett annat program som k&ouml;r samtidigt med ToonTalk kan de t&auml;vla om datorns resurser. Prova med att avsluta andra &ouml;ppna program och k&ouml;r enbart ToonTalk s&aring; kanske problemet f&ouml;rsvinner.</font></p>		<p><a href="report.htm"><font face="Comic Sans MS">Kilcka h&auml;r</font></a><font face="Comic Sans MS"> f&ouml;r att rapportera problem.</font>		<center><p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>		</body></html>