<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Template" content="C:\PROGRAM FILES\MICROSOFT OFFICE\OFFICE\html.dot">
<meta name="GENERATOR" content="Microsoft FrontPage 5.0">
<title>ToonTalk lastbilar bygger nya hus</title>
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080">

<p align="center"><font size="6" face="Comic Sans MS"><b>Lastbilar bygger nya hus</b></font><font size="5" face="Comic Sans MS"><b> </b></font><OBJECT id=AgentControl codeBase=#VERSION=2,0,0,0 classid=clsid:D45FD31B-5C6E-11D1-9EC1-00C04FD7081F VIEWASTEXT></OBJECT>

<SCRIPT language=javascript src="../agent.js"></SCRIPT>
<SCRIPT language=javascript src="strings.js"></SCRIPT>
<SCRIPT language=JavaScript event="Click(CharacterID, Button, Shift, X, Y)" for=AgentControl> 

<!-- 

reactToAgentClicked(CharacterID, Button, Shift, X, Y); 

--> </SCRIPT><SCRIPT language=JavaScript event=IdleStart(CharacterID) for=AgentControl> 

<!-- 

idleAgent(CharacterID); 

--> 

</SCRIPT>
<INPUT onclick=agentStart() type=image alt="Peedy can read this page for you." src="../reading.gif" name=Image1 width="58" height="51"></p>

<p align="center"><font face="Comic Sans MS">
<img src="../truck.gif" alt="A picture of a truck" width="246" height="145"></font></p>

<p><font size="4" face="Comic Sans MS">I <a href="tooly.htm">Verktygsl&aring;dan</a> finns det en h&ouml;g med lastbilar. Lastbilen har ett arbetslag med byggare som g&auml;rna vill k&ouml;ra iv&auml;g och bygga ett nytt hus. Men de kommer bara kunna bygga ett nytt hus om de har en <a href="robot.htm">robot</a> med sig som kan jobba i huset.  F&ouml;r att roboten ska kunna jobba m&aring;ste man ge honom en <a href="box.htm">l&aring;da</a> att arbeta med.  Du m&aring;ste allts&aring; sl&auml;ppa en robot eller ett lag med flera robotar plus en l&aring;da p&aring; lastbilen innan den k&ouml;r iv&auml;g.<a href="box.htm"> </a> De kommer hitta den n&auml;rmaste obebyggda tomten, bygga ett hus  d&auml;r och l&auml;mna roboten i huset och ge honom l&aring;dan. Han kommer b&ouml;rja jobba med detsamma.</font></p>

<p><font size="4" face="Comic Sans MS">Ett kul exempel p&aring; hus  som byggs kan du se i demofilmen &quot;Hus som exploderar&quot; eller s&aring; kan prova att anv&auml;nda roboten p&aring; sidan 6 i <a href="notebook.htm">anteckningsboken</a> f&ouml;r exempel som finns p&aring; sidan 6 i din anteckningsbok. </font></p>

<p><font size="4" face="Comic Sans MS"><b>Tips. </b>Bygglaget kommer bygga ett exakt likadant hus som det hus de kom ifr&aring;n. Du kan tala om f&ouml;r dem vad f&ouml;r slags hus de ska bygga genom b&ouml;rja med att du p&aring; lastbilen sl&auml;pper en <a href="picture.htm">bild</a> av huset du vill att de ska bygga . Du kan hitta bilder p&aring; hus i anteckningsboken f&ouml;r bilder p&aring; sidan 2 i din anteckningsbok. </font><font size="2" face="Comic Sans MS"> </font><font color="#FF0000" face="Comic Sans MS"><b><a href="../truck_house_picture.dmo"><font color="#FF0000" size="4">VISA MIG!</font></a></b></font></p>

<p><font size="4" face="Comic Sans MS"><b>Tips. </b>Du kan &quot;st&auml;nga av&quot; en lastbil genom att skriva '.' (punkt) medan du h&aring;ller i eller pekar p&aring; den. En avst&auml;ngd lastbil kommer inte k&ouml;ra iv&auml;g f&ouml;rr&auml;n tangenten f&ouml;r mellanslag trycks ner medan du h&aring;ller i den eller pekar p&aring; den. </font></p>

<p><font face="Comic Sans MS" size="3"><b>Avancerat tips.</b> Lastbilens bygglag kommer bygga huset p&aring; en tomt som ligger i  n&auml;rheten. Om du vill tala om f&ouml;r bygglaget var n&aring;gonstans de ska bygga det nya huset kan du sl&auml;ppa en <a href="location.htm">adress</a> p&aring; lastbilen innan du sl&auml;pper roboten och l&aring;dan. <a href="sensor.htm#Address">Adresser hittar du p&aring; sidan 48</a> i anteckningsboken f&ouml;r sensorer som finns p&aring; sidan 4 i din anteckningsbok. </font><font color="#FF0000" face="Comic Sans MS"><b><a href="../truck_address.dmo"><font color="#FF0000" size="4">VISA MIG!</font></a></b></font></p>

<p><font face="Comic Sans MS" size="3"><b>Avancerat tips. </b>Sl&auml;pper du en anteckningsbok p&aring; lastbilen s&aring; kommer robotarna anv&auml;nda den anteckningsboken i st&auml;llet f&ouml;r en kopia av din anteckningsbok. En robot som tr&auml;nats att leta efter n&aring;got i </font><font face="Comic Sans MS"><a href="notebook.htm">din anteckningsbok</a></font><font face="Comic Sans MS" size="3"> (t ex genom att sl&auml;ppa en siffra eller ett textkort p&aring; den)  kommer f&ouml;rst leta i anteckningsboken som var med i lastbilen och om han inte hittar det han s&ouml;ker efter d&auml;r, kommer han leta vidare i din anteckningsbok. </font><font face="Comic Sans MS"> Kommentar p&aring; engelska: </font><font face="Comic Sans MS" size="3">Using 
notebooks like this is what computer scientists call a &quot;module&quot; or &quot;package&quot;. </font></p>

<p><font face="Comic Sans MS" size="3"><b>Avancerat tips.</b> Om en robot p&aring; baksidan av en bild sl&auml;pper en l&aring;da och ett robotlag p&aring; en lastbil d&aring; kommer roboten jobba med l&aring;dan p&aring; baksidan av bilden. Du kan &auml;ndra p&aring; detta genom att tr&auml;na roboten att sl&auml;ppa en  adress p&aring; lastbilen. </font></p>

<p align="center"><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></p>
</body>
</html>