<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=x-mac-roman">		<title>Trollstaven</title>		<meta name="generator" content="GoLive CyberStudio">	</head>	<body bgcolor="white" text="black">		<center>			<font face="Comic Sans MS"><img src="../usewand.gif"></font>			<p><font face="Comic Sans MS"><i>Trollstaven kopierar saker</i></font></p>		</center>		<p><font face="Comic Sans MS">Plocka bara upp den och r&ouml;r stavens spets &ouml;ver den sak du vill kopiera. Den sak du valt b&ouml;rjar d&aring; att skaka. Tryck p&aring; mellanslag s&aring; har du en kopia. Ett tryck till p&aring; mellanslag g&ouml;r att du sl&auml;pper kopian.<br>		<br>		</font></p>		<p><font face="Comic Sans MS">Spetsen p&aring; Trollstaven kan &auml;ndras med ett klick fr&aring;n 'K' f&ouml;r <u>k</u>opia, till 'O' f&ouml;r att f&aring; en kopia av <u>o</u>riginalet till saken (om n&aring;got blivit raderat), och 'S' f&ouml;r att g&ouml;ra en kopia av sig <u>s</u>j&auml;v (enda s&auml;ttet att f&aring; en Trollstav till).<br>		<br>		</font></p>		<p><font face="Comic Sans MS">Det finns <a href="keyboard.htm#MagicWand">s&auml;rskilda kommandon </a>att anv&auml;nda n&auml;r du h&aring;ller i staven.<br>		<br>		</font></p>		<p><font face="Comic Sans MS"><b>Avancerat tips.</b> En sak staven kan g&ouml;ra &auml;r att kopiera en sak som <a href="dusty.htm">Dammis</a> rensat s&aring; att kopian inte blir rensad. Kopian ser d&aring; ut som saken gjorde innan Dammis rensade den. Det h&auml;r kan du g&ouml;ra med staven genom att trycka o eller O. Ett fint trick &auml;r att ta ut en uppl&auml;rd robot fr&aring;n en anteckningsbok och sedan kopiera l&aring;dan i hans tankebubbla s&aring; att du f&aring;r tillbaka den l&aring;da som anv&auml;ndes n&auml;r han blev uppl&auml;rd f&ouml;rsta g&aring;ngen. Om du sl&auml;pper kopian p&aring; roboten, s&aring; ser du att han g&ouml;r det han blev l&auml;rd att g&ouml;ra.</font></p>		<p><font face="Comic Sans MS"><b>Avancerat tips p&aring; engelska. </b></font><font face="Comic Sans MS" size="3">If a robot is trained to use a wand with its button set to 'S' then the robot (and his team mates) are copied. This is a convenient way to create <a href="robot.htm#Recursion">recursive processes</a>.</font></p>		<center>			<p><a href="toontalk.htm"><font face="Comic Sans MS" size="2">hem</font></a><font face="Comic Sans MS" size="2"> | <a href="search.htm">s&ouml;k</a> | <a href="buy.htm">k&ouml;p</a> | <a href="doc.htm">manual</a> | <a href="whatsnew.htm">nyheter</a> | <a href="infodesk.htm">info</a> | <a href="games.htm">spel</a> | <a href="faq.htm">fr&aring;gor</a> | <a href="support.htm">support</a> | <a href="free.htm">downloads</a> | <a href="endorse.htm">utm&auml;rkelser</a> | <a href="press.htm">press</a> | <a href="address.htm">kontakt</a></font></center>	</body></html>