<HTML>

<HEAD>

<TITLE>ToonTalk V&ouml;gel und ihre Nester</TITLE>

</HEAD>

<body bgcolor="#ffffff" text="#000000">

<P>
<CENTER><B><FONT SIZE=4>V&ouml;gel und ihre Nester</FONT></B></CENTER>
<P>
<CENTER><IMG SRC="../bird.gif" ALT="Ein Bild von einem Vogel"></CENTER>
<P>
In <A HREF="tooly.htm">Tooly</A> findest Du einen gro&szlig;en Stapel mit
Nestern. Wenn Du eines davon herausnimmst, siehst Du ein Ei in dem 
Nest. Wenn Du das Nest dann hinlegst, schl&uuml;pft ein Vogel aus dem
Ei. Der Vogel bringt alles was Du ihm gibst in sein Nest.
Selbst wenn man das Nest an einen anderen Ort in der Stadt legt,
findet der Vogel sein Nest. Der Vogel mag allerdings nur Dinge, die
<I>rechteckig</I> sind. Er nimmt <A HREF="number.htm">Zahlenfelder</A>
und <A HREF="text.htm">Textfelder</A>, <A HREF="picture.htm">Bilder</A>
 und <A HREF="box.htm">Beh&auml;lter</A>
- sonst nichts. 
<P>
<I><B>NUR F&Uuml;R FORTGESCHRITTENE BENUTZER:</I></B>
<P>
Die anderen Dinge kann man in Beh&auml;lter legen. 
Der Vogel kann dann einen Beh&auml;lter mit den Nestern anderer V&ouml;gel
und sogar einen Beh&auml;lter mit anderen V&ouml;geln darin transportieren.
Wenn ein Vogel etwas in sein Nest legen will und es sich bereits
etwas darin befindet, legt der Vogel das was er im Schnabel hat als 
unterstes in den Stapel. 
<P>
Nachdem ein Vogel etwas in sein Nest gebracht hat, kehrt er zu dem
Platz zur&uuml;ck von dem aus er gestartet ist.
<P>
<B>Kopien von V&ouml;geln.</B> Wenn Du Deinen <A HREF="wand.htm">Zauberstab</A>
benutzt, um einen Vogel zu kopieren, erh&auml;llst Du zwei V&ouml;gel.
Beide V&ouml;gel denken dann, da&szlig; das
gleiche Nest ihnen geh&ouml;rt. 
Es ist aber kein Problem f&uuml; beide,
sich ein Nest zu teilen.
<P>
<B>Kopien von Nestern.</B> Wenn Du den Zauberstab benutzt, um ein Nest zu
kopieren, dann hat der Vogel, der in dem Nest geschl&uuml;pft ist, ein
Problem. Er denkt n&auml;mlich, 
da&szlig; ihm beide Nester geh&ouml;ren und will,
was er bekommen hat, in beide Nester tragen. Das macht er indem er
sich und das was er gerade tr&auml;gt kopiert. So landet er in einem
Nest und seine Kopie in einem Nest. 
Der kopierte Vogel verschwindet aber wieder, wenn er den Gegenstand in das Nest
gelegt hat.
<P>
<B>Tip f&uuml;r Fortgeschrittene.</B> Wenn ein <A HREF="robot.htm">Roboter</A> 
einen Beh&auml;lter erh&auml;lt und es befindet sich ein Nest
darin, wartet der Roboter solange bis ein Vogel kommt, der ihm einen
Gegestand in das Nest legt. Das ist die ideale Methode,
um Roboter, die sich in verschiedenen H&auml;suern befinden, 
zusammenarbeiten zu lassen und Gegenst&auml;nde austauschen zu lassen.
<A HREF="programs.htm#Primes">Ein gutes Beispiel daf&uuml;r ist eine Menge 
von Robotern, die zusammenarbeiten, um Primzahlen zu berechnen.</A>
<BR>

</BODY>

</HTML>
