<HTML>

<HEAD>

<TITLE>ToonTalk Beh&auml;lter</TITLE>

</HEAD>

<body bgcolor="#ffffff" text="#000000">

<P>
<CENTER><B><FONT SIZE=4>Beh&auml;lter</FONT></B></CENTER>
<P>
<CENTER><IMG SRC="../box.gif" ALT="Ein Bild von einem Beh&auml;lter"></CENTER>
<P>
Beh&auml;lter sind zum Speichern und Transportieren von Dingen da. 
In Beh&auml;lter kannst Du
<A HREF="number.htm">Zahlenfelder</A>, <A HREF="text.htm">Textfelder</A>, 
<A HREF="bird.htm">V&ouml;gel und Nester</A>,
<A HREF="scale.htm">Waagen</A>, <A HREF="picture.htm">Bilder</A>
und sogar andere Beh&auml;lter hineinlegen. 
Zuk&uuml;nftige ToonTalk-Versionen werden auch erlauben, 
<A HREF="robot.htm">Roboter</A>, <A HREF="truck.htm">Lastwagen</A>,
<A HREF="bomb.htm">Bomben</A> und <A HREF="notebook.htm">Notizb&uuml;cher</A>
in Beh&auml;lter zu legen.
<P>
Du kannst zwei Beh&auml;lter vereinigen, wenn Du den einen Beh&auml;lter an
die Seite des anderen legst. Beide m&uuml;ssen sich hierbei ein bi&szlig;chen 
&uuml;berschneiden.
Wenn Du einen Beh&auml;lter in der Hand h&auml;lst, kannst Du eine Zahl 
zwischen 0 und 9 eingeben und der Beh&auml;lter bekommt dann genausoviele
F&auml;cher wie die Zahl, die Du eingegeben hast.
Wenn die Zahl kleiner als die Anzahl der existierenden F&auml;cher ist,
dann werden die F&auml;cher von der rechts entfernt.
Du kannst einen Beh&auml;lter spalten, wenn Du ihn auf eine 
<A HREF="number.htm">Zahl</A> legst.
Wenn zum Beispiel ein Beh&auml;lter mit 
5 F&auml;chern auf ein Zahlenfeld mit der
Zahl 3 gelegt wird, bekommst Du einen Beh&auml;lter mit 3 F&auml;chern und 
einen Beh&auml;lter mit 2 F&auml;chern.
<P>
<B>Tip. </B>Du kannst einen <A HREF="robot.htm">Roboter</A> so trainieren,
da&szlig; er allgemeine Dinge in einem Fach findet oder &auml;ndern kann, 
wenn er andere bekannte  Dinge aus dem Fach nimmt oder dieses dann
wieder zur&uuml;cklegt.
<P>
<B>Tip f&uuml;r Fortgeschrittene.</B> Wenn Du das genaue Fach beim 
Trainieren des Roboters noch nicht genau wei&szlig;t und dieses erst bei
der Benutzung des Roboters bestimmt werden kann, ist es m&ouml;glich
das Problem so zu l&ouml;sen:
Gib den Roboter zum Trainieren einen Beh&auml;lter und eine Zahl
(und alles andere, was er sonst noch braucht) mit den er etwas
tun soll. Trainiere den Roboter so, da&szlig; er die Zahl nimmt und 
neben den Beh&auml;lter legt. Nimm dann den Beh&auml;lter und leg ihn
auf die Zahl. Das Fach mit dem der Roboter etwas tun soll ist jetzt
das erste Fach des Beh&auml;lters auf der rechten Seite.
La&szlig; den Roboter jetzt mit diesem Fach arbeiten,
f&uuml;ge dann die zwei Beh&auml;lter wieder zu einem zusammen und
leg disen Beh&auml;lter dann wieder zur&uuml;ck von wo Du ihn her genommen
hast.
<P>
<B>Beh&auml;lter ohne F&auml;cher.</B> Wenn Du einen Beh&auml;lter in der Hand
h&auml;lst und die Zahl 0 eingibst, verwandelt sich der Beh&auml;lter 
in einen Beh&auml;lter ohne F&auml;cher. Es gibt nicht viel, was Du mit 
mit so einem Beh&auml;lter tun kannst. Du kannst ihn mit einem anderen
Beh&auml;lter zusammenf&uuml;gen und er verschwindet dann einfach.
Informatiker finden es toll, wenn sich Beh&auml;lter so verhalten.
<P>
<B>Leere Beh&auml;lter.</B> <A HREF="dusty.htm">Dusty</A> hilft Dir, wenn
Du einen leeren Beh&auml;lter erzeugen willst. Leere Beh&auml;lter k&ouml;nnen
in den <A HREF="bubble.htm">Gedanken</A>
eines Roboters n&uuml;tzlich sein und zwar, wenn Du willst, da&szlig; ein
Roboter einen Beh&auml;lter nimmt und es Dir egal ist, wieviele
F&auml;cher der Beh&auml;lter hat. Du kannst einen leeren Beh&auml;lter auch 
benutzen, um ein Textfeld &quot;explodieren&quot; zu lassen.
Wenn Du zum Beispiel ein Textfeld  mit dem Text &quot;Katze&quot; 
auf einen leeren Beh&auml;lter
legst, verwandelt sich er in einen Beh&auml;lter mit 5 F&auml;chern.
Das erste Fach beinhaltet dann den Buchstaben &quot;K&quot;, 
das zweite &quot;a&quot;, das dritte &quot;t&quot;, das vierte &quot;z&quot;
und das f&uuml;nfte Fach &quot;e&quot;. 
<P>
<B>Tip f&uuml;r Fortgeschrittene.</B>
Du kannst auch einen leeren Beh&auml;lter verwenden, um ein
Textfeld explodieren zu lassen. Wenn Du ein Textfeld wie
zum Beispiel "Eis" auf einen leeren Beh&auml;lter legst,
ver&auml;ndert sich der Beh&auml;lter und bekommt 3 F&auml;cher.
Das erste Fach enth&auml;lt dann den Buchstaben "E", das zweite
"I" und das dritte "S".
</BODY>

</HTML>
