<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>
Das folgende ist eine Satire von Eric Scharff, ein
Student in Wayne Citrins Kurs visuelles Programmieren
an der Universit&auml;t von Colorado. Er lieferte den Beitrag, um
zu zeigen, wie man ToonTalk verbessern kann.
</TITLE>
<META NAME="Version" CONTENT="8.0.3410">
<META NAME="Date" CONTENT="10/11/96">
<META NAME="Template" CONTENT="C:\Program Files\Microsoft Office\Office\HTML.DOT">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#ffffff">

<P>
Das folgende ist eine Satire von Eric Scharff, ein
Student von Wayne Citrins Kurs &uuml;ber visuelles Programmieren
an der Universit&auml; von Colorado. Er lieferte den Beitrag, um
zu zeigen, wie man ToonTalk verbessern kann.
</P>
<B><P>Titel:</B> ToonTalk Erweiterungen<BR>
<BR>
ToonTalk liefert schon eine umfangreiche Welt auf dem Gebiet der 
Grundlagen der 
Programmierung. Vielleicht 
k&ouml;nnte es dennoch
von ein paar Erweiterungen profitieren, um das Programmieren damit
zu erleichern.
Das folgende ist der Vorschlag einer solchen
Erweiterung.
<BR>
ToonTalk liefert uns so einpr&auml;gsame Figuren wie
Marty den Au&szlig;erirdischen,
Tooly die Werkzeugschachtel,
Dusty den Staubsauger und Pumpy die
Luftpumpe. &nbsp; 
W&auml;hrend diese Werkzeuge bereits 
eine witzige und gleichzeitig vollst&auml;ndige
Programmierumgebung zur Verf&uuml;gung stellen, w&uuml;rde
der ToonTalk Familie ein bi&szlig;chen Zuwachs gut tun, um
den Aufwand des Programmierens von Spielen in dieser Post-Ping-Pong-Welt
zu erleichtern.  <BR>
<BR>
Unsere erste neue Figur w&auml;re Dumpy der M&uuml;llwagen.&nbsp; 
Dumpy ist f&uuml;r die M&uuml;beseitigung in ToonTalk Stadt zust&auml;ndig.
Dumpys Aufgabe ist 
den Mist zu entfernen, den Bauarbeiter und Roboter,
die keine Bomben benutzen,
 hinterlassen
haben. &nbsp; 
Sobald Roboter mit ihrer Arbeit in einem Haus aufh&ouml;ren, 
erscheint Dumpy auf dem Grundst&uuml;ck.&nbsp; 
Bald darauf erscheint eine Abbruchbirne, die die &Uuml;berbleibsel
der flei&szlig;igen Mieter abrei&szlig;t.&nbsp;
Dumpy sammelt alle &uuml;briggebliebenen Roboter ein und
&uuml;bergibt sie Dir, da der B&uuml;rgermeister von ToonTalk keine
heimatlosen Roboter erlaubt.<BR>
<BR>
Einige visuellen Sprachen erlauben es, ein Programm auf verschiedenen
Abstraktionsstufen zu betrachten.&nbsp; 
Um zus&auml;tzliche Sichten auf Aktionen zu bekommen, k&ouml;nnen
wir Blurry das Teleskop rufen.&nbsp; 
Wenn wir mit Blurry auf das Dach steigen, k&ouml;nnen wir die Aktionen
in anderen H&auml;usern ausspionieren.&nbsp; 
Wir k&ouml;nnen sogar hinein- und herauszoomen, um den Stand der
systolischen Berechnung in der Nachbarschaft zu beobachten.&nbsp; 
Blurry zeigt auch gutes Benehmen und schaut nicht in H&auml;user, die
vorher als privat gekennzeichnet wurden.<BR>
<BR>
Slowy die Schnecke erlaubt das Debuggen und Editieren von ToonTalk
Figuren.
Im Gegensatz zu vielen Amerikanern, wei&szlig; Slowy wie man
programmiert und Viedorekorder benutzt.&nbsp; 
Wenn man Slowy Roboter und Daten &uuml;bergibt, kommt sie mit
einem Fernsehapparat und einer Fernbedienung wieder.&nbsp; 
Der Benutzer kann dann die Fernbedienung zum Abspielen,
Zur&uuml;ckspulen, schnellem Vorspulen oder Stoppen benutzen.&nbsp; 
Du kannst dann auch neue Einzelschritte einf&uuml;gen und falsche 
l&ouml;schen indem Du die geeeignete Stelle der Aufzeichnung 
modifiziert.&nbsp; 
Ein anderer Vogel bringt Dir die Fernbedienung zur&uuml;ck, wenn sie 
auf der ToonTalk Couch verloren geht.<BR>
<BR>
Slowy erlaubt es, die Ausf&uuml;hrung zu kontrollieren. Wir brauchen
aber auch etwas wie Inspektion und Breakpoints.&nbsp; 
Deshalb runden wir die Sammlung der ToonTalk Figuren mit Nosy der
Nase ab.&nbsp; 
Nosy der Bo&szlig; aller Roboter und Konstrukteure ist der 
symbolische Debugger in ToonTalk.&nbsp; 
Wenn Du Nosy mit Deiner Crew losschickst, kann sie bestimmte 
Variablen Zust&auml;nde, Aktionen von Robotern oder andere
andere Bedingungen herausschn&uuml;ffeln.
Falls die Bedingungen dann erf&uuml;llt sind, niest Nosy, worauf sich
die Roboter erschrecken und die Ausf&uuml;hrung stoppen.&nbsp; 
Du kannst dann umherfliegen und schauen gegen was Nosy allergisch
reagiert hat.&nbsp; Nosy kann auch als Profiler benutzt werden, um
herauszufinden, wie lange Roboter f&uuml;r bestimmte Sachen 
brauchen und sich dann eventuell beschweren, da&szlig; sie h&auml;rter
arbeiten m&uuml;ssen.<BR>
<BR>
Dummerweise
ist vielen Gesch&ouml;pfen den Eintritt nach ToonTalk 
aus verschiedensten Gr&uuml;nden verwehrt.&nbsp; 
Gesellen wie Pushy das Stack Interface, Dicey der 
Zufallszahlengenerator und Formally die Eule (die erbsenz&auml;hlende
Verifikationsmaschine) w&auml;ren n&uuml;tzliche Erweiterungen
in ToonTalk. Zur Zeit kann man aber hier eher nur
 kriechen statt zu gehen.&nbsp; 
Aber bevor wir anfangen ein "State-of-the-Art" Spiel 
(wie z.B. Pole Position) zu programmieren, m&uuml;ssen wir &uuml;berlegen,
zu welchem Zweck wir neues Leben in ToonTalk 
Stadt einf&uuml;hren.&nbsp; Wer wei&szlig;&nbsp; 
- vielleicht brauchen wir bald auch Polizisten!<BR>
<BR>
---<BR>
<BR>
Mit einem Augenzwinkern,<BR>
<BR>
-Eric<BR>
</P>
<P>&nbsp;</P></BODY>
</HTML>
