<HTML>

<HEAD>

<TITLE>Zusammenfassung der ToonTalk Tastaturkommandos</TITLE>

</HEAD>

<body bgcolor="#ffffff" text="#000000">

<P>
<CENTER><B><FONT SIZE=4>ToonTalk Tastaturkommandos<BR>
</FONT></B></CENTER>
<P>
<P>Wenn Du einen <A HREF="joystick.htm">Joystick</A> mit mehr als
2 Tasten angeschlossen hast, kannst Du die zus&auml;tzlichen 
Tasten anstelle von einigen folgenden Tastaturkommandos
benutzen.  </P>
<B><I><P>Nur F&Uuml;R FORTGESCHRITTENE BENUTZER:</B></I> </P>
<P>
Die folgenden Tastaturkommandos mu&szlig;t Du Dir nicht auswendig merken.
Die meisten Sachen kannst Du stattdessen auch mit der Maus und der Leertaste machen.
Mit der Tastatur geht es manchmal nur ein bi&szlig;chen schneller.
<P>
<B>Startseiten:</B>
<P>
Dr&uuml;cke irgendeine Taste, um weiterzugehen.
'Esc' &uuml;berspringt die restlichen Seiten.
<P>
<B>Beispiele:</B>
<P>
Wenn Du irgendeine Taste w&auml;hrend der Demonstration
eines Beispiels dr&uuml;ckst, stoppt ToonTalk und bietet Dir
an ToonTalk zu verlassen, die Kontrolle selbst zu &uuml;bernehmen oder
zum Beispiel zur&uuml;ckzukehren.
<P>
<B>Fliegen, gehen oder am Boden knien: </B>
<P>
Wenn Du die Pfeiltasten dr&uuml;ckst, kannst Du Dich in 8 Richtungen bewegen.
(Auf manchen Tastaturen gibt es nur 4 Pfeile. 
F&uuml;r diagonale Richtungen sind dann die Tasten <I>Pos1</I>, <I>Bild 
hoch</I>, <I>Bild runter</I> und <I>Ende</I> zu benutzen.)
Wenn Du sie gedr&uuml;ckt h&auml;lst, bewegst Du Dich kontinuierlich
in eine Richtung.
Du kannst auch gleichzeitig zwei Tasten dr&uuml;cken. 
<P>
Mit der Pause-Taste stoppst Du ToonTalk und hast die Wahl ToonTalk
zu verlassen, um sofort oder auch erst sp&auml;ter an gleicher Stelle weiterzumachen.
<P>
Mit F7 kannst Du viele Sachen schneller machen.
<P>
Mit F8 kannst Du alle <A HREF="robot.htm">Roboter</A>
und <A HREF="picture.htm">bewegte Bilder</A> in der gesamten Stadt
anhalten. Mit F8 schaltest Du dann alles auch wieder an.
<P>
Mit der F11-Taste schie&szlig;t Du einen Schnappschu&szlig;. Du findest das
Bild dann im ToonTalk Verzeichnis. Das Bild hat den Namen frm1234.bmp,
wobei 1234 die Nummer des Einzelbildes ist, und zeigt wann Du den Schnappschu&szlig;
in der Animation geschossen hast.
<P>
Mit der F12-Taste schie&szlig;t Du einen Schnappschu&szlig; und sicherst ihn
in der Windows Zwischenablage.
<P>
Die Bild-Hoch-Taste f&uuml;hrt dazu, da&szlig; <A HREF="marty.htm">Marty</A> 
mit seinem Text weitermacht.
<P>
Die Bild-Runter-Taste l&auml;&szlig;t Marty das Letzte wiederholen.
<P>
<A NAME="Helicopter"><B>Fliegen und Landen:</B></A>
<P>
Dr&uuml;cke u oder U, um h&ouml;her zu fliegen (<U>u</U>p). Es funktioniert
auch die rechte Maustaste.
<P>
Dr&uuml;cke d oder D, um tiefer zu fliegen (<U>d</U>own). Es funktioniert
auch die linke Maustaste.
<P>
<B>Drau&szlig;en herumlaufen:</B>
<P>
Mit h oder H holst Du Dir den <U>H</U>ubschrauber herbei.
Das geht auch mit dem Dr&uuml;cken einer Maustaste.
<P>
<A NAME="InRoom"><B>In einem Zimmer herumlaufen:</B></A>
<P>
Dr&uuml;cke irgendeine Taste, um Dich hinzuknien,
<P>
<A NAME="OnFloor"><B>Auf dem Fu&szlig;boden und in einem Gedanken:</B></A>
<P>
Dr&uuml;cke die <I>Escape</I>-Taste (mit dem Aufdruck <I>Esc</I>), um
vom Fu&szlig;boden aufzustehen oder vom Gedanken auf den Fu&szlig;boden zur&uuml;ckzukehren.
<P>
Dr&uuml;cke F1, um <A HREF="marty.htm">Marty</A> herbeizuholen oder, wenn
er schon da ist, ihn wegzuschicken,
<P>
<I>Und wenn Du nichts in der Hand h&auml;lst und auf nichts zeigst</I>.
<P>
Dr&uuml;cke u oder U, um aufzustehen (<U>u</U>p).
<P>
Dr&uuml;cke p oder P, um einen Gegenstand in die Hand zu nehmen (<U>p</U>ick up).
<P>
Dr&uuml;cke f oder F, um einen Gegenstand in die Hand zu nehmen und ihn 
umzudrehen (flip).
<P>
Dr&uuml;cke F9, um die Hand unsichtbar zu machen oder um sie sichtbar zu machen, falls sie
unsichtbar ist.
Siehe hierzu auch den <A HREF="sensor.htm#HandVisible">Regler f&uuml;r die Sichtbarkeit 
der Hand</A>.
<P>Hinweis: Der Grund, da&szlig; die Tastaturbefehle auf Textfeldern
nicht funktionieren ist, da&szlig; es Dir m&ouml;glich sein
mu&szlig; Text einzugeben. Du kannst ToonTalk mit "-b
0" starten, was anzeigt, da&szlig; Du nicht die Maustasten benutzt,
wenn Du am Boden sitzt. Dann kannst Du auch auch Kommandos eingeben,
wenn Du auf ein Textfeld zeigst.  </P>

<P>
<I>Und wenn Du etwas in der Hand h&auml;lst (au&szlig;er Text).</I>
<P>
Dr&uuml;cke f oder F, um einige Dinge umzudrehen (flip).
<P>
Dr&uuml;cke d oder D, um etwas hinzulegen (<U>d</U>rop).
<P>
<I>Und wenn Du ein Werkzeug h&auml;lst:</I>
<P>
Mit der Leertaste stellst Du ein Werkzeug an und wieder aus.
Der <A HREF="wand.htm">Zauberstaub</A>
&quot;stellt sich jedesmal selbst wieder aus&quot; nachdem er benutzt wurde.
<P>
<A NAME="Dusty"><I>Und wenn Du <A HREF="dusty.htm"><I>Dusty</I> 
in der Hand h&auml;lst</A>:</I></A>
<P>
Dr&uuml;cke s oder S, um Dusty anzuschalten damit er Gegenst&auml;nde aufsaugt.
(<U>S</U>augen ist die Voreinstellung.)
<P>
Dr&uuml;cke e oder E, um Dusty anzuschalten damit er Gegenst&auml;nde l&ouml;scht.
(<U>E</U>rase)
<P>
Dr&uuml;cke r oder R, um Dusty anzuschalten damit er Gegenst&auml;nde wieder
ausspuckt. (<U>R</U>estore oder <U>R</U>everse)
<P>
<A NAME="OLE_LINK2">Dr&uuml;cke F2, um Dusty herbeizuholen.</A> Er kommt dann
sofort in Deine Hand geeilt. Wenn Du dann nochmal F2 dr&uuml;ckst, beeilt er sich.
<P>
<A NAME="Pumpy"><I>Und wenn Du <A HREF="pumpy.htm"><I>Pumpy</I> in der Hand 
h&auml;lst</A>:</I></A>
<P>
Dr&uuml;cke b oder B, um ihn anzustellen damit er Gegenst&auml;nde gr&ouml;&szlig;er
macht (<U>b</U>igger). Das ist die Voreinstellung,
<P>
Dr&uuml;cke t oder T, um ihn anzustellen und Gegenst&auml;nde l&auml;nger zu machen 
(<U>t</U>aller).
<P>
Dr&uuml;cke w oder W, um ihn anzustellen und Gegenst&auml;nde breiter zu machen (<U>w</U>ider).
<P>
Dr&uuml;cke l oder L, um ihn anzustellen und Gegenst&auml;nde kleiner zu machen (<U>l</U>ittle).
<P>
Dr&uuml;cke n oder N, um ihn anzustellen und Gegenst&auml;nde schmaler zu machen (<U>n</U>arrower).
<P>
Dr&uuml;cke s oder S, um ihn anzustellen und Gegenst&auml;nde k&uuml;rzer zu machen (<U>s</U>horter).
<P>
Dr&uuml;cke g oder G, um ihn anzustellen und Gegenst&auml;nde wieder in die
richtige Gr&ouml;&szlig;e zu bringen (&quot;gute&quot; Gr&ouml;&szlig;e).
<P>
Mit F3 rufst Du Pumpy,  damit sie sofort in Deine Hand springt. Wenn Du dann nochmal F3
dr&uuml;ckst,  kommt sie ganz schnell.
<P>
<A NAME="MagicWand"><I>Und wenn Du den <A HREF="wand.htm"><I>Zauberstab</I> in der
Hand h&auml;lst</A>:</I></A>
<P>
Dr&uuml;cke o oder O, um eine Kopie des <U>o</U>riginal
Gegenstandes zu machen, der sich an der Spitze des Zauberstabs befindet.
<P>
Dr&uuml;cke c oder C, um eine Kopie (<U>c</U>opy) eines Gegenstandes zu machen.
<P>
Dr&uuml;cke s oder S, um eine Kopie des Zauberstabes <U>s</U>elbst zu machen.
<P>
Mit F5 kommt der Zauberstab in Deine Hand. Wenn Du dann nochmal F5
dr&uuml;ckst, kommt er ganz schnell. 
<P>
<I>Und wenn Du eine Bombe in der Hand h&auml;lst:</I>
<P>
Dr&uuml;cke irgendeine Taste, um die Bombe zu z&uuml;nden,
<P>
<A NAME="Notebook"><I>Und wenn Du ein
<A HREF="notebook.htm"><I>Notizbuch</I></A> in der Hand h&auml;lst oder darauf zeigst:</I></A>
<P>
Dr&uuml;cke - oder <I>Backspace</I>, um eine Seite zur&uuml;ckzubl&auml;ttern
(bl&auml;ttert zur letzten Seite, falls Du auf der ersten Seite bist).
<P>
Dr&uuml;cke + oder Leertaste, um zur n&auml;chsten Seite zu bl&auml;ttern.
<P>
Gib eine Ziffer (0 - 9) ein, um direkt zu einer Seite zu wechseln.
<P>
Mit F4 kommt das Notizbuch, das Du zuletzt benutzt hast, zu Dir.
Wenn Du nochmal F4 dr&uuml;ckst, kommt es schneller.
<P>
<I>Und wenn Du eine <A HREF="number.htm"><I>Zahl</I></A> in der Hand h&auml;lst
oder daraufzeigst:</I>
<P>
Gib Ziffern (0 - 9) ein, um eine Zahl einzugeben.
<P>
Mit <I>Backspace</I> l&ouml;scht Du die letzte Ziffer.
<P>
Mit +, -, /, *, x, %, ^, &amp; , | oder = gibst Du einen Operator
f&uuml;r Zahlen ein.
<P>
Mit f oder F drehst Du eine Zahl um (<U>f</U>lip). (Funktioniert
nur, wenn Du eine Zahl in der Hand h&auml;lst.)
<P>
<I>Und wenn Du ein <A HREF="text.htm"><I>Textfeld</I></A> in der Hand h&auml;lst oder darauf 
zeigst:</I>
<P>
Gib irgendeinen Text ein. 
<P>
Mit <I>Backspace</I> l&ouml;scht Du das letzte Zeichen.

<P>
<A NAME="Picture"><I>Und wenn Du ein <A HREF="picture.htm"><I>Bild oder
einen animierten Clip</I></A> h&auml;lst oder darauf zeigst:</I></A>
<P>
Mit + oder der Leertaste wechselst Du zum n&auml;chsten Zyklus, Element oder zur
n&auml;chsten Farbe.
<P>
Mit - oder <I>Backspace</I> gehst Du zur&uuml;ck.
<P>
Mit f oder F drehst Du es um (<U>f</U>lip over).<BR>

<I><P>Und wenn Du einen </I><A
HREF="sound.htm">Sound</A><I> h&auml;lst oder darauf zeigst:</P>                     
</I><P>Jede Taste erzeugt T&ouml;ne.<BR>

</BODY>

</HTML>
