<HTML>

<HEAD>

<TITLE>Wie man in ToonTalk R&auml;tsel erzeugt</TITLE>

</HEAD>

<body bgcolor="#ffffff" text="#000000">

<CENTER> Wie man in ToonTalk R&auml;tsel erzeugt</CENTER>

Du kannst Dein eigenes R&auml;tsel erzeugen und es anderen
weitergeben. Empfohlen wird das nur forgeschrittenen Benutzern.

<P>
Ein R&auml;tsel wird durch eine Datei beschrieben, die aus den folgenden 6 Teilen besteht,
die durch jeweils eine Leerzeile getrennt sind:
<OL>
<LI><B>Einleitender Text.</B> Das ist der Text, den Marty erz&auml;hlt, wenn
Du ihn siehst.
<LI><B>Text an der Wand. </B>Das ist der Text, den Du an der Wand siehst.
Wenn der Text mehrere Zeichen der Form "#" beinhaltet, dann werden sie
durch ein Bild, welches  das Ergebnis (der Regelauswertung) darstellt, ersetzt.
<LI><B>Initialkonfiguration auf dem Fu&szlig;boden.</B> Du erzeugst die
Initialkonfiguration indem Du Gegenst&auml;nde auf den Fu&szlig;boden legst,
F6 dr&uuml;ckst und dann das Ergebnis in eine Datei kopierst.
Beachte, da&szlig; hierbei die Dinge, die Du in der Hand h&auml;lst, nicht ber&uuml;cksichtigt werden.
<LI><B>Ergebnis.</B> Erzeuge zuerst ein Objekt, das der L&ouml;sung entspricht.
Falls das Objekt nicht genau so aussehen mu&szlig;, kannst Du mit dem Staubsauger ein paar
Details wegsaugen. Leg das Objekt dann auf das Zwischenablageobjekt
auf Seite 30 von Deinem Sensor-Notizbuch. F&uuml;ge dann das Ergebnis ein.
<LI><B>Optionen</B>. Typische Optionen sind: 
</OL>

<UL>
<LI>Goal box: 40 44 31 16 <br>
       <I>Das bedeutet, da&szlig; das Ergebnis an der
Wand an Position 40,44 gezeigt wird und 31x16 gro&szlig; ist
(Gr&ouml;&szlig;e in Prozent der Breite und H&ouml;he des Bildschirms).
Es ist normalerweise einfacher </I> #### zum Text 
an der Wand hinzuzuf&uuml;gen.
<LI>NumberTyping = off <br>
<I>Eingabe von Zahlen nicht mehr m&ouml;glich.</I>
<LI>TextTyping = off <br>
      <I>Eingabe von Text nicht mehr m&ouml;glich.</I>
<LI>Flipping = off <br>
      <I>Umdrehen von Gegenst&auml;nden nicht
mehr  erlaubt.</I>
<LI>FunctionKeys = off <br>
     <I>Benutzung von Funktionstasten ausgeschaltet.</I> 
</UL>

<OL>
<LI><B>Hinweise.</B> Jedesmal, wenn Du zu Marty zur&uuml;ckkehrst
gibt er Dir einen Hinweis. Jeder Hinweis ist durch eine
leere Zeile getrennt.
</OL>

<P>
Jedes der 6 Teile eines R&auml;tsels ist durch eine  Zeile getrennt.
Die Erweiterung des Dateinamens ist als  PZL festgelegt.
ToonTalk R&auml;tseldateien werden wie folgt mit Namen versehen:
p&lt;irgendeine Zahl&gt;.pzl. Du kannst Dein R&auml;tsel ausprobieren,
wenn Du ToonTalk mit
-puzzle &lt;R&auml;tseldateiname&gt in der Kommandozeile aufrufst.
Oder Du kannst das R&auml;tsel mit Doppelklick aufrufen, wenn der Dateiname
mit PZL aufh&ouml;rt. Wenn ein R&auml;tsel gel&ouml;st wurde und die 
R&auml;tseldateinamen mit einer Zahl versehen sind, versucht ToonTalk das
n&auml;chste R&auml;tsel zu laden.
So kann zum Beispiel puz27.pzl ein Name f&uuml;r eine R&auml;tseldatei sein.
Wenn Du selbst ein paar sch&ouml;ne R&auml;tsel erzeugt hast,
<A HREF="file:///C:/Program Files/Netscape/Navigator/mailto:KenKahn@ToonTalk.com">
sende sie mir mit Email</A>, dann werden sie zur ToonTalk
Web-Seite hinzugef&uuml;gt. <BR>

<P>
<A HREF="toontalk.htm"><FONT SIZE=4>Zur&uuml;ck zur ToonTalk Homepage.</FONT></A>

</BODY>

</HTML>
