<HTML>

<HEAD>

<TITLE>ToonTalk anpassen</TITLE>


</HEAD>

<body bgcolor="#ffffff" text="#000000">

<P>
<CENTER><B><FONT SIZE=4>ToonTalk anpassen</FONT></B></CENTER>
<P>
Auf Seite 10 Deines Haupt<A HREF="notebook.htm" >notizbuches</A> 
findest Du ein Notizbuch mit Optionen, um ToonTalk anzupassen.
Sie funktionieren &auml;hnlich wie die <A HREF="remote.htm" >Steuerungen f&uuml;r
Bilder</A> und <A HREF="sensor.htm" >Sensoren</A>.  
Alle Steuerungen ver&auml;ndern Dinge f&uuml;r den aktuellen Benutzer und
nicht f&uuml;r alle Benutzer.
Einstellungen f&uuml;r alle Benutzer kannst Du mit den
<A HREF="command.htm" >Kommandozeilenoptionen</A> durchf&uuml;hren.
<P>
<I><B>NUR F&Uuml;r FORTGESCHRITTENE BENUTZER:</B></I>
<P>
Die Steuerungen zur Anpassung der Umgebung im Optionsnotizbuch
sind: 
<UL>
<LI><A NAME="HeadLooks"><B>Seite 2.</B> Steuerung, wie Du aussiehst.
Du kannst darauf zeigen oder die Steuerung nehmen und die Leertaste
dr&uuml;cken, um die n&auml;chste Option auszuw&auml;hlen.
Du kannst zwischen Helm, mit oder ohne Haar
ausw&auml;hlen.
Siehe hierzu auch die </A>
<A HREF="command.htm#HeadLook" >Kommandozeilenoption</A>.
<LI><B>Seite 4.</B>  Die Steuerung, ob der Ton angeschaltet ist.
Mit der Leertaste wechselst Du von
&quot;Ja&quot; nach &quot;Nein&quot; und wenn Du nochmal
dr&uuml;ckst, wechselst Du zur&uuml;ck nach &quot;Ja&quot;.
<LI><B>Seite 6.</B>  Steuerung f&uuml;r die Gr&ouml;&szlig;e der Stadt
(zwischen 1 und 255). Falls die Zahl negativ ist, wird die Stadt nur zur
H&auml;lfte gef&uuml;llt.
Das hat erst Auswirkung, wenn Du ToonTalk neu startest.
<LI><B>Seite 8.</B> Benutzung der Maustasten.
Normalerweise sind die Maustasten immer gleich belegt bis auf
das Steuern des Hubschraubers.
Die mittlere und rechte Maustaste k&ouml;nnen zus&auml;tzlich
mit vielen Kommandoabk&uuml;rzungen
belegt werden. F&uuml;r weitere Details siehe unter der Rubrik
<A HREF="mouse.htm" >Maustasten</A> nach.
<LI><B>Seite 10.</B> Steuerung der Fenstergr&ouml;&szlig;e.
Die Voreinstellung ist die volle Bildschirmgr&ouml;&szlig;e.
Dies kann 1x (320x240), 2x (640x480) bis zu 4x sein.
Wenn der Wert gleich oder gr&ouml;&szlig;er als die Bildschirmgr&ouml;&szlig;e gesetzt
wurde, arbeitet ToonTalk in einer sog. "soft Version" des Vollbildmodus.
In diesem Modus ist ToonTalk typischerweise langsamer und animiert
ruckartiger. Auf manchen Computern kann diese Einstellung dennoch besser funktionieren.
Unter Windows NT funktioniert die Vollbildeinstellung (f&uuml;r die
16 Bit Version von ToonTalk) nicht.
<LI><B>Seite 12.</B> Geschwindigkeit von ToonTalk.  Die Voreinstellung
ist 100.  Falls diese Zahl gr&ouml;&szlig;er als 100 ist, arbeitet die
Animation schneller. Wenn sie kleiner als 100 ist, ist die Animation
langsamer. Dies wird im Fibonacci Beispiel benutzt.
<LI><B>Seite 14.</B> Minimale Bildwechselrate.
Die Voreinstellung ist 0. Gr&ouml;&szlig;ere Zahlen verlangsamen die Animation.
<LI><B>Seite 16.</B>  Martys Schriftgr&ouml;&szlig;e. Die Voreinstellung ist 100.  
Gr&ouml;&szlig;ere Zahlen vergr&ouml;&szlig;ern den Text in Martys Sprechblase.
<LI><B>Seite 18.</B>  Martys Sprechgeschwindigkeit. Die Voreinstellung ist 100. 
Gr&ouml;&szlig;ere Zahlen f&uuml;hren dazu, da&szlig; er l&auml;nger wartet bevor er den
n&auml;chsten Text in der Sprechblase anzeigt.
<LI><B>Seite 20.</B>  Martys Sprechstufe.  Die Voreinstellung ist 2. 
Werte zwischen 0 und 5 sind m&ouml;glich. Bei 0 erz&auml;hlt Marty alles
was er wei&szlig;. Bei 0 erz&auml;hlt er nichts.
<LI><B>Seite 22.</B>  An welchen Port ein Hyperbot Controller 
angeschlossen ist.
Hyperbot Controller sind zur Steuerung vieler Spielzeuge
von LEGO, Technic und Capsula.  Sende eine 
<A HREF="mailTo:KenKahn@ToonTalk.com" >Email</A>, um mehr Informationen
zu bekommen.
</UL>

</BODY>

</HTML>
