<HTML>

<HEAD>

<TITLE>Benutzen von Bildern und Animationsclips in ToonTalk</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.0z">
</HEAD>

<body bgcolor="#ffffff" text="#000000">

<P>
<CENTER><B><FONT SIZE=4>Benutzen von Bildern und Animationclips</FONT></B></CENTER>
<P>
Dein Haupt<A HREF="notebook.htm">notizbuch</A> beinhaltet auf Seite 2
eine Sammlung von Bildern und Animationen.
Du brauchst sie dort nur herausnehmen. Wenn Du eine Animation ausgew&auml;hlt hast,
startet diese sofort. Einige der Animationen haben mehr als einen 
Animationszyklus.
Zur Auswahl kannst Du auch <A HREF="keyboard.htm#Pictures">Tastaturkommandos</A>
benutzen.
<P>
Wenn Du Bilder (oder Animationen) aufeinander legst, dann klopft
<A HREF="bammer.htm">Bammer</A> sie zusammen.
Sie bleiben solange zusammen bis Du 
<A HREF="dusty.htm">Dusty</A> benutzt, um sie wieder zu trennen.
<P>
Du kannst Bilder umdrehen, wenn Du
&quot;f&quot; dr&uuml;ckst w&auml;hrend Du sie in der Hand h&auml;lst.
Du siehst dann eine gro&szlig;e graue Fl&auml;che auf der R&uuml;ckseite.
Aus ihr kommt  ein Notizbuch voller 
<A HREF="remote.htm">Steuerungen und Sensoren</A> 
herausgeflogen. Mit diesen Steuerungen kannst Du den
Ort von Bildern, ihre Geschwindigkeit, ihre Gr&ouml;&szlig;e und
ihr Aussehen ver&auml;ndern. Du findest dort auch einen Sensor, der
anzeigt, wenn das Bild mit irgendetwas zusammenst&ouml;&szlig;t.
Du kannst <A HREF="robot.htm">Roboter</A> so trainieren, da&szlig;
sie mit den Steuerungen und Sensoren arbeiten und sie dann auf
die R&uuml;ckseite des Bildes legen.
Du kannst danach den Robotern die Beh&auml;lter geben, die sie brauchen.
Wenn Du  dann das Bild wieder herumdrehst, fangen die Roboter an zu
arbeiten. Dadurch kannst Du einem Bild jedes nur denkbare Verhalten geben.
So k&ouml;nnen sie zum Beispiel herumspringen, bei Kontakt explodieren,
einen kleinen Tanz auff&uuml;hren und vieles mehr.
Das &quot;Ping Pong&quot;-Beispiel zeigt zwei M&ouml;glichkeiten, wie man diese
Dinge nutzen kann, um ein &quot;Ping Pong&quot;-Spiel zu bauen.
<P>
<B>Tip. </B>Du kannst ein Bild herumdrehen und es dann auf die R&uuml;ckseite
eines anderen Bildes legen. Das geht viel schneller, als wenn man
eine Menge Roboter und Beh&auml;lter von einem Bild zum anderen
bewegt.
<P>
<B>Tip.</B> Die meisten Spiele sind mit Hilfe sogenannter <I>Sprites</I> aufgebaut
- das sind kleine Animationszyklen, die sich bewegen und eigenst&auml;ndig 
verhalten k&ouml;nnen. So ist auch die Animation von ToonTalk Robotern
aufgebaut.
<P>
<B>Leere Bilder.</B> Du kannst Dusty benutzen, um ein leeres Bild
zu erzeugen. Dies ist f&uuml;r die Darstellung in 
<A HREF="bubble.htm">Gedanken</A>, wenn Du willst, 
da&szlig; ein Roboter &uuml;bergeben bekommt und damit 
irgendetwas macht.
<P>
<B>Tip.</B>  Du kannst
<A HREF="sensor.htm#PictureFile" >Deine eigenen Bilder in ToonTalk</A>
benutzen, wenn Du einen der Sensoren verwendest.
<P>
<B>Tip f&uuml;r Fortgeschrittene.</B> Du kannst Zahlen und Texte so ver&auml;ndern,
da&szlig; sie sich wie Bilder verhalten, wenn Du eine Zahl oder einen Text
auf ein leeres Bild legst. Du kannst dann auch Roboter auf der
R&uuml;ckseite hinzuf&uuml;gen. Das &quot;Ping Pong&quot;-Beispiel zeigt Kindern,
wie man eine Spielstandsanzeige baut, indem ein Roboter zur R&uuml;ckseite
des Bildes einer Zahl hinzugef&uuml;gt wird.
</BODY>

</HTML>
