<HTML>

<HEAD>

<TITLE>ToonTalk Programme</TITLE>

</HEAD>

<body bgcolor="#ffffff" text="#000000">

<P>
Hier wird erkl&auml;rt, wo man Programme finden kann, die andere mit ToonTalk
programmiert haben. Diese Programme sind kostenlos und d&uuml;rfen weiter
verteilt werden. Sie d&uuml;rfen nicht mit Gewinn verkauft werden.
<P>
Die meisten der Programme werden nur mit der neuesten ToonTalk Version
ablauff&auml;hig sein.
<A HREF="patches.htm">Klicke hier </A>, um zu erfahren, wie Du Dein
System auf den neuesten Stand bringen kannst.
<P>
Wenn Du etwas tolles mit ToonTalk gebaut hast, verteile es in alle
Welt und <A HREF="contrib.htm">folge diesen Instruktionen</A>.
<P>
Hier ist eine Liste einiger Programme.
<OL>
<LI>Spiele Musik. <br>
ToonTalk kann Nachrichten an das Microsoft Window
Media Control Interface (MCI) senden. Ein sch&ouml;nes Beispiel ist 
<A HREF="../canyon.tt">Play Canyon</A> mit einem Bild von einem Schalter.
Auf der R&uuml;ckseite des Bildes befindet sich eine Roboter, der die Datei
&quot;canyon.mid&quot; des Windows Verzeichnis abspielt, wenn der
Schalter an ist und es sich auf dem Fu&szlig;boden befindet.
<LI><A NAME="Primes"></A><A HREF="../primes.tt">Bestimmen von Primzahlen</A>.<br>
Dies ist ein Notizbuch von Robotern, die das Sieb des Erathosthenes
zur Bestimmung von Primzahlen programmieren.
Der beste Weg das Programm zu beobachten ist, dem Roboter auf Seite 2
einen Beh&auml;lter mit einem Vogel zu &uuml;bergeben. Mit F8 kannst Du
dann alle Roboter stoppen. Steige danach in den Hubschrauber und dr&uuml;cke 
nochmal F8, um die Roboter wieder zu starten. Jetzt kannst Du beobachten,
wie ein Haus gebaut wird, das einen Roboter enth&auml;lt. Der Roboter gibt 
einem Vogel eine 2, dann eine 3, eine 4, eine 5 und so weiter.
Der Vogel bringt die Zahl in sein Nest in einem neuen Haus.
Das erste Haus hat Roboter, die alle Zahlen zur&uuml;ckh&auml;lt, die durch 2 teilbar sind.
Das zweite Haus hat Roboter, die alle Zahlen zur&uuml;ckh&auml;lt, die durch 3 teilbar sind usw.
Wenn eine Zahl alle existierenden H&auml;user durchlaufen hat, ist sie
eine Primzahl und ein neues Haus wird gebaut, das alle Zahlen herausfiltert,
die durch sie teilbar sind.
<LI><A NAME="SingleFactorial"></A><A HREF="../fact.tt">Rekursive 
Fakult&auml;t</A>.<br>
Das ist ein Notizbuch mit Robotern, das das Produkt von Zahlen von
1 bis n mit einer rekursiven Methode berechnet.
Eine der mit ToonTalk mitgelieferten Beispiele zeigt, wie man ein
iteratives Programm zur Fakult&auml;t baut.
Die Roboter befinden sich bei den Beispielen im Notizbuch auf Seite
6 Deines Hauptnotizbuches. Es macht Spa&szlig;, diese Roboter aus dem
Hubschrauber zu beobachten. (Informatiker sollten in der Lage sein, den
Stapel vom Hubschrauber aus zu beobachten.)
<LI><A NAME="DoubleFactorial"></A><A HREF="../dfact.tt">Doppelt rekursive
Fakult&auml;t.</A><br>
Dieses Programm berechnet dieselben Werte wie die einfach-rekursive
Version zuvor. Von au&szlig;erhalb siehst Du aber keinen Stapel, sondern einen
Baum von H&auml;usern, der w&auml;chst und wieder schrumpft.
<LI><A HREF="../spinner.tt">Eine sich drehende  Person</A>. <br>
Dies ist nur ein Bild, das umherirrt. Auf der R&uuml;ckseite ist ein Roboter,
der dauernd eine 1 zu einem Parameter addiert. 
Der Parameter steuert in welche Richtung die Person geht.
<LI><A HREF="../dizzy.tt">Ein verwirrter Gelehrter.</A> 
Dies zeigt eine Animation einer verwirrten Person, die
&uuml;ber Rechtecke und Kreise nachdenkt.
</LI>
<LI><A NAME="Behaviors"></A>Aufregendes Verhalten. 
Ein verwirrter Gelehrter, der dadurch erzeugt wurde, da&szlig;
verschiedene Verhalten auf die R&uuml;ckseite des Quadrats
und des Kreises gepackt wurden. Das Verhalten wurde in ToonTalk 
eingebaut. Es umfa&szlig;t Richtung eines Tores driften,
Ecken herausschlagen, Geschwindigkeitsbegrenzung einhalten,
andere angreifen und vieles mehr befindet sich in
<A HREF="../behave.tt">diesem Notizbuch</A>.</LI>
</OL>

<P>
<A HREF="toontalk.htm"><FONT SIZE=4>Zur&uuml;ck zur ToonTalk Homepage.</FONT></A>

</BODY>

</HTML>
