<HTML>

<HEAD>

<TITLE>Wie man Sensoren in ToonTalk benutzt</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.0z">
</HEAD>
<body bgcolor="#ffffff" text="#000000">

<P>
<CENTER><B><FONT SIZE=4>Wie man Sensoren benutzt</FONT></B></CENTER>
<P>
Auf Seite 4 Deines Hauptnotizbuches befindet sich ein Notizbuch voller
Sensoren. Sie kann man benutzen, um Dinge auf Eigaben mit der Maus
oder Tastatur reagieren zu lassen. Es gibt au&szlig;erdem Sensoren, um Zeit zu stoppen,
f&uuml;r Zufallszahlen und um Hausnummern herauszufinden.
Andere Sensoren kann man benutzen, um Bilder, Sound und Text 
nach ToonTalk zu importieren.
Sensoren verhalten sich &auml;hnlich wie
<A HREF="remote.htm">Steuerungen f&uuml;r Bilder</A>.
<P>
Die folgenden Sensoren befinden sich im Notizbuch:
<UL>
<LI><B>Seite 2.</B> 
Dieser Sensor zeigt an wie schnell sich die
Maus am Computer (nicht <A HREF="bammer.htm">Bammer</A>) 
von links nach rechts bewegt.
Wenn die Zahl negativ ist, bewegt sich die Maus von rechts nach links.
Ein Wert von 1000 bedeutet, da&szlig; die Maus den Bildschirm in
1 Sekunde &uuml;berquert.
<LI><B>Seite 4.</B> 
Dieser Sensor zeigt an wie schnell sich die
Maus am Computer nach oben bewegt.
Wenn die Zahl negativ ist, bewegt sich die Maus nach unten.
Ein Wert von 1000 bedeutet, da&szlig; die Maus den Bildschirm in
1 Sekunde &uuml;berquert.
<LI><B>Seite 6.</B> 
Dieser Sensor gibt Antwort auf die Frage &quot;Wurde gerade
die linke Maustaste gedr&uuml;ckt?&quot; Wenn Du die linke Maustaste
dr&uuml;ckst, wechselt der Sensor von &quot;Nein&quot; nach &quot;Ja&quot;
und sehr schnell wieder zur&uuml;ck nach &quot;Nein&quot;.
Ein Roboter kann den Sensor nehmen und darauf reagieren, wenn
der Wert &quot;Ja&quot; ist. 
<LI><B>Seite 8.</B> 
Dieser Sensor gibt Antwort auf die Frage &quot;Wurde gerade
die mittlere Maustaste gedr&uuml;ckt?&quot; Wenn Du die mittlere Maustaste
dr&uuml;ckst, wechselt der Sensor von &quot;Nein&quot; nach &quot;Ja&quot;
und sehr schnell wieder zur&uuml;ck nach &quot;Nein&quot;.
<LI><B>Seite 10.</B> 
Dieser Sensor gibt Antwort auf die Frage &quot;Wurde gerade
die rechte Maustaste gerdr&uuml;ckt?&quot; Wenn Du die rechte Maustaste
dr&uuml;ckst, wechselt der Sensor von &quot;Nein&quot; nach &quot;Ja&quot;
und sehr schnell wieder zur&uuml;ck nach &quot;Nein&quot;.
<LI><B>Seite 12.</B> 
Dieser Sensor gibt Antwort auf die Frage &quot;Wird 
die linke Maustaste gerade gedr&uuml;ckt gehalten?&quot; 
Wenn Du die linke Maustaste
gedr&uuml;ckt h&auml;lst, wechselt der Sensor von &quot;Nein&quot; nach &quot;Ja&quot;
und bleibt solange auf &quot;Ja&quot; bis Du wieder losl&auml;&szlig;t.
<LI><B>Seite 14.</B> 
Dieser Sensor gibt Antwort auf die Frage &quot;Wird 
die mittlere Maustaste gerade gedr&uuml;ckt gehalten?&quot; 
Wenn Du die mittlere Maustaste
gedr&uuml;ckt h&auml;lst, wechselt der Sensor von &quot;Nein&quot; nach &quot;Ja&quot;
und bleibt solange auf &quot;Ja&quot; bis Du wieder losl&auml;&szlig;t.
<LI><B>Seite 16.</B> 
Dieser Sensor gibt Antwort auf die Frage &quot;Wird 
die rechte Maustaste gerade gedr&uuml;ckt gehalten?&quot; 
Wenn Du die rechte Maustaste
gedr&uuml;ckt h&auml;lst, wechselt der Sensor von &quot;Nein&quot; nach &quot;Ja&quot;
und bleibt solange auf &quot;Ja&quot; bis Du wieder losl&auml;&szlig;t.
<LI><B>Seite 18.</B> 
Dieser Sensor zeigt Dir an, welche Taste auf der Tastatur Du gedr&uuml;ckt hast.
Der Sensor wechselt sehr schnell von einem leeren Feld zum Wert der Taste und 
wieder zur&uuml;ck. Ein Roboter kann so trainiert werden, da&szlig; er auf den
schnellen Wechsel reagieren kann.
<LI><B>Seite 20.</B> 
Dieser Sensor zeigt an, welche Taste Du zuletzt gedr&uuml;ckt hattest.
Es zeigt den Wert solange an bis Du eine andere Taste dr&uuml;ckst.
<LI><A NAME="OLE_LINK2"><B>Seite 22.</B> 
Dieser Sensor gibt Antwort auf die Frage
&quot;Ist gerade die <I>Shift</I>-Taste der Tastatur gedr&uuml;ckt?&quot;</A>
<LI><B>Seite 24.</B> 
Dieser Sensor gibt Antwort auf die Frage
&quot;Ist gerade die <I>Strg</I>-Taste (manchmal auch mit der
Aufschrift <I>Ctrl</I>) der Tastatur gedr&uuml;ckt?&quot;</A>
<LI><B>Seite 26.</B> 
Dieser Sensor beantwortet die Frage &quot; Wieviel Zeit ist vergangen
seitdem Du diese Frage beantwortet hast?&quot;.
Die Anwort ist ein Wert in Millisekunden (1 Tausendstel einer Sekunde).
Mit diesem Sensor kann man Wecker und Uhren bauen.
<LI><B>Seite 28.</B> 
Dieser Sensor liefert Dir eine Zahl zwischen 1 und 1000.
Er versucht eine <I>Zufallszahl</I> zu erzeugen, genauso als ob gew&uuml;rfelt 
oder ein M&uuml;nze geworfen w&uuml;rde.
Wenn Du eine Kopie der Zahl haben willst, die sich nicht ver&auml;ndert,
lege die Zahl auf eine 0.
<LI><A NAME="Clipboard"><B>Seite 30.</B> 
Dieser Sensor verbindet ToonTalk mit der <I>Zwischenablage</I> von
Microsoft Windows. Wenn Du etwas auf den Sensor legst, wenn er leer
(schwarz) ist, dann kommt Bammer und h&auml;mmert es in die 
Zwischenablage. Du kannst dann in ein anderes Windows Programm
wie zum Beispiel Mail oder ein Textverarbeitungsprogramm gehen,
den Befehl <I>Einf&uuml;gen</I> ausf&uuml;hren
(normalerweise im <I>Bearbeiten</I>-Men&uuml;).
Der Text, der dann eingef&uuml;gt wurde, kann dann in einer Datei gesichert,
mit E-Mail verschickt oder anders genutzt werden.
Du kannst auf diese Weise aber auch etwas nach ToonTalk kopieren.
Durch den Befehl <I>Kopiere</I> kopierst Du etwas in die Zwischenablage.
Der ToonTalk Sensor der Zwischenablage zeigt dann das Objekt an.
</A><A HREF="dusty.htm">Dusty</A>
kann das Objekt dann entfernen und irgendwo anders in ToonTalk wieder
ausspucken. Auf diesem Weg kann man auch Text nach ToonTalk importieren.
<LI><A NAME="HandVisible"><B>Seite 32.</B> 
Dieser Sensor beantwortet die Frage
&quot;Ist Deine Hand sichtbar?&quot;. 
Wenn Du die Leertaste dr&uuml;ckst w&auml;hrend Du den Sensor h&auml;lst oder auf 
ihn zeigst, schaltest Du Deine Hand von sichtbar auf unsichtbar und 
wieder zur&uuml;ck. Wenn Du zum Beispiel ein Spiel wie Ping Pong
(auf Seite 24 des Beispielenotizbuches; Seite 6 Deines 
Hauptnotizbuches) spielst, willst Du normalerweise Deine Hand nicht sehen.
Wenn man Sachen nicht selbst machen will, kann man nach dem Start
des Spieles auch besser Roboter einsetzen. Du kannst Deine Hand auch unsichtbar
machen, wenn Du F9 dr&uuml;ckst. Wenn Du dann nochmal F9 dr&uuml;ckst, ist sie
wieder sichtbar.</A>
<LI><A NAME="PictureFile"><B>Seite 34. </B>
Dieser Sensor wandelt Dateinamen in Bilder um. Wenn Du ein Textfeld mit
dem Dateinamen einer Windows BMP-Datei auf den Sensor legst, kommt
</A><A HREF="bammer.htm">Bammer</A> und h&auml;mmert es in den Sensor.
Du kannst dann das Bild mit <A HREF="dusty.htm">Dusty</A> entnehmen und weiterverwenden.
BMP-Dateien kann man auf viele verschiedene Arten erzeugen.
Das Paint-Brush-Programm, was in Windows enthalten ist, erzeugt BMP-Dateien.
Du kannst die schwarzen Farben in Deinem Bild mit der
<A HREF="remote.htm#Visible">Sichtbarkeitssteuerung</A>
durchsichtig machen.
<LI><A NAME="SoundFile"><B>Seite 36. </B>
Dieser Sensor wandelt Dateinamen in Sound oder Musik um.
Hierzu mu&szlig;t Du ein Textfeld mit dem Namen einer Windows WAV-Datei (Sound)
oder MID-Datei (Musik) auf den Sensor legen. 
</A><A HREF="bammer.htm">Bammer</A> 
h&auml;mmert dann das Textfeld in den Sensor. Der Ton ist 
bis zum Ende des Abspielens der Datei zu h&ouml;ren. Mit
<A HREF="dusty.htm">Dusty</A> kannst Du das Abspielen auch vorzeitig 
abbrechen.
Du kannst aber auch 
Microsoft's <A HREF="MCI.htm">Media Control Interface</A>
benutzen, um Sound- oder Musikdateien abzuspielen.
<LI><A NAME="Address"><B>Seite 38.</B> 
Auf dieser Seite befindet sich ein Beh&auml;lter mit 2 Sensoren, die
die </A><A HREF="location.htm">Adresse des Hauses</A>, in dem
sich das Notizbuch befindet, anzeigen.
Der erste Sensor zeigt die Nummer des Weges und der zweite Sensor zeigt
die Nummer der Stra&szlig;e an. Wege gehen von Nord nach S&uuml;d. Stra&szlig;en gehen
von Ost nach West. Du kannst neue Adressen aus alten erzeugen.
Wenn Du eine Adresse auf einen <A HREF="truck.htm">Lastwagen</A>
legst, dann baut die Besatzung des Lastwagens das Haus so nahe wie
m&ouml;glich an der gegebenen Adresse.
<LI><A NAME="Address"><B>Seite 40.</B>
Wenn Du eine Textfeld drauflegst, wird der Text gesprochen.
Das funktioniert nur in der 32-Bit Version. Diese Aktion erzeugt
ein <A HREF="sound.htm">Soundfeld</A> mit dem Du den Sensor
wegsaugen kannst.
<LI><A NAME="Address"><B>Seite 42.</B>
Diese Seite ist ein Beh&auml;lter mit 2 Sensoren, die die
<A HREF="location.htm">Adresse des Hauses</A> in dem Du bist anzeigen.
Der erste Sensor zeigt die Wegnummer under der zweite Sensor
die Stra&szlig;ennummer an. Wege gehen von Nord nach S&uuml;.
Stra&szlig;en von West nach Ost. Du kannst neue Adressen aus alten
generieren. Wenn Du eine Adresse auf einen <A HREF="truck.htm">
Lastwagen</A> legst, dann baut die Besatzung ein Haus, das
m&ouml;glichst nahe an der angegebenen Adresse liegt.
<LI><A NAME="Address"><B>Seite 44.</B>
Ein Notizbuch voller Joystick-Sensoren. Das Notizbuch erscheint nur
in der 32-Bit Version unter Windows 95 und wenn Du einen Joystick
am Computer angeschlossen hast.
Du mu&szlig; <A HREF="joycalib.htm">den Joystick oder Game
Controller erst in Windows 95 eintragen</A>.
Wenn Du mehr als einen Joystick angeschlossen hast, haben
die nachfolgenden Seiten auch Notizb&uuml;cher f&uuml;r die
anderen Joysticks. Es gibt eine ganze Menge <A HREF="joysense.htm">
Sensoren f&uuml;r Joysticks</A>.

</UL>

</BODY>

</HTML>
