<HTML>

<HEAD>

<TITLE>ToonTalk Tips</TITLE>

</HEAD>
<body bgcolor="#ffffff" text="#000000">

<P>
<CENTER><B><FONT SIZE=4>ToonTalk Tips</FONT></B></CENTER>
<OL>
<LI><B>Wie Du Deine Werkzeuge ver&auml;ndern kannst.</B> Du kannst
<A HREF="pumpy.htm">Pumpy</A> benutzen, um die Gr&ouml;&szlig;e von
<A HREF="tooly.htm">Tooly</A>, 
<A HREF="dusty.htm">Dusty</A> 
dem <A HREF="wand.htm">Zauberstab</A>
und Deinem <A HREF="notebook.htm">Notizbuch</A>
zu ver&auml;ndern.
Du kannst sogar die Gr&ouml;&szlig;e von Pumpy ver&auml;ndern, wenn Du sie kopierst
und dann ihre Kopie benutzt, um sie zu verkleinern oder zu vergr&ouml;s&szlig;ern.
Wenn Du so mit verkleinerten Dingen arbeitest, hast Du mehr Platz zum
Arbeiten. Du kannst Deine Sachen in eine Bildschirmecke schieben und sie
dann mit den Funktionstasten herbeirufen (siehe hierzu die Beschreibung der 
<A HREF="keyboard.htm">Tastaturkommandos</A>).
Wenn Du fertig bist, kehren sie zu dem Ort zur&uuml;ck wo sie urspr&uuml;nglich
 waren.
<LI><B>Gezielte Hilfe.</B> <A HREF="marty.htm">Marty</A> der Au&szlig;erirdische
erkl&auml;rt Dir alles, was Du in der Hand h&auml;lst oder worauf Du zeigst,
wenn Du ihn mit F1 rufst. Das ist besonders n&uuml;tzlich um zu erfahren,
was der Roboter gerade macht.
<LI><B>Tricks zum Ver&auml;ndern eines Gedankens.</B> 
Du kannst <A HREF="dusty.htm">Dusty</A> benutzen, 
um einen ganzen Beh&auml;lter in einem
Gedanken eines Roboters aufzusaugen und ihn dann wieder auf dem 
Fu&szlig;boden auszuspucken. Dort ist er viel gr&ouml;&szlig;er und einfacher zu
ver&auml;ndern. Falls nicht, kannst Du <A HREF="pumpy.htm">Pumpy</A>
benutzen, um den Beh&auml;lter zu vergr&ouml;&szlig;ern. Du kannst am Fu&szlig;boden
die Ver&auml;nderungen machen und dann den Beh&auml;lter wieder in
den Gedanken zur&uuml;cklegen.
<LI><B>ToonTalks Benutzermodell.</B> 
Wenn Du Deinen Namen in ToonTalk eingibst, werden Dateien im Verzeichnis
&quot;Users&quot; einem Unterverzeichnis des ToonTalkverzeichnis' erzeugt.
Leerzeichen werden hierbei gel&ouml;scht und der Name wird auf 8 Zeichen verk&uuml;rzt,
wenn er l&auml;nger als 8 Zeichen lang ist.
Der Name "Albert Einstein" wird zum Beispiel
zu &quot;albertei&quot; umbenannt.
Diese Dateien beinhalten  ein Benutzermodell und wandern in Dein Notizbuch.
Das Benutzermodell (die USR-Datei) beinhaltet Deine pers&ouml;nlichen
Systemeinstellungen, den Spielstand Deiner R&auml;tsel und alle Deine Aktionen,
so da&szlig; Dir Marty immer nur neue Sachen erz&auml;hlt. Wenn Du ToonTalk lange nicht
benutzt hast oder das R&auml;tsel neu starten willst, solltest Du am Anfang einen
neuen Namen eingeben oder die USR-Datei mit Deinem Namen l&ouml;schen.
Wenn Du Dein Notizbuch ver&auml;ndert hast und die &Auml;nderungen nicht mehr
willst, kannst Du die BOK-Datei mit Deinem Namen l&ouml;schen oder umbenennen.
Wenn Du dann einige Dinge nicht verlieren willst, kannst
Du den 
<A HREF="sensor.htm#Clipboard">ToonTalk-Sensor zur Zwischenablage</A> benutzen,
um sie zu sichern.
<B><LI>Dinge ins Notizbuch oder in die Werkzeugkiste
zur&uumlcklegen.</B> Wenn Du etwas auf einen Stapel legst und es
ist identisch mit den anderen Sachne auf dem Stapel geht es
zur&uuml;ck zum Stapel. Wenn Du zum Beispieil ein Notizbuch
aus einem Notizbuch nimmst und es wieder zur&uuml;cklegen willst.
Wenn das Notizbuch vorher auf Seite 1 stand, mu&szlig;t Du es wieder
auf Seite 1 zur&uuml;cksetzen bevor Du es zur&uuml;cklegst.
<LI><A NAME="PicturesOnPictures"></A><B>Roboter trainieren,
um Bildern Bilder hinzuzuf&uuml;gen. </B>
F&uuml;r viele Spiele und grafische Anwendungen brauchst Du
Roboter, die <A HREF="picture.htm">Bildern</A> Bilder
hinzuf&uuml;gen. Hier ist eine M&ouml;glichkeit das zu tun.
Leg eine <A
HREF="remote.htm#RemoteLooks">Steuerung f&uuml;r das Aussehen
von Bildern</A> in einen Beh&auml;lter (das wird das
Hintergrundbild) und lege in die anderen F&auml;cher Bilder,
die Du hinzuf&uuml;gen willst.  Trainiere einen Roboter, da&szlig;
wenn er den Beh&auml;ter bekommt, ein Bild kopiert und herumdreht.
Nimm die Steuerung aus dem Notizbuch des neuen Bildes, das Du
brauchst (zum Beispiel die Steuerung f&uuml;r Position und
Gr&ouml;&szlig;e). Dreh' das Bild wieder zur&uuml;ck und leg'
es auf die Steuerung f&uuml;r das Aussehen des Hintergrundbildes.
Trainiere dann den Roboter, da&szlig; er die Steuerungen, die
Du entnommen hast, entsprechend ver&auml;ndert.
Damit der Roboter mit allem arbeitet, mu&szlig;t Du <A
HREF="dusty.htm">Dusty</A> nehmen, um einige Bilder in den
F&auml;chern seines Gedankens zu l&ouml;schen.
</OL>

</BODY>

</HTML>
